HloModule jit_scan, is_scheduled=true, entry_computation_layout={(f64[2,20]{1,0}, f64[2,20]{1,0}, f64[2,20]{1,0}, f64[2,20]{1,0}, f64[2,20]{1,0}, /*index=5*/f64[2,20]{1,0}, f64[2]{0}, f64[2,20]{1,0}, f64[2,20]{1,0}, f64[2,20]{1,0}, /*index=10*/f64[2,20]{1,0}, f64[2,20]{1,0}, f64[2,20]{1,0}, u32[10,2]{1,0})->(f64[2,20]{1,0}, f64[2,20]{1,0}, f64[2,20]{1,0}, f64[2,20]{1,0}, f64[2,20]{1,0}, /*index=5*/f64[2,20]{1,0}, f64[2]{0}, f64[2,20]{1,0}, f64[2,20]{1,0}, f64[2,20]{1,0}, /*index=10*/f64[2,20]{1,0}, f64[2,20]{1,0}, f64[2,20]{1,0}, f64[10,2,20]{2,1,0}, f64[10,2,20]{2,1,0}, /*index=15*/f64[10,2,20]{2,1,0}, f64[10,2,20]{2,1,0}, f64[10,2,20]{2,1,0}, f64[10,2,20]{2,1,0}, f64[10,2]{1,0}, /*index=20*/f64[10,2,20]{2,1,0}, f64[10,2,20]{2,1,0}, f64[10,2,20]{2,1,0}, f64[10,2,20]{2,1,0}, f64[10,2,20]{2,1,0}, /*index=25*/f64[10,2,20]{2,1,0}, f64[10,2,20]{2,1,0}, f64[10,2,20]{2,1,0}, f64[10,2,20]{2,1,0}, f64[10,2,20]{2,1,0}, /*index=30*/f64[10,2,20]{2,1,0}, f64[10,2,20]{2,1,0}, pred[10,2]{1,0}, pred[10,2]{1,0}, f64[10,2]{1,0}, /*index=35*/f64[10,2,20]{2,1,0}, f64[10,2,20]{2,1,0}, f64[10,2,20]{2,1,0}, f64[10,2,20]{2,1,0}, f64[10,2,20]{2,1,0}, /*index=40*/f64[10,2,20]{2,1,0}, f64[10,2,20]{2,1,0}, f64[10,2,20]{2,1,0}, f64[10,2,20]{2,1,0}, f64[10,2,20]{2,1,0}, /*index=45*/f64[10,2,20]{2,1,0}, f64[10,2,20]{2,1,0}, f64[10,2]{1,0}, f64[10,2,20]{2,1,0}, f64[10,2,20]{2,1,0}, /*index=50*/f64[10,2,20]{2,1,0}, f64[10,2,20]{2,1,0}, f64[10,2,20]{2,1,0}, f64[10,2,20]{2,1,0}, f64[10,2,20]{2,1,0}, /*index=55*/f64[10,2,20]{2,1,0}, f64[10,2,20]{2,1,0}, f64[10,2,20]{2,1,0}, f64[10,2,20]{2,1,0}, f64[10,2,20]{2,1,0}, /*index=60*/f64[10,2,20]{2,1,0}, f64[10,2,20]{2,1,0}, f64[10,2,20]{2,1,0}, f64[10,2,20]{2,1,0}, f64[10,2,20]{2,1,0}, /*index=65*/f64[10,2,20]{2,1,0}, f64[10,2]{1,0}, f64[10,2,20]{2,1,0}, f64[10,2,20]{2,1,0}, f64[10,2,20]{2,1,0}, /*index=70*/f64[10,2,20]{2,1,0}, f64[10,2,20]{2,1,0}, f64[10,2,20]{2,1,0}, s64[10,2]{1,0}, s64[10,2]{1,0}, /*index=75*/f64[10,2]{1,0})}, allow_spmd_sharding_propagation_to_parameters={true,true,true,true,true,true,true,true,true,true,true,true,true,true}, allow_spmd_sharding_propagation_to_output={true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true}, frontend_attributes={fingerprint_before_lhs="5e3bb714b1cb57c097cba169dc15b10c"}

fused_select {
  param_0.43 = s32[2]{0} parameter(0)
  param_2.59 = s32[2]{0} parameter(2)
  compare.1126.5 = pred[2]{0} compare(param_0.43, param_2.59), direction=GE, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body_pred/ge" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  param_1.66 = pred[2]{0} parameter(1)
  not.20.5 = pred[2]{0} not(param_1.66), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body_pred/not" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  and.64.5 = pred[2]{0} and(compare.1126.5, not.20.5), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body_pred/and" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  constant_1334_1 = s32[] constant(-1)
  broadcast.4010.1 = s32[2]{0} broadcast(constant_1334_1), dimensions={}
  add.3970.1 = s32[2]{0} add(param_0.43, broadcast.4010.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body/sub" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  select.2969.1 = s32[2]{0} select(and.64.5, add.3970.1, param_0.43), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while[cond_nconsts=1 body_nconsts=5]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  param_4.2829 = f64[2]{0} parameter(4)
  constant_6912_1_clone_1 = f64[] constant(0)
  broadcast.4015.clone.9.clone.1 = f64[2]{0} broadcast(constant_6912_1_clone_1), dimensions={}
  compare.1128.3.clone.1 = pred[2]{0} compare(param_4.2829, broadcast.4015.clone.9.clone.1), direction=LE, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body/le" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  param_3.4110 = f64[2]{0} parameter(3)
  compare.1129.5.clone.1 = pred[2]{0} compare(param_3.4110, broadcast.4015.clone.9.clone.1), direction=LE, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body/le" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  or.801.3.clone.1 = pred[2]{0} or(compare.1128.3.clone.1, compare.1129.5.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body/or" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  select.2971.1.clone.1 = pred[2]{0} select(and.64.5, or.801.3.clone.1, param_1.66), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while[cond_nconsts=1 body_nconsts=5]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  ROOT tuple.479 = (s32[2]{0}, pred[2]{0}) tuple(select.2969.1, select.2971.1.clone.1)
} // fused_select

scalar_add_computation {
  scalar_rhs = f64[] parameter(1)
  scalar_lhs = f64[] parameter(0)
  ROOT add.3969 = f64[] add(scalar_lhs, scalar_rhs)
}

fused_reduce {
  param_0.46 = f64[2,10,120]{2,1,0} parameter(0)
  iota.42.4 = s32[2,1]{1,0} iota(), iota_dimension=0, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body/iota[dtype=int32 shape=(2, 1) dimension=0]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  param_1.64 = s32[2]{0} parameter(1)
  constant_6918_1 = s32[] constant(0)
  broadcast.4011.2 = s32[2]{0} broadcast(constant_6918_1), dimensions={}
  compare.1127.4 = pred[2]{0} compare(param_1.64, broadcast.4011.2), direction=LT, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body/lt" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  constant_6920_1 = s32[] constant(10)
  broadcast.4012.4 = s32[2]{0} broadcast(constant_6920_1), dimensions={}
  add.3971.4 = s32[2]{0} add(param_1.64, broadcast.4012.4), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  select.2970.4 = s32[2]{0} select(compare.1127.4, add.3971.4, param_1.64), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  bitcast.10507.15 = s32[2,1]{1,0} bitcast(select.2970.4)
  broadcast.4013.4 = s32[2,1]{1,0} broadcast(constant_6918_1), dimensions={}
  concatenate.36.15 = s32[2,3]{1,0} concatenate(iota.42.4, bitcast.10507.15, broadcast.4013.4), dimensions={1}, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body/concatenate[dimension=1]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  gather.3.7 = f64[2,1,1,120]{3,0,2,1} gather(param_0.46, concatenate.36.15), offset_dims={1,2,3}, collapsed_slice_dims={}, start_index_map={0,1,2}, index_vector_dim=1, slice_sizes={1,1,120}, indices_are_sorted=true, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body/gather[dimension_numbers=GatherDimensionNumbers(offset_dims=(np.int64(1), np.int64(2)), collapsed_slice_dims=(0,), start_index_map=(0, np.int64(1), np.int64(2))) slice_sizes=(1, 1, 120) unique_indices=True indices_are_sorted=True mode=GatherScatterMode.PROMISE_IN_BOUNDS fill_value=None]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  bitcast.10535.11 = f64[2,120]{1,0} bitcast(gather.3.7)
  param_3.44 = f64[2,120]{1,0} parameter(3)
  param_4.41 = f64[2,10,120]{2,1,0} parameter(4)
  gather.4.9 = f64[2,1,1,120]{3,0,2,1} gather(param_4.41, concatenate.36.15), offset_dims={1,2,3}, collapsed_slice_dims={}, start_index_map={0,1,2}, index_vector_dim=1, slice_sizes={1,1,120}, indices_are_sorted=true, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body/gather[dimension_numbers=GatherDimensionNumbers(offset_dims=(np.int64(1), np.int64(2)), collapsed_slice_dims=(0,), start_index_map=(0, np.int64(1), np.int64(2))) slice_sizes=(1, 1, 120) unique_indices=True indices_are_sorted=True mode=GatherScatterMode.PROMISE_IN_BOUNDS fill_value=None]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  bitcast.10525.7 = f64[2,120]{1,0} bitcast(gather.4.9)
  subtract.218.7 = f64[2,120]{1,0} subtract(param_3.44, bitcast.10525.7), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body/sub" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  add.3972.7 = f64[2,120]{1,0} add(subtract.218.7, bitcast.10535.11), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  param_2.57 = f64[2,120]{1,0} parameter(2)
  add.3973.9 = f64[2,120]{1,0} add(param_2.57, bitcast.10535.11), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  constant_1117_1 = f64[] constant(0.5)
  broadcast.4014.7 = f64[2,120]{1,0} broadcast(constant_1117_1), dimensions={}
  multiply.2886.7 = f64[2,120]{1,0} multiply(add.3973.9, broadcast.4014.7), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body/div" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  subtract.219.5 = f64[2,120]{1,0} subtract(add.3972.7, multiply.2886.7), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body/sub" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  multiply.2887.3 = f64[2,120]{1,0} multiply(bitcast.10535.11, subtract.219.5)
  constant_6912_2 = f64[] constant(0)
  reduce.13.1 = f64[2]{0} reduce(multiply.2887.3, constant_6912_2), dimensions={1}, to_apply=scalar_add_computation, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body/dot_general[dimension_numbers=(((1,), (1,)), ((0,), (0,))) precision=None preferred_element_type=float64]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  multiply.2888.1.clone.1 = f64[2,120]{1,0} multiply(param_2.57, subtract.219.5)
  reduce.14.1.clone.1 = f64[2]{0} reduce(multiply.2888.1.clone.1, constant_6912_2), dimensions={1}, to_apply=scalar_add_computation, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body/dot_general[dimension_numbers=(((1,), (1,)), ((0,), (0,))) precision=None preferred_element_type=float64]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  ROOT tuple.478 = (f64[2]{0}, f64[2]{0}) tuple(reduce.13.1, reduce.14.1.clone.1)
} // fused_reduce

region_35.6903 {
  arg_tuple.6904.0 = (s32[2]{0}, pred[2]{0}, s32[2]{0}, f64[2,10,120]{2,1,0}, f64[2,120]{1,0}, /*index=5*/f64[2,10,120]{2,1,0}, f64[2,120]{1,0}) parameter(0)
  get-tuple-element.16403 = s32[2]{0} get-tuple-element(arg_tuple.6904.0), index=0
  get-tuple-element.16412 = s32[2]{0} get-tuple-element(arg_tuple.6904.0), index=2
  get-tuple-element.16413 = f64[2,10,120]{2,1,0} get-tuple-element(arg_tuple.6904.0), index=3
  get-tuple-element.16414 = f64[2,120]{1,0} get-tuple-element(arg_tuple.6904.0), index=4
  get-tuple-element.16415 = f64[2,10,120]{2,1,0} get-tuple-element(arg_tuple.6904.0), index=5
  get-tuple-element.16416 = f64[2,120]{1,0} get-tuple-element(arg_tuple.6904.0), index=6
  get-tuple-element.16404 = pred[2]{0} get-tuple-element(arg_tuple.6904.0), index=1
  input_reduce_fusion = (f64[2]{0}, f64[2]{0}) fusion(get-tuple-element.16415, get-tuple-element.16403, get-tuple-element.16416, get-tuple-element.16414, get-tuple-element.16413), kind=kInput, calls=fused_reduce, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body/dot_general[dimension_numbers=(((1,), (1,)), ((0,), (0,))) precision=None preferred_element_type=float64]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  get-tuple-element.15649 = f64[2]{0} get-tuple-element(input_reduce_fusion), index=1, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body/dot_general[dimension_numbers=(((1,), (1,)), ((0,), (0,))) precision=None preferred_element_type=float64]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  get-tuple-element.15648 = f64[2]{0} get-tuple-element(input_reduce_fusion), index=0, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body/dot_general[dimension_numbers=(((1,), (1,)), ((0,), (0,))) precision=None preferred_element_type=float64]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  loop_select_fusion = (s32[2]{0}, pred[2]{0}) fusion(get-tuple-element.16403, get-tuple-element.16404, get-tuple-element.16412, get-tuple-element.15649, get-tuple-element.15648), kind=kLoop, calls=fused_select, control-predecessors={input_reduce_fusion}, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while[cond_nconsts=1 body_nconsts=5]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  get-tuple-element.16411 = pred[2]{0} get-tuple-element(loop_select_fusion), index=1, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while[cond_nconsts=1 body_nconsts=5]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  get-tuple-element.16410 = s32[2]{0} get-tuple-element(loop_select_fusion), index=0, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while[cond_nconsts=1 body_nconsts=5]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  ROOT tuple.742 = (s32[2]{0}, pred[2]{0}, s32[2]{0}, f64[2,10,120]{2,1,0}, f64[2,120]{1,0}, /*index=5*/f64[2,10,120]{2,1,0}, f64[2,120]{1,0}) tuple(get-tuple-element.16410, get-tuple-element.16411, get-tuple-element.16412, get-tuple-element.16413, get-tuple-element.16414, /*index=5*/get-tuple-element.16415, get-tuple-element.16416)
} // region_35.6903

region_37.6968 {
  Arg_1.6970 = pred[] parameter(1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while[cond_nconsts=1 body_nconsts=5]"}
  Arg_0.6969 = pred[] parameter(0), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while[cond_nconsts=1 body_nconsts=5]"}
  ROOT or.802 = pred[] or(Arg_0.6969, Arg_1.6970), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while[cond_nconsts=1 body_nconsts=5]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
}

fused_reduce.1 {
  param_1.70 = s32[2]{0} parameter(1)
  param_2.63 = s32[2]{0} parameter(2)
  compare.1130.1 = pred[2]{0} compare(param_1.70, param_2.63), direction=GE, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/cond/ge" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  param_0.50 = pred[2]{0} parameter(0)
  not.21.1 = pred[2]{0} not(param_0.50), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/cond/not" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  and.65.1 = pred[2]{0} and(compare.1130.1, not.21.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/cond/and" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  constant_6981_1 = pred[] constant(false)
  ROOT reduce.6985.1 = pred[] reduce(and.65.1, constant_6981_1), dimensions={0}, to_apply=region_37.6968, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while[cond_nconsts=1 body_nconsts=5]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
} // fused_reduce.1

region_36.6972 {
  arg_tuple.6973.0 = (s32[2]{0}, pred[2]{0}, s32[2]{0}, f64[2,10,120]{2,1,0}, f64[2,120]{1,0}, /*index=5*/f64[2,10,120]{2,1,0}, f64[2,120]{1,0}) parameter(0)
  get-tuple-element.6974.0 = s32[2]{0} get-tuple-element(arg_tuple.6973.0), index=0
  get-tuple-element.6976.0 = s32[2]{0} get-tuple-element(arg_tuple.6973.0), index=2
  get-tuple-element.6975.0 = pred[2]{0} get-tuple-element(arg_tuple.6973.0), index=1
  ROOT input_reduce_fusion.1 = pred[] fusion(get-tuple-element.6975.0, get-tuple-element.6974.0, get-tuple-element.6976.0), kind=kInput, calls=fused_reduce.1, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while[cond_nconsts=1 body_nconsts=5]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
}

fused_broadcast.2 {
  constant_1429_3 = f64[] constant(0)
  ROOT broadcast.4019.1 = f64[20,1]{1,0} broadcast(constant_1429_3), dimensions={}
}

fused_broadcast.1 {
  constant_1429_2 = f64[] constant(0)
  ROOT broadcast.4016.1 = f64[20]{0} broadcast(constant_1429_2), dimensions={}
}

fused_broadcast {
  constant_1429_1 = f64[] constant(0)
  ROOT broadcast.4017.1 = f64[2,20]{1,0} broadcast(constant_1429_1), dimensions={}
}

wrapped_copy_computation.177 {
  param_0.5382 = f64[2,20]{1,0} parameter(0)
  ROOT copy.1366 = f64[2,20]{1,0} copy(param_0.5382)
}

fused_multiply_negate {
  param_0.5119 = f64[2,20]{1,0} parameter(0)
  param_4.2831 = f64[] parameter(4)
  broadcast.4018.1.clone.1 = f64[2,20]{1,0} broadcast(param_4.2831), dimensions={}, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  param_2.5642 = f64[2,20]{1,0} parameter(2)
  param_3.4114 = f64[2,20]{1,0} parameter(3)
  multiply.2889.2.clone.1 = f64[2,20]{1,0} multiply(param_2.5642, param_3.4114), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  negate.466.1.clone.1 = f64[2,20]{1,0} negate(multiply.2889.2.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/neg" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  multiply.2891.1.clone.1 = f64[2,20]{1,0} multiply(broadcast.4018.1.clone.1, negate.466.1.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  param_1.7154 = f64[2,20]{1,0} parameter(1)
  multiply.2892.1.clone.1 = f64[2,20]{1,0} multiply(multiply.2891.1.clone.1, param_1.7154), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  multiply.2893.1 = f64[2,20]{1,0} multiply(param_0.5119, multiply.2892.1.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  param_5.2375 = f64[2,20]{1,0} parameter(5)
  multiply.2890.1.clone.1 = f64[2,20]{1,0} multiply(negate.466.1.clone.1, param_5.2375), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  negate.467.1.clone.1 = f64[2,20]{1,0} negate(multiply.2890.1.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/neg" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  ROOT tuple.481 = (f64[2,20]{1,0}, f64[2,20]{1,0}, f64[2,20]{1,0}) tuple(multiply.2893.1, multiply.2892.1.clone.1, negate.467.1.clone.1)
} // fused_multiply_negate

command_buffer.22 {
  p.934 = f64[2,20]{1,0} parameter(0)
  p.935 = f64[2,20]{1,0} parameter(1)
  p.936 = f64[2,20]{1,0} parameter(2)
  p.937 = f64[2,20]{1,0} parameter(3)
  p.938 = f64[] parameter(4)
  p.939 = f64[2,20]{1,0} parameter(5)
  loop_broadcast_fusion.2 = f64[20,1]{1,0} fusion(), kind=kLoop, calls=fused_broadcast.2
  loop_broadcast_fusion.1 = f64[20]{0} fusion(), kind=kLoop, calls=fused_broadcast.1
  loop_broadcast_fusion = f64[2,20]{1,0} fusion(), kind=kLoop, calls=fused_broadcast
  wrapped_copy.177 = f64[2,20]{1,0} fusion(loop_broadcast_fusion), kind=kLoop, calls=wrapped_copy_computation.177
  loop_multiply_negate_fusion = (f64[2,20]{1,0}, f64[2,20]{1,0}, f64[2,20]{1,0}) fusion(p.934, p.935, p.936, p.937, p.938, /*index=5*/p.939), kind=kLoop, calls=fused_multiply_negate, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  ROOT tuple.779 = (f64[20,1]{1,0}, f64[20]{0}, f64[2,20]{1,0}, f64[2,20]{1,0}, (f64[2,20]{1,0}, f64[2,20]{1,0}, f64[2,20]{1,0})) tuple(loop_broadcast_fusion.2, loop_broadcast_fusion.1, loop_broadcast_fusion, wrapped_copy.177, loop_multiply_negate_fusion)
} // command_buffer.22

region_29.5206.clone {
  arg_tuple.6.0 = (f64[2,20]{1,0}, f64[], f64[2,20]{1,0}, f64[2,20]{1,0}, f64[2,20]{1,0}, /*index=5*/f64[2,20]{1,0}) parameter(0)
  get-tuple-element.2425.0 = f64[] get-tuple-element(arg_tuple.6.0), index=1
  get-tuple-element.2429.0 = f64[2,20]{1,0} get-tuple-element(arg_tuple.6.0), index=5
  get-tuple-element.2428.0 = f64[2,20]{1,0} get-tuple-element(arg_tuple.6.0), index=4
  get-tuple-element.2427.0 = f64[2,20]{1,0} get-tuple-element(arg_tuple.6.0), index=3
  get-tuple-element.2426.0 = f64[2,20]{1,0} get-tuple-element(arg_tuple.6.0), index=2
  get-tuple-element.2424.0 = f64[2,20]{1,0} get-tuple-element(arg_tuple.6.0), index=0
  call.12 = (f64[20,1]{1,0}, f64[20]{0}, f64[2,20]{1,0}, f64[2,20]{1,0}, (f64[2,20]{1,0}, f64[2,20]{1,0}, f64[2,20]{1,0})) call(get-tuple-element.2426.0, get-tuple-element.2427.0, get-tuple-element.2429.0, get-tuple-element.2428.0, get-tuple-element.2425.0, /*index=5*/get-tuple-element.2424.0), to_apply=command_buffer.22
  get-tuple-element.18011 = f64[20,1]{1,0} get-tuple-element(call.12), index=0
  get-tuple-element.18012 = f64[20]{0} get-tuple-element(call.12), index=1
  get-tuple-element.18013 = f64[2,20]{1,0} get-tuple-element(call.12), index=2
  get-tuple-element.18014 = f64[2,20]{1,0} get-tuple-element(call.12), index=3
  get-tuple-element.18015 = (f64[2,20]{1,0}, f64[2,20]{1,0}, f64[2,20]{1,0}) get-tuple-element(call.12), index=4
  get-tuple-element.15956 = f64[2,20]{1,0} get-tuple-element(get-tuple-element.18015), index=2, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  get-tuple-element.15957 = f64[2,20]{1,0} get-tuple-element(get-tuple-element.18015), index=1, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  get-tuple-element.15958 = f64[2,20]{1,0} get-tuple-element(get-tuple-element.18015), index=0, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  ROOT tuple.732 = (f64[20]{0}, f64[2,20]{1,0}, f64[2,20]{1,0}, f64[2,20]{1,0}, f64[2,20]{1,0}, /*index=5*/f64[2,20]{1,0}, f64[20,1]{1,0}) tuple(get-tuple-element.18012, get-tuple-element.18013, get-tuple-element.18014, get-tuple-element.15956, get-tuple-element.15957, /*index=5*/get-tuple-element.15958, get-tuple-element.18011)
} // region_29.5206.clone

fused_broadcast.4 {
  constant_1436_3 = f64[] constant(0)
  ROOT broadcast.4023.1 = f64[20,1]{1,0} broadcast(constant_1436_3), dimensions={}
}

fused_broadcast.3 {
  constant_1436_2 = f64[] constant(0)
  ROOT broadcast.4020.1 = f64[20]{0} broadcast(constant_1436_2), dimensions={}
}

fused_broadcast_multiply_select {
  param_0.59 = f64[2,20]{1,0} parameter(0)
  param_2.5643 = pred[2,20]{1,0} parameter(2)
  param_3.4115 = f64[2,20]{1,0} parameter(3)
  constant_1436_1_clone_1 = f64[] constant(0)
  broadcast.4021.clone.2.1.clone.1 = f64[2,20]{1,0} broadcast(constant_1436_1_clone_1), dimensions={}, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_1_fun/jit(precision_update)/jit(_where)/broadcast_in_dim[shape=(2, 20) broadcast_dimensions=(np.int64(1),)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  select.2972.1 = f64[2,20]{1,0} select(param_2.5643, param_3.4115, broadcast.4021.clone.2.1.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_1_fun/jit(precision_update)/jit(_where)/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  param_1.7155 = f64[] parameter(1)
  broadcast.4022.1 = f64[2,20]{1,0} broadcast(param_1.7155), dimensions={}, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_1_fun/jit(precision_update)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  multiply.2894.1 = f64[2,20]{1,0} multiply(select.2972.1, broadcast.4022.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_1_fun/jit(precision_update)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  multiply.2895.1 = f64[2,20]{1,0} multiply(param_0.59, multiply.2894.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_1_fun/jit(precision_update)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  ROOT tuple.483 = (f64[2,20]{1,0}, f64[2,20]{1,0}, f64[2,20]{1,0}) tuple(multiply.2895.1, select.2972.1, broadcast.4021.clone.2.1.clone.1)
} // fused_broadcast_multiply_select

wrapped_copy_computation.178 {
  param_0.5383 = f64[2,20]{1,0} parameter(0)
  ROOT copy.1367 = f64[2,20]{1,0} copy(param_0.5383)
}

wrapped_copy_computation.179 {
  param_0.5384 = f64[2,20]{1,0} parameter(0)
  ROOT copy.1368 = f64[2,20]{1,0} copy(param_0.5384)
}

command_buffer.20 {
  p.926 = f64[2,20]{1,0} parameter(0)
  p.927 = f64[] parameter(1)
  p.928 = pred[2,20]{1,0} parameter(2)
  p.929 = f64[2,20]{1,0} parameter(3)
  loop_broadcast_fusion.4 = f64[20,1]{1,0} fusion(), kind=kLoop, calls=fused_broadcast.4
  loop_broadcast_fusion.3 = f64[20]{0} fusion(), kind=kLoop, calls=fused_broadcast.3
  loop_broadcast_multiply_select_fusion = (f64[2,20]{1,0}, f64[2,20]{1,0}, f64[2,20]{1,0}) fusion(p.926, p.927, p.928, p.929), kind=kLoop, calls=fused_broadcast_multiply_select, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_1_fun/jit(precision_update)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  get-tuple-element.15965 = f64[2,20]{1,0} get-tuple-element(loop_broadcast_multiply_select_fusion), index=2, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_1_fun/jit(precision_update)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  get-tuple-element.15962 = f64[2,20]{1,0} get-tuple-element(loop_broadcast_multiply_select_fusion), index=1, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_1_fun/jit(precision_update)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  get-tuple-element.15961 = f64[2,20]{1,0} get-tuple-element(loop_broadcast_multiply_select_fusion), index=0, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_1_fun/jit(precision_update)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  wrapped_copy.178 = f64[2,20]{1,0} fusion(get-tuple-element.15965), kind=kLoop, calls=wrapped_copy_computation.178
  wrapped_copy.179 = f64[2,20]{1,0} fusion(get-tuple-element.15965), kind=kLoop, calls=wrapped_copy_computation.179
  ROOT tuple.777 = (f64[20,1]{1,0}, f64[20]{0}, f64[2,20]{1,0}, f64[2,20]{1,0}, f64[2,20]{1,0}, /*index=5*/f64[2,20]{1,0}, f64[2,20]{1,0}) tuple(loop_broadcast_fusion.4, loop_broadcast_fusion.3, get-tuple-element.15965, get-tuple-element.15962, get-tuple-element.15961, /*index=5*/wrapped_copy.178, wrapped_copy.179)
} // command_buffer.20

region_30.5243.clone.clone {
  arg_tuple.8.0 = (f64[2,20]{1,0}, f64[], pred[2,20]{1,0}, f64[2,20]{1,0}) parameter(0)
  get-tuple-element.2449.0 = f64[] get-tuple-element(arg_tuple.8.0), index=1
  get-tuple-element.2451.0 = f64[2,20]{1,0} get-tuple-element(arg_tuple.8.0), index=3
  get-tuple-element.2450.0 = pred[2,20]{1,0} get-tuple-element(arg_tuple.8.0), index=2
  get-tuple-element.2448.0 = f64[2,20]{1,0} get-tuple-element(arg_tuple.8.0), index=0
  call.11 = (f64[20,1]{1,0}, f64[20]{0}, f64[2,20]{1,0}, f64[2,20]{1,0}, f64[2,20]{1,0}, /*index=5*/f64[2,20]{1,0}, f64[2,20]{1,0}) call(get-tuple-element.2448.0, get-tuple-element.2449.0, get-tuple-element.2450.0, get-tuple-element.2451.0), to_apply=command_buffer.20
  get-tuple-element.18004 = f64[20,1]{1,0} get-tuple-element(call.11), index=0
  get-tuple-element.18005 = f64[20]{0} get-tuple-element(call.11), index=1
  get-tuple-element.18006 = f64[2,20]{1,0} get-tuple-element(call.11), index=2
  get-tuple-element.18007 = f64[2,20]{1,0} get-tuple-element(call.11), index=3
  get-tuple-element.18008 = f64[2,20]{1,0} get-tuple-element(call.11), index=4
  get-tuple-element.18009 = f64[2,20]{1,0} get-tuple-element(call.11), index=5
  get-tuple-element.18010 = f64[2,20]{1,0} get-tuple-element(call.11), index=6
  ROOT tuple.733 = (f64[20]{0}, f64[2,20]{1,0}, f64[2,20]{1,0}, f64[2,20]{1,0}, f64[2,20]{1,0}, /*index=5*/f64[2,20]{1,0}, f64[20,1]{1,0}) tuple(get-tuple-element.18005, get-tuple-element.18008, get-tuple-element.18007, get-tuple-element.18006, get-tuple-element.18009, /*index=5*/get-tuple-element.18010, get-tuple-element.18004)
} // region_30.5243.clone.clone

fused_add_select {
  param_12.170 = pred[192,2,20]{2,1,0} parameter(12)
  constant_1987_17 = s64[] constant(191)
  param_21.127 = s64[] parameter(21)
  subtract.220.33 = s64[] subtract(constant_1987_17, param_21.127), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/sub" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  constant_1980_8 = s64[] constant(0)
  compare.1131.33 = pred[] compare(subtract.220.33, constant_1980_8), direction=LT, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/lt" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  constant_1988_17 = s64[] constant(383)
  subtract.221.33 = s64[] subtract(constant_1988_17, param_21.127), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  select.2973.33 = s64[] select(compare.1131.33, subtract.221.33, subtract.220.33), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  dynamic-slice.1237.1 = pred[1,2,20]{2,1,0} dynamic-slice(param_12.170, select.2973.33, constant_1980_8, constant_1980_8), dynamic_slice_sizes={1,2,20}, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/dynamic_slice[slice_sizes=(1, 2, 20)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  bitcast.10661.168 = pred[2,20]{1,0} bitcast(dynamic-slice.1237.1)
  param_1.843 = f64[2,20]{1,0} parameter(1)
  constant_1982_22 = f64[] constant(0)
  broadcast.4024.clone.108 = f64[2,20]{1,0} broadcast(constant_1982_22), dimensions={}
  select.3020.3 = f64[2,20]{1,0} select(bitcast.10661.168, param_1.843, broadcast.4024.clone.108), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(_where)/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=370}
  select.3021.3 = f64[2,20]{1,0} select(bitcast.10661.168, broadcast.4024.clone.108, param_1.843), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(_where)/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=370}
  add.4036.1 = f64[2,20]{1,0} add(select.3020.3, select.3021.3), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/add_any" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=370}
  param_7.330 = pred[192,2,20]{2,1,0} parameter(7)
  dynamic-slice.1276.6 = pred[1,2,20]{2,1,0} dynamic-slice(param_7.330, select.2973.33, constant_1980_8, constant_1980_8), dynamic_slice_sizes={1,2,20}, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/dynamic_slice[slice_sizes=(1, 2, 20)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  bitcast.11553.6 = pred[2,20]{1,0} bitcast(dynamic-slice.1276.6)
  param_6.395 = f64[192,2,20]{2,1,0} parameter(6)
  dynamic-slice.1283.3 = f64[1,2,20]{2,1,0} dynamic-slice(param_6.395, select.2973.33, constant_1980_8, constant_1980_8), dynamic_slice_sizes={1,2,20}, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/dynamic_slice[slice_sizes=(1, 2, 20)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  bitcast.11751.7 = f64[2,20]{1,0} bitcast(dynamic-slice.1283.3)
  param_5.419 = s32[192,2,20]{2,1,0} parameter(5)
  dynamic-slice.1246.14 = s32[1,2,20]{2,1,0} dynamic-slice(param_5.419, select.2973.33, constant_1980_8, constant_1980_8), dynamic_slice_sizes={1,2,20}, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/dynamic_slice[slice_sizes=(1, 2, 20)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  constant_1985_1 = s32[] constant(0)
  broadcast.4029.9 = s32[1,2,20]{2,1,0} broadcast(constant_1985_1), dimensions={}, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update_ehgf)/jit(posterior_update_precision_continuous_node)/eq" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  compare.1133.9 = pred[1,2,20]{2,1,0} compare(dynamic-slice.1246.14, broadcast.4029.9), direction=EQ, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update_ehgf)/jit(posterior_update_precision_continuous_node)/eq" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  bitcast.11560.13 = pred[2,20]{1,0} bitcast(compare.1133.9)
  param_4.480 = f64[2,20]{1,0} parameter(4)
  select.2983.21 = f64[2,20]{1,0} select(bitcast.10661.168, param_4.480, broadcast.4024.clone.108), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(_where)/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  select.3012.13 = f64[2,20]{1,0} select(bitcast.11560.13, select.2983.21, broadcast.4024.clone.108), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update_ehgf)/jit(posterior_update_precision_continuous_node)/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  param_3.545 = f64[192,2,20]{2,1,0} parameter(3)
  dynamic-slice.1277.9 = f64[1,2,20]{2,1,0} dynamic-slice(param_3.545, select.2973.33, constant_1980_8, constant_1980_8), dynamic_slice_sizes={1,2,20}, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/dynamic_slice[slice_sizes=(1, 2, 20)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  bitcast.11574.11 = f64[2,20]{1,0} bitcast(dynamic-slice.1277.9)
  multiply.2939.11 = f64[2,20]{1,0} multiply(select.3012.13, bitcast.11574.11), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update_ehgf)/jit(posterior_update_precision_continuous_node)/jit(precision_update_missing_values)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  negate.478.9 = f64[2,20]{1,0} negate(multiply.2939.11), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update_ehgf)/jit(posterior_update_precision_continuous_node)/jit(precision_update_missing_values)/neg" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  multiply.2948.7 = f64[2,20]{1,0} multiply(bitcast.11751.7, negate.478.9), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update_ehgf)/jit(posterior_update_precision_continuous_node)/jit(precision_update_missing_values)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  param_2.768 = f64[192,2,20]{2,1,0} parameter(2)
  dynamic-slice.1284.4 = f64[1,2,20]{2,1,0} dynamic-slice(param_2.768, select.2973.33, constant_1980_8, constant_1980_8), dynamic_slice_sizes={1,2,20}, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/dynamic_slice[slice_sizes=(1, 2, 20)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  bitcast.11763.6 = f64[2,20]{1,0} bitcast(dynamic-slice.1284.4)
  multiply.2949.5 = f64[2,20]{1,0} multiply(multiply.2948.7, bitcast.11763.6), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update_ehgf)/jit(posterior_update_precision_continuous_node)/jit(precision_update_missing_values)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  select.3022.3 = f64[2,20]{1,0} select(bitcast.11553.6, multiply.2949.5, broadcast.4024.clone.108), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update_ehgf)/jit(posterior_update_precision_continuous_node)/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  param_0.653 = f64[20]{0} parameter(0)
  broadcast.4026.19 = f64[2,20]{1,0} broadcast(param_0.653), dimensions={1}, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/broadcast_in_dim[shape=(2, 20) broadcast_dimensions=(np.int64(1),)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  add.4037.5 = f64[2,20]{1,0} add(select.3022.3, broadcast.4026.19), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/add_any" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  param_11.180 = pred[192,2,20]{2,1,0} parameter(11)
  dynamic-slice.1285.3 = pred[1,2,20]{2,1,0} dynamic-slice(param_11.180, select.2973.33, constant_1980_8, constant_1980_8), dynamic_slice_sizes={1,2,20}, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/dynamic_slice[slice_sizes=(1, 2, 20)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  bitcast.11779.5 = pred[2,20]{1,0} bitcast(dynamic-slice.1285.3)
  param_20.131 = f64[2,20]{1,0} parameter(20)
  select.3014.7 = f64[2,20]{1,0} select(bitcast.10661.168, param_20.131, broadcast.4024.clone.108), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(_where)/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  param_19.134 = pred[192,2,20]{2,1,0} parameter(19)
  dynamic-slice.1243.17 = pred[1,2,20]{2,1,0} dynamic-slice(param_19.134, select.2973.33, constant_1980_8, constant_1980_8), dynamic_slice_sizes={1,2,20}, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/dynamic_slice[slice_sizes=(1, 2, 20)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  bitcast.10789.21 = pred[2,20]{1,0} bitcast(dynamic-slice.1243.17)
  param_18.137 = pred[192,2,20]{2,1,0} parameter(18)
