HloModule jit_scan, is_scheduled=true, entry_computation_layout={(s32[20,192]{1,0}, f64[1]{0}, f64[1]{0}, f64[1]{0}, f32[20,192]{1,0}, /*index=5*/f32[20,192]{1,0}, s32[20,192]{1,0}, pred[20,192]{1,0}, f64[20]{0}, f64[20]{0}, /*index=10*/f64[20]{0}, f64[20]{0}, f64[20]{0}, f64[20]{0}, f64[], /*index=15*/f64[20]{0}, f64[20]{0}, f64[20]{0}, f64[20]{0}, f64[20]{0}, /*index=20*/f64[20]{0}, f64[], f64[], s64[], f64[], /*index=25*/f64[], f64[120]{0}, f64[120]{0}, f64[120]{0}, s64[], /*index=30*/f64[], f64[120]{0}, u32[10,2]{1,0}, s64[10,2]{1,0})->(f64[20]{0}, f64[20]{0}, f64[20]{0}, f64[20]{0}, f64[20]{0}, /*index=5*/f64[20]{0}, f64[], f64[20]{0}, f64[20]{0}, f64[20]{0}, /*index=10*/f64[20]{0}, f64[20]{0}, f64[20]{0}, f64[], f64[], /*index=15*/s64[], f64[], f64[], f64[120]{0}, f64[120]{0}, /*index=20*/f64[120]{0}, s64[], f64[], f64[120]{0}, f64[10,20]{1,0}, /*index=25*/f64[10,20]{1,0}, f64[10,20]{1,0}, f64[10,20]{1,0}, f64[10,20]{1,0}, f64[10,20]{1,0}, /*index=30*/f64[10]{0}, f64[10,20]{1,0}, f64[10,20]{1,0}, f64[10,20]{1,0}, f64[10,20]{1,0}, /*index=35*/f64[10,20]{1,0}, f64[10,20]{1,0}, f64[10,20]{1,0}, f64[10,20]{1,0}, f64[10,20]{1,0}, /*index=40*/f64[10,20]{1,0}, f64[10,20]{1,0}, f64[10,20]{1,0}, pred[10]{0}, pred[10]{0}, /*index=45*/f64[10]{0}, f64[10,20]{1,0}, f64[10,20]{1,0}, f64[10,20]{1,0}, f64[10,20]{1,0}, /*index=50*/f64[10,20]{1,0}, f64[10,20]{1,0}, f64[10,20]{1,0}, f64[10,20]{1,0}, f64[10,20]{1,0}, /*index=55*/f64[10,20]{1,0}, f64[10,20]{1,0}, f64[10,20]{1,0}, f64[10]{0}, f64[10,20]{1,0}, /*index=60*/f64[10,20]{1,0}, f64[10,20]{1,0}, f64[10,20]{1,0}, f64[10,20]{1,0}, f64[10,20]{1,0}, /*index=65*/f64[10,20]{1,0}, f64[10,20]{1,0}, f64[10,20]{1,0}, f64[10,20]{1,0}, f64[10,20]{1,0}, /*index=70*/f64[10,20]{1,0}, f64[10,20]{1,0}, f64[10,20]{1,0}, f64[10,20]{1,0}, f64[10,20]{1,0}, /*index=75*/f64[10,20]{1,0}, f64[10,20]{1,0}, f64[10]{0}, f64[10,20]{1,0}, f64[10,20]{1,0}, /*index=80*/f64[10,20]{1,0}, f64[10,20]{1,0}, f64[10,20]{1,0}, f64[10,20]{1,0}, s64[10]{0}, /*index=85*/s64[10]{0}, f64[10]{0}, f64[10]{0}, f64[10]{0}, s64[10]{0}, /*index=90*/f64[10]{0}, f64[10]{0}, f64[10,120]{1,0}, f64[10,120]{1,0}, f64[10,120]{1,0}, /*index=95*/s64[10]{0}, f64[10]{0}, f64[10,120]{1,0})}, allow_spmd_sharding_propagation_to_parameters={true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true}, allow_spmd_sharding_propagation_to_output={true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true}, frontend_attributes={fingerprint_before_lhs="30a0810e85029b6361a989cf65404dff"}

fused_add {
  param_2.12 = s64[] parameter(2)
  convert.165.1 = f64[] convert(param_2.12), metadata={op_name="jit(scan)/jit(main)/while/body/cond/branch_0_fun/convert_element_type[new_dtype=float64 weak_type=True sharding=None]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1011}
  constant_9010_1 = f64[] constant(-0.75)
  power.2.1 = f64[] power(convert.165.1, constant_9010_1), metadata={op_name="jit(scan)/jit(main)/while/body/cond/branch_0_fun/pow" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1011}
  param_1.13 = f64[] parameter(1)
  multiply.2774.1 = f64[] multiply(power.2.1, param_1.13), metadata={op_name="jit(scan)/jit(main)/while/body/cond/branch_0_fun/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1011}
  constant_9009_2 = f64[] constant(1)
  subtract.211.1 = f64[] subtract(constant_9009_2, power.2.1), metadata={op_name="jit(scan)/jit(main)/while/body/cond/branch_0_fun/sub" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1011}
  param_0.1 = f64[] parameter(0)
  multiply.2775.1 = f64[] multiply(subtract.211.1, param_0.1), metadata={op_name="jit(scan)/jit(main)/while/body/cond/branch_0_fun/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1011}
  ROOT add.3607.1 = f64[] add(multiply.2774.1, multiply.2775.1), metadata={op_name="jit(scan)/jit(main)/while/body/cond/branch_0_fun/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1011}
} // fused_add

fused_add.1 {
  param_0.6 = s64[] parameter(0)
  constant_9007_1 = s64[] constant(1)
  ROOT add.3608.1 = s64[] add(param_0.6, constant_9007_1), metadata={op_name="jit(scan)/jit(main)/while/body/cond/branch_0_fun/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1011}
}

fused_add_exponential_subtract {
  param_0.3230 = f64[] parameter(0)
  param_1.4627 = s64[] parameter(1)
  convert.165.2.clone.1 = f64[] convert(param_1.4627), metadata={op_name="jit(scan)/jit(main)/while/body/cond/branch_0_fun/convert_element_type[new_dtype=float64 weak_type=True sharding=None]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1011}
  sqrt.8.1.clone.1 = f64[] sqrt(convert.165.2.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/cond/branch_0_fun/sqrt" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1011}
  constant_993_1_clone_1 = f64[] constant(20)
  multiply.2771.1.clone.1 = f64[] multiply(sqrt.8.1.clone.1, constant_993_1_clone_1), metadata={op_name="jit(scan)/jit(main)/while/body/cond/branch_0_fun/div" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1011}
  constant_9009_1_clone_1 = f64[] constant(1)
  constant_9011_1_clone_1 = s64[] constant(10)
  add.3605.1.clone.1 = s64[] add(param_1.4627, constant_9011_1_clone_1), metadata={op_name="jit(scan)/jit(main)/while/body/cond/branch_0_fun/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1011}
  convert.166.1.clone.1 = f64[] convert(add.3605.1.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/cond/branch_0_fun/convert_element_type[new_dtype=float64 weak_type=True sharding=None]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1011}
  divide.563.1.clone.1 = f64[] divide(constant_9009_1_clone_1, convert.166.1.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/cond/branch_0_fun/div" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1011}
  subtract.208.1.clone.1 = f64[] subtract(constant_9009_1_clone_1, divide.563.1.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/cond/branch_0_fun/sub" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1011}
  param_3.2897 = f64[] parameter(3)
  multiply.2772.1.clone.1 = f64[] multiply(subtract.208.1.clone.1, param_3.2897), metadata={op_name="jit(scan)/jit(main)/while/body/cond/branch_0_fun/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1011}
  constant_9012_1_clone_1 = f64[] constant(0.9)
  param_2.3613 = f64[] parameter(2)
  subtract.209.1.clone.1 = f64[] subtract(constant_9012_1_clone_1, param_2.3613), metadata={op_name="jit(scan)/jit(main)/while/body/cond/branch_0_fun/sub" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1011}
  divide.564.1.clone.1 = f64[] divide(subtract.209.1.clone.1, convert.166.1.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/cond/branch_0_fun/div" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1011}
  add.3606.1.clone.1 = f64[] add(multiply.2772.1.clone.1, divide.564.1.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/cond/branch_0_fun/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1011}
  multiply.2773.1.clone.1 = f64[] multiply(multiply.2771.1.clone.1, add.3606.1.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/cond/branch_0_fun/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1011}
  subtract.210.1.clone.1 = f64[] subtract(param_0.3230, multiply.2773.1.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/cond/branch_0_fun/sub" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1011}
  exponential.100.1 = f64[] exponential(subtract.210.1.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/cond/branch_0_fun/exp" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1011}
  ROOT tuple.501 = (f64[], f64[], f64[]) tuple(exponential.100.1, subtract.210.1.clone.1, add.3606.1.clone.1)
} // fused_add_exponential_subtract

region_55.8994 {
  arg_tuple.8995.0 = (f64[], s64[], f64[], f64[], f64[], /*index=5*/f64[], f64[120]{0}, f64[120]{0}, f64[120]{0}, s64[], /*index=10*/f64[120]{0}) parameter(0)
  get-tuple-element.18112 = s64[] get-tuple-element(arg_tuple.8995.0), index=9
  get-tuple-element.9001.0 = f64[] get-tuple-element(arg_tuple.8995.0), index=5
  get-tuple-element.9000.0 = f64[] get-tuple-element(arg_tuple.8995.0), index=4
  get-tuple-element.8996.0 = f64[] get-tuple-element(arg_tuple.8995.0), index=0
  get-tuple-element.8998.0 = f64[] get-tuple-element(arg_tuple.8995.0), index=2
  get-tuple-element.8997.0 = s64[] get-tuple-element(arg_tuple.8995.0), index=1
  loop_add_fusion.1 = s64[] fusion(get-tuple-element.8997.0), kind=kLoop, calls=fused_add.1, metadata={op_name="jit(scan)/jit(main)/while/body/cond/branch_0_fun/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1011 deduplicated_name="loop_add_fusion.1"}
  loop_add_fusion = f64[] fusion(get-tuple-element.9001.0, get-tuple-element.9000.0, get-tuple-element.8997.0), kind=kLoop, calls=fused_add, metadata={op_name="jit(scan)/jit(main)/while/body/cond/branch_0_fun/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1011 deduplicated_name="loop_add_fusion"}
  get-tuple-element.18108 = f64[] get-tuple-element(arg_tuple.8995.0), index=3
  get-tuple-element.18114 = f64[120]{0} get-tuple-element(arg_tuple.8995.0), index=10
  get-tuple-element.18111 = f64[120]{0} get-tuple-element(arg_tuple.8995.0), index=8
  get-tuple-element.18110 = f64[120]{0} get-tuple-element(arg_tuple.8995.0), index=7
  get-tuple-element.18109 = f64[120]{0} get-tuple-element(arg_tuple.8995.0), index=6
  loop_add_exponential_subtract_fusion = (f64[], f64[], f64[]) fusion(get-tuple-element.18108, get-tuple-element.8997.0, get-tuple-element.8996.0, get-tuple-element.8998.0), kind=kLoop, calls=fused_add_exponential_subtract, metadata={op_name="jit(scan)/jit(main)/while/body/cond/branch_0_fun/exp" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1011 deduplicated_name="loop_add_exponential_subtract_fusion"}
  get-tuple-element.18107 = f64[] get-tuple-element(loop_add_exponential_subtract_fusion), index=2, metadata={op_name="jit(scan)/jit(main)/while/body/cond/branch_0_fun/exp" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1011}
  get-tuple-element.18104 = f64[] get-tuple-element(loop_add_exponential_subtract_fusion), index=1, metadata={op_name="jit(scan)/jit(main)/while/body/cond/branch_0_fun/exp" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1011}
  get-tuple-element.18113 = f64[] get-tuple-element(loop_add_exponential_subtract_fusion), index=0, metadata={op_name="jit(scan)/jit(main)/while/body/cond/branch_0_fun/exp" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1011}
  ROOT tuple.618 = (f64[], f64[], s64[], f64[], f64[], /*index=5*/f64[120]{0}, f64[120]{0}, f64[120]{0}, s64[], f64[], /*index=10*/f64[120]{0}) tuple(get-tuple-element.18104, loop_add_fusion, loop_add_fusion.1, get-tuple-element.18107, get-tuple-element.18108, /*index=5*/get-tuple-element.18109, get-tuple-element.18110, get-tuple-element.18111, get-tuple-element.18112, get-tuple-element.18113, /*index=10*/get-tuple-element.18114)
} // region_55.8994

fused_add.3 {
  param_0.26 = s64[] parameter(0)
  constant_9060_1 = s64[] constant(1)
  ROOT add.3613.1 = s64[] add(param_0.26, constant_9060_1), metadata={op_name="jit(scan)/jit(main)/while/body/cond/branch_1_fun/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1011}
}

fused_add.4 {
  param_0.27 = s64[] parameter(0)
  constant_9060_2 = s64[] constant(1)
  ROOT add.3612.1 = s64[] add(param_0.27, constant_9060_2), metadata={op_name="jit(scan)/jit(main)/while/body/cond/branch_1_fun/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1011}
}

fused_add.2 {
  param_2.41 = s64[] parameter(2)
  convert.167.1 = f64[] convert(param_2.41), metadata={op_name="jit(scan)/jit(main)/while/body/cond/branch_1_fun/convert_element_type[new_dtype=float64 weak_type=True sharding=None]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1011}
  constant_9057_1 = f64[] constant(-0.75)
  power.3.1 = f64[] power(convert.167.1, constant_9057_1), metadata={op_name="jit(scan)/jit(main)/while/body/cond/branch_1_fun/pow" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1011}
  param_1.43 = f64[] parameter(1)
  multiply.2779.1 = f64[] multiply(power.3.1, param_1.43), metadata={op_name="jit(scan)/jit(main)/while/body/cond/branch_1_fun/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1011}
  constant_9056_2 = f64[] constant(1)
  subtract.215.1 = f64[] subtract(constant_9056_2, power.3.1), metadata={op_name="jit(scan)/jit(main)/while/body/cond/branch_1_fun/sub" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1011}
  param_0.18 = f64[] parameter(0)
  multiply.2780.1 = f64[] multiply(subtract.215.1, param_0.18), metadata={op_name="jit(scan)/jit(main)/while/body/cond/branch_1_fun/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1011}
  ROOT add.3611.1 = f64[] add(multiply.2779.1, multiply.2780.1), metadata={op_name="jit(scan)/jit(main)/while/body/cond/branch_1_fun/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1011}
} // fused_add.2

fused_add_exponential_subtract.1 {
  param_0.3232 = f64[] parameter(0)
  param_1.4632 = s64[] parameter(1)
  convert.167.2.clone.1 = f64[] convert(param_1.4632), metadata={op_name="jit(scan)/jit(main)/while/body/cond/branch_1_fun/convert_element_type[new_dtype=float64 weak_type=True sharding=None]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1011}
  sqrt.9.1.clone.1 = f64[] sqrt(convert.167.2.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/cond/branch_1_fun/sqrt" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1011}
  constant_994_1_clone_1 = f64[] constant(20)
  multiply.2776.1.clone.1 = f64[] multiply(sqrt.9.1.clone.1, constant_994_1_clone_1), metadata={op_name="jit(scan)/jit(main)/while/body/cond/branch_1_fun/div" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1011}
  constant_9056_1_clone_1 = f64[] constant(1)
  constant_9058_1_clone_1 = s64[] constant(10)
  add.3609.1.clone.1 = s64[] add(param_1.4632, constant_9058_1_clone_1), metadata={op_name="jit(scan)/jit(main)/while/body/cond/branch_1_fun/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1011}
  convert.168.1.clone.1 = f64[] convert(add.3609.1.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/cond/branch_1_fun/convert_element_type[new_dtype=float64 weak_type=True sharding=None]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1011}
  divide.565.1.clone.1 = f64[] divide(constant_9056_1_clone_1, convert.168.1.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/cond/branch_1_fun/div" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1011}
  subtract.212.1.clone.1 = f64[] subtract(constant_9056_1_clone_1, divide.565.1.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/cond/branch_1_fun/sub" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1011}
  param_3.2904 = f64[] parameter(3)
  multiply.2777.1.clone.1 = f64[] multiply(subtract.212.1.clone.1, param_3.2904), metadata={op_name="jit(scan)/jit(main)/while/body/cond/branch_1_fun/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1011}
  constant_9059_1_clone_1 = f64[] constant(0.9)
  param_2.3621 = f64[] parameter(2)
  subtract.213.1.clone.1 = f64[] subtract(constant_9059_1_clone_1, param_2.3621), metadata={op_name="jit(scan)/jit(main)/while/body/cond/branch_1_fun/sub" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1011}
  divide.566.1.clone.1 = f64[] divide(subtract.213.1.clone.1, convert.168.1.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/cond/branch_1_fun/div" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1011}
  add.3610.1.clone.1 = f64[] add(multiply.2777.1.clone.1, divide.566.1.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/cond/branch_1_fun/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1011}
  multiply.2778.1.clone.1 = f64[] multiply(multiply.2776.1.clone.1, add.3610.1.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/cond/branch_1_fun/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1011}
  subtract.214.1.clone.1 = f64[] subtract(param_0.3232, multiply.2778.1.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/cond/branch_1_fun/sub" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1011}
  exponential.101.1 = f64[] exponential(subtract.214.1.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/cond/branch_1_fun/exp" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1011}
  ROOT tuple.504 = (f64[], f64[], f64[]) tuple(exponential.101.1, subtract.214.1.clone.1, add.3610.1.clone.1)
} // fused_add_exponential_subtract.1

fused_concatenate {
  param_0.13 = f64[120]{0} parameter(0)
  param_1.4628 = f64[20]{0} parameter(1)
  param_2.3614 = f64[20]{0} parameter(2)
  param_3.2898 = f64[20]{0} parameter(3)
  param_4.2160 = f64[20]{0} parameter(4)
  param_5.1803 = f64[20]{0} parameter(5)
  param_6.1447 = f64[20]{0} parameter(6)
  concatenate.36.6 = f64[120]{0} concatenate(param_1.4628, param_2.3614, param_3.2898, param_4.2160, param_5.1803, /*index=5*/param_6.1447), dimensions={0}, metadata={op_name="jit(scan)/jit(main)/while/body/cond/branch_1_fun/concatenate[dimension=0]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1011}
  param_7.1215 = f64[120]{0} parameter(7)
  subtract.216.3 = f64[120]{0} subtract(concatenate.36.6, param_7.1215), metadata={op_name="jit(scan)/jit(main)/while/body/cond/branch_1_fun/sub" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1011}
  param_8.1137 = s64[] parameter(8)
  convert.169.1.clone.1 = f64[] convert(param_8.1137), metadata={op_name="jit(scan)/jit(main)/while/body/cond/branch_1_fun/convert_element_type[new_dtype=float64 weak_type=False sharding=None]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1011}
  broadcast.1874.3.clone.1 = f64[120]{0} broadcast(convert.169.1.clone.1), dimensions={}, metadata={op_name="jit(scan)/jit(main)/while/body/cond/branch_1_fun/div" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1011}
  divide.567.3.clone.1 = f64[120]{0} divide(subtract.216.3, broadcast.1874.3.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/cond/branch_1_fun/div" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1011}
  add.3614.1.clone.1 = f64[120]{0} add(param_7.1215, divide.567.3.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/cond/branch_1_fun/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1011}
  subtract.217.3 = f64[120]{0} subtract(concatenate.36.6, add.3614.1.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/cond/branch_1_fun/sub" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1011}
  multiply.2781.1 = f64[120]{0} multiply(subtract.216.3, subtract.217.3), metadata={op_name="jit(scan)/jit(main)/while/body/cond/branch_1_fun/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1011}
  add.3615.1 = f64[120]{0} add(param_0.13, multiply.2781.1), metadata={op_name="jit(scan)/jit(main)/while/body/cond/branch_1_fun/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1011}
  ROOT tuple.502 = (f64[120]{0}, f64[120]{0}) tuple(add.3615.1, add.3614.1.clone.1)
} // fused_concatenate

command_buffer.58 {
  p.622 = s64[] parameter(0)
  p.623 = (f64[20]{0}, f64[20]{0}, f64[20]{0}, f64[20]{0}, f64[20]{0}, /*index=5*/f64[20]{0}, s64[], f64[120]{0}, f64[120]{0}, f64[], /*index=10*/s64[], f64[], f64[], f64[], f64[], /*index=15*/f64[120]{0}, f64[120]{0}) parameter(1)
  loop_add_fusion.3 = s64[] fusion(p.622), kind=kLoop, calls=fused_add.3, metadata={op_name="jit(scan)/jit(main)/while/body/cond/branch_1_fun/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1011 deduplicated_name="loop_add_fusion.1"}
  get-tuple-element.9052.0 = f64[] get-tuple-element(p.623), index=14
  get-tuple-element.9051.0 = f64[] get-tuple-element(p.623), index=13
  get-tuple-element.9047.0 = f64[] get-tuple-element(p.623), index=9
  get-tuple-element.9049.0 = f64[] get-tuple-element(p.623), index=11
  get-tuple-element.9048.0 = s64[] get-tuple-element(p.623), index=10
  loop_add_fusion.4 = s64[] fusion(get-tuple-element.9048.0), kind=kLoop, calls=fused_add.4, metadata={op_name="jit(scan)/jit(main)/while/body/cond/branch_1_fun/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1011 deduplicated_name="loop_add_fusion.1"}
  loop_add_fusion.2 = f64[] fusion(get-tuple-element.9052.0, get-tuple-element.9051.0, get-tuple-element.9048.0), kind=kLoop, calls=fused_add.2, metadata={op_name="jit(scan)/jit(main)/while/body/cond/branch_1_fun/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1011 deduplicated_name="loop_add_fusion"}
  get-tuple-element.18119 = f64[] get-tuple-element(p.623), index=12
  get-tuple-element.18125 = f64[120]{0} get-tuple-element(p.623), index=16
  get-tuple-element.9046.0 = f64[120]{0} get-tuple-element(p.623), index=8
  get-tuple-element.9043.0 = f64[20]{0} get-tuple-element(p.623), index=5
  get-tuple-element.9042.0 = f64[20]{0} get-tuple-element(p.623), index=4
  get-tuple-element.9041.0 = f64[20]{0} get-tuple-element(p.623), index=3
  get-tuple-element.9040.0 = f64[20]{0} get-tuple-element(p.623), index=2
  get-tuple-element.9039.0 = f64[20]{0} get-tuple-element(p.623), index=1
  get-tuple-element.9038.0 = f64[20]{0} get-tuple-element(p.623), index=0
  get-tuple-element.9045.0 = f64[120]{0} get-tuple-element(p.623), index=7
  get-tuple-element.18120 = f64[120]{0} get-tuple-element(p.623), index=15
  loop_add_exponential_subtract_fusion.1 = (f64[], f64[], f64[]) fusion(get-tuple-element.18119, get-tuple-element.9048.0, get-tuple-element.9047.0, get-tuple-element.9049.0), kind=kLoop, calls=fused_add_exponential_subtract.1, metadata={op_name="jit(scan)/jit(main)/while/body/cond/branch_1_fun/exp" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1011 deduplicated_name="loop_add_exponential_subtract_fusion"}
  get-tuple-element.18118 = f64[] get-tuple-element(loop_add_exponential_subtract_fusion.1), index=2, metadata={op_name="jit(scan)/jit(main)/while/body/cond/branch_1_fun/exp" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1011}
  get-tuple-element.18115 = f64[] get-tuple-element(loop_add_exponential_subtract_fusion.1), index=1, metadata={op_name="jit(scan)/jit(main)/while/body/cond/branch_1_fun/exp" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1011}
  get-tuple-element.18124 = f64[] get-tuple-element(loop_add_exponential_subtract_fusion.1), index=0, metadata={op_name="jit(scan)/jit(main)/while/body/cond/branch_1_fun/exp" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1011}
  loop_concatenate_fusion = (f64[120]{0}, f64[120]{0}) fusion(get-tuple-element.9046.0, get-tuple-element.9038.0, get-tuple-element.9039.0, get-tuple-element.9040.0, get-tuple-element.9041.0, /*index=5*/get-tuple-element.9042.0, get-tuple-element.9043.0, get-tuple-element.9045.0, loop_add_fusion.3), kind=kLoop, calls=fused_concatenate, metadata={op_name="jit(scan)/jit(main)/while/body/cond/branch_1_fun/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1011}
  ROOT tuple.692 = (s64[], s64[], f64[], f64[], f64[120]{0}, /*index=5*/f64[120]{0}, f64[], f64[], f64[], (f64[120]{0}, f64[120]{0})) tuple(loop_add_fusion.3, loop_add_fusion.4, loop_add_fusion.2, get-tuple-element.18119, get-tuple-element.18125, /*index=5*/get-tuple-element.18120, get-tuple-element.18118, get-tuple-element.18115, get-tuple-element.18124, loop_concatenate_fusion)
} // command_buffer.58

region_56.9036 {
  arg_tuple.9037.0 = (f64[20]{0}, f64[20]{0}, f64[20]{0}, f64[20]{0}, f64[20]{0}, /*index=5*/f64[20]{0}, s64[], f64[120]{0}, f64[120]{0}, f64[], /*index=10*/s64[], f64[], f64[], f64[], f64[], /*index=15*/f64[120]{0}, f64[120]{0}) parameter(0)
  get-tuple-element.9044.0 = s64[] get-tuple-element(arg_tuple.9037.0), index=6
  call.32 = (s64[], s64[], f64[], f64[], f64[120]{0}, /*index=5*/f64[120]{0}, f64[], f64[], f64[], (f64[120]{0}, f64[120]{0})) call(get-tuple-element.9044.0, arg_tuple.9037.0), to_apply=command_buffer.58
  get-tuple-element.20963 = s64[] get-tuple-element(call.32), index=0
  get-tuple-element.20964 = s64[] get-tuple-element(call.32), index=1
  get-tuple-element.20965 = f64[] get-tuple-element(call.32), index=2
  get-tuple-element.20966 = f64[] get-tuple-element(call.32), index=3
  get-tuple-element.20967 = f64[120]{0} get-tuple-element(call.32), index=4
  get-tuple-element.20968 = f64[120]{0} get-tuple-element(call.32), index=5
  get-tuple-element.20969 = f64[] get-tuple-element(call.32), index=6
  get-tuple-element.20970 = f64[] get-tuple-element(call.32), index=7
  get-tuple-element.20971 = f64[] get-tuple-element(call.32), index=8
  get-tuple-element.20972 = (f64[120]{0}, f64[120]{0}) get-tuple-element(call.32), index=9
  get-tuple-element.18121 = f64[120]{0} get-tuple-element(get-tuple-element.20972), index=1, metadata={op_name="jit(scan)/jit(main)/while/body/cond/branch_1_fun/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1011}
  get-tuple-element.18122 = f64[120]{0} get-tuple-element(get-tuple-element.20972), index=0, metadata={op_name="jit(scan)/jit(main)/while/body/cond/branch_1_fun/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1011}
  ROOT tuple.619 = (f64[], f64[], s64[], f64[], f64[], /*index=5*/f64[120]{0}, f64[120]{0}, f64[120]{0}, s64[], f64[], /*index=10*/f64[120]{0}) tuple(get-tuple-element.20970, get-tuple-element.20965, get-tuple-element.20964, get-tuple-element.20969, get-tuple-element.20966, /*index=5*/get-tuple-element.20968, get-tuple-element.18121, get-tuple-element.18122, get-tuple-element.20963, get-tuple-element.20971, /*index=10*/get-tuple-element.20967)
} // region_56.9036

wrapped_copy_computation.553 {
  param_0.3919 = f64[] parameter(0)
  ROOT copy.2397 = f64[] copy(param_0.3919)
}

wrapped_copy_computation.554 {
  param_0.3920 = f64[120]{0} parameter(0)
  ROOT copy.2398 = f64[120]{0} copy(param_0.3920)
}

wrapped_copy_computation.555 {
  param_0.3921 = s64[] parameter(0)
  ROOT copy.2399 = s64[] copy(param_0.3921)
}

region_57.9094 {
  arg_tuple.9095.0 = (f64[], f64[], s64[], f64[], f64[], /*index=5*/f64[120]{0}, f64[120]{0}, f64[120]{0}, s64[], f64[], /*index=10*/f64[120]{0}) parameter(0)
  get-tuple-element.18135 = f64[] get-tuple-element(arg_tuple.9095.0), index=9
  get-tuple-element.18134 = s64[] get-tuple-element(arg_tuple.9095.0), index=8
  wrapped_copy.555 = s64[] fusion(get-tuple-element.18134), kind=kLoop, calls=wrapped_copy_computation.555
  get-tuple-element.18130 = f64[] get-tuple-element(arg_tuple.9095.0), index=4
  get-tuple-element.18129 = f64[] get-tuple-element(arg_tuple.9095.0), index=3
  get-tuple-element.18128 = s64[] get-tuple-element(arg_tuple.9095.0), index=2
  get-tuple-element.18127 = f64[] get-tuple-element(arg_tuple.9095.0), index=1
  wrapped_copy.553 = f64[] fusion(get-tuple-element.18127), kind=kLoop, calls=wrapped_copy_computation.553
  get-tuple-element.18126 = f64[] get-tuple-element(arg_tuple.9095.0), index=0
  get-tuple-element.18136 = f64[120]{0} get-tuple-element(arg_tuple.9095.0), index=10
  get-tuple-element.18133 = f64[120]{0} get-tuple-element(arg_tuple.9095.0), index=7
  get-tuple-element.18132 = f64[120]{0} get-tuple-element(arg_tuple.9095.0), index=6
  get-tuple-element.18131 = f64[120]{0} get-tuple-element(arg_tuple.9095.0), index=5
  wrapped_copy.554 = f64[120]{0} fusion(get-tuple-element.18133), kind=kLoop, calls=wrapped_copy_computation.554
  ROOT tuple.620 = (f64[], f64[], s64[], f64[], f64[], /*index=5*/f64[120]{0}, f64[120]{0}, f64[120]{0}, s64[], f64[], /*index=10*/f64[120]{0}) tuple(get-tuple-element.18126, wrapped_copy.553, get-tuple-element.18128, get-tuple-element.18129, get-tuple-element.18130, /*index=5*/get-tuple-element.18131, get-tuple-element.18132, wrapped_copy.554, wrapped_copy.555, get-tuple-element.18135, /*index=10*/get-tuple-element.18136)
} // region_57.9094

wrapped_copy_computation.558 {
  param_0.3924 = s64[] parameter(0)
  ROOT copy.2402 = s64[] copy(param_0.3924)
}

wrapped_copy_computation.557 {
  param_0.3923 = f64[] parameter(0)
  ROOT copy.2401 = f64[] copy(param_0.3923)
}

wrapped_copy_computation.559 {
  param_0.3925 = f64[] parameter(0)
  ROOT copy.2403 = f64[] copy(param_0.3925)
}

wrapped_copy_computation.561 {
  param_0.3927 = s64[] parameter(0)
  ROOT copy.2405 = s64[] copy(param_0.3927)
}

wrapped_copy_computation.556 {
  param_0.3922 = f64[] parameter(0)
  ROOT copy.2400 = f64[] copy(param_0.3922)
}

fused_exponential_log {
  param_0.3233 = f64[] parameter(0)
  exponential.102.1 = f64[] exponential(param_0.3233), metadata={op_name="jit(scan)/jit(main)/while/body/cond/branch_1_fun/exp" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1011}
  constant_9117_1 = f64[] constant(10)
  multiply.2782.1 = f64[] multiply(exponential.102.1, constant_9117_1), metadata={op_name="jit(scan)/jit(main)/while/body/cond/branch_1_fun/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1011}
  log.5.1 = f64[] log(multiply.2782.1), metadata={op_name="jit(scan)/jit(main)/while/body/cond/branch_1_fun/log" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1011}
  ROOT tuple.505 = (f64[], f64[]) tuple(log.5.1, exponential.102.1)
} // fused_exponential_log

fused_add.5 {
  param_1.66 = s64[] parameter(1)
  convert.170.3 = f64[] convert(param_1.66), metadata={op_name="jit(scan)/jit(main)/while/body/cond/branch_1_fun/convert_element_type[new_dtype=float64 weak_type=True sharding=None]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1011}
  constant_9120_1 = s64[] constant(5)
  add.3616.1 = s64[] add(param_1.66, constant_9120_1), metadata={op_name="jit(scan)/jit(main)/while/body/cond/branch_1_fun/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1011}
  convert.171.2 = f64[] convert(add.3616.1), metadata={op_name="jit(scan)/jit(main)/while/body/cond/branch_1_fun/convert_element_type[new_dtype=float64 weak_type=True sharding=None]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1011}
  divide.568.3 = f64[] divide(convert.170.3, convert.171.2), metadata={op_name="jit(scan)/jit(main)/while/body/cond/branch_1_fun/div" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1011}
  broadcast.1875.3 = f64[120]{0} broadcast(divide.568.3), dimensions={}, metadata={op_name="jit(scan)/jit(main)/while/body/cond/branch_1_fun/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1011}
  param_0.43 = f64[120]{0} parameter(0)
  constant_1163_1 = s64[] constant(-1)
  add.3617.1 = s64[] add(param_1.66, constant_1163_1), metadata={op_name="jit(scan)/jit(main)/while/body/cond/branch_1_fun/sub" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1011}
  convert.172.1 = f64[] convert(add.3617.1), metadata={op_name="jit(scan)/jit(main)/while/body/cond/branch_1_fun/convert_element_type[new_dtype=float64 weak_type=False sharding=None]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1011}
  broadcast.1876.3 = f64[120]{0} broadcast(convert.172.1), dimensions={}, metadata={op_name="jit(scan)/jit(main)/while/body/cond/branch_1_fun/div" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1011}
  divide.569.3 = f64[120]{0} divide(param_0.43, broadcast.1876.3), metadata={op_name="jit(scan)/jit(main)/while/body/cond/branch_1_fun/div" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1011}
  multiply.2783.3 = f64[120]{0} multiply(broadcast.1875.3, divide.569.3), metadata={op_name="jit(scan)/jit(main)/while/body/cond/branch_1_fun/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1011}
  constant_9119_1 = f64[] constant(5)
  divide.570.3 = f64[] divide(constant_9119_1, convert.171.2), metadata={op_name="jit(scan)/jit(main)/while/body/cond/branch_1_fun/div" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1011}
  constant_9118_1 = f64[] constant(0.001)
  multiply.2785.3 = f64[] multiply(divide.570.3, constant_9118_1), metadata={op_name="jit(scan)/jit(main)/while/body/cond/branch_1_fun/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1011}
  broadcast.1877.1 = f64[120]{0} broadcast(multiply.2785.3), dimensions={}, metadata={op_name="jit(scan)/jit(main)/while/body/cond/branch_1_fun/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1011}
  ROOT add.3618.1 = f64[120]{0} add(multiply.2783.3, broadcast.1877.1), metadata={op_name="jit(scan)/jit(main)/while/body/cond/branch_1_fun/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1011}
} // fused_add.5

fused_broadcast {
  constant_9114_1 = f64[] constant(0)
  ROOT broadcast.1878.1 = f64[120]{0} broadcast(constant_9114_1), dimensions={}
}

wrapped_copy_computation.560 {
  param_0.3926 = f64[120]{0} parameter(0)
  ROOT copy.2404 = f64[120]{0} copy(param_0.3926)
}

wrapped_copy_computation.562 {
  param_0.3928 = f64[120]{0} parameter(0)
  ROOT copy.2406 = f64[120]{0} copy(param_0.3928)
}

command_buffer.56 {
  p.614 = s64[] parameter(0)
  p.615 = f64[] parameter(1)
  p.616 = s64[] parameter(2)
  p.617 = (s64[], f64[120]{0}, f64[]) parameter(3)
  wrapped_copy.558 = s64[] fusion(p.614), kind=kLoop, calls=wrapped_copy_computation.558
  wrapped_copy.557 = f64[] fusion(p.615), kind=kLoop, calls=wrapped_copy_computation.557
  wrapped_copy.559 = f64[] fusion(wrapped_copy.557), kind=kLoop, calls=wrapped_copy_computation.559
  wrapped_copy.561 = s64[] fusion(p.616), kind=kLoop, calls=wrapped_copy_computation.561
  get-tuple-element.9110.0 = s64[] get-tuple-element(p.617), index=0
  get-tuple-element.18137 = f64[] get-tuple-element(p.617), index=2, metadata={op_name="jit(scan)/jit(main)/while/body/cond/branch_1_fun/log" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1011}
  wrapped_copy.556 = f64[] fusion(get-tuple-element.18137), kind=kLoop, calls=wrapped_copy_computation.556
  get-tuple-element.9111.0 = f64[120]{0} get-tuple-element(p.617), index=1
  loop_exponential_log_fusion = (f64[], f64[]) fusion(get-tuple-element.18137), kind=kLoop, calls=fused_exponential_log, metadata={op_name="jit(scan)/jit(main)/while/body/cond/branch_1_fun/log" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1011}
  get-tuple-element.18146 = f64[] get-tuple-element(loop_exponential_log_fusion), index=1, metadata={op_name="jit(scan)/jit(main)/while/body/cond/branch_1_fun/log" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1011}
  get-tuple-element.18141 = f64[] get-tuple-element(loop_exponential_log_fusion), index=0, metadata={op_name="jit(scan)/jit(main)/while/body/cond/branch_1_fun/log" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1011}
  loop_add_fusion.5 = f64[120]{0} fusion(get-tuple-element.9111.0, get-tuple-element.9110.0), kind=kLoop, calls=fused_add.5, metadata={op_name="jit(scan)/jit(main)/while/body/cond/branch_1_fun/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1011}
  loop_broadcast_fusion = f64[120]{0} fusion(), kind=kLoop, calls=fused_broadcast
  wrapped_copy.560 = f64[120]{0} fusion(loop_broadcast_fusion), kind=kLoop, calls=wrapped_copy_computation.560
  wrapped_copy.562 = f64[120]{0} fusion(loop_add_fusion.5), kind=kLoop, calls=wrapped_copy_computation.562
  ROOT tuple.690 = (s64[], f64[], f64[], s64[], f64[], /*index=5*/f64[], f64[], f64[120]{0}, f64[120]{0}, f64[120]{0}, /*index=10*/f64[120]{0}) tuple(wrapped_copy.558, wrapped_copy.557, wrapped_copy.559, wrapped_copy.561, wrapped_copy.556, /*index=5*/get-tuple-element.18146, get-tuple-element.18141, loop_add_fusion.5, loop_broadcast_fusion, wrapped_copy.560, /*index=10*/wrapped_copy.562)
} // command_buffer.56

region_58.9108 {
  constant_9121_0 = s64[] constant(1)
  constant_9114_0 = f64[] constant(0)
  constant_9113_0 = s64[] constant(0)
  arg_tuple.9109.0 = (s64[], f64[120]{0}, f64[]) parameter(0)
  call.31 = (s64[], f64[], f64[], s64[], f64[], /*index=5*/f64[], f64[], f64[120]{0}, f64[120]{0}, f64[120]{0}, /*index=10*/f64[120]{0}) call(constant_9121_0, constant_9114_0, constant_9113_0, arg_tuple.9109.0), to_apply=command_buffer.56
  get-tuple-element.20946 = s64[] get-tuple-element(call.31), index=0
  get-tuple-element.20947 = f64[] get-tuple-element(call.31), index=1
  get-tuple-element.20948 = f64[] get-tuple-element(call.31), index=2
  get-tuple-element.20949 = s64[] get-tuple-element(call.31), index=3
  get-tuple-element.20950 = f64[] get-tuple-element(call.31), index=4
  get-tuple-element.20951 = f64[] get-tuple-element(call.31), index=5
  get-tuple-element.20952 = f64[] get-tuple-element(call.31), index=6
  get-tuple-element.20953 = f64[120]{0} get-tuple-element(call.31), index=7
  get-tuple-element.20954 = f64[120]{0} get-tuple-element(call.31), index=8
  get-tuple-element.20955 = f64[120]{0} get-tuple-element(call.31), index=9
  get-tuple-element.20956 = f64[120]{0} get-tuple-element(call.31), index=10
  ROOT tuple.621 = (f64[], f64[], s64[], f64[], f64[], /*index=5*/f64[120]{0}, f64[120]{0}, f64[120]{0}, s64[], f64[], /*index=10*/f64[120]{0}) tuple(get-tuple-element.20950, get-tuple-element.20947, get-tuple-element.20946, get-tuple-element.20948, get-tuple-element.20952, /*index=5*/get-tuple-element.20953, get-tuple-element.20954, get-tuple-element.20955, get-tuple-element.20949, get-tuple-element.20951, /*index=10*/get-tuple-element.20956)
} // region_58.9108

wrapped_copy_computation.73 {
  param_0.3425 = f64[] parameter(0)
  ROOT copy.1917 = f64[] copy(param_0.3425)
}

wrapped_copy_computation.61 {
  param_0.3413 = f64[20]{0} parameter(0)
  ROOT copy.1905 = f64[20]{0} copy(param_0.3413)
}

wrapped_copy_computation.62 {
  param_0.3414 = f64[20]{0} parameter(0)
  ROOT copy.1906 = f64[20]{0} copy(param_0.3414)
}

wrapped_copy_computation.63 {
  param_0.3415 = f64[20]{0} parameter(0)
  ROOT copy.1907 = f64[20]{0} copy(param_0.3415)
}

wrapped_copy_computation.64 {
  param_0.3416 = f64[20]{0} parameter(0)
  ROOT copy.1908 = f64[20]{0} copy(param_0.3416)
}

wrapped_copy_computation.65 {
  param_0.3417 = f64[20]{0} parameter(0)
  ROOT copy.1909 = f64[20]{0} copy(param_0.3417)
}

wrapped_copy_computation.66 {
  param_0.3418 = f64[20]{0} parameter(0)
  ROOT copy.1910 = f64[20]{0} copy(param_0.3418)
}

wrapped_copy_computation.67 {
  param_0.3419 = f64[20]{0} parameter(0)
  ROOT copy.1911 = f64[20]{0} copy(param_0.3419)
}

wrapped_copy_computation.68 {
  param_0.3420 = f64[20]{0} parameter(0)
  ROOT copy.1912 = f64[20]{0} copy(param_0.3420)
}

wrapped_copy_computation.69 {
  param_0.3421 = f64[20]{0} parameter(0)
  ROOT copy.1913 = f64[20]{0} copy(param_0.3421)
}

wrapped_copy_computation.70 {
  param_0.3422 = f64[20]{0} parameter(0)
  ROOT copy.1914 = f64[20]{0} copy(param_0.3422)
}

wrapped_copy_computation.71 {
  param_0.3423 = f64[20]{0} parameter(0)
  ROOT copy.1915 = f64[20]{0} copy(param_0.3423)
}

wrapped_copy_computation.72 {
  param_0.3424 = f64[20]{0} parameter(0)
  ROOT copy.1916 = f64[20]{0} copy(param_0.3424)
}

wrapped_copy_computation.74 {
  param_0.3426 = f64[20]{0} parameter(0)
  ROOT copy.1918 = f64[20]{0} copy(param_0.3426)
}

wrapped_copy_computation.75 {
  param_0.3427 = f64[20]{0} parameter(0)
  ROOT copy.1919 = f64[20]{0} copy(param_0.3427)
}

wrapped_copy_computation.76 {
  param_0.3428 = f64[20]{0} parameter(0)
  ROOT copy.1920 = f64[20]{0} copy(param_0.3428)
}

wrapped_copy_computation.77 {
  param_0.3429 = f64[20]{0} parameter(0)
  ROOT copy.1921 = f64[20]{0} copy(param_0.3429)
}

wrapped_copy_computation.78 {
  param_0.3430 = f64[20]{0} parameter(0)
  ROOT copy.1922 = f64[20]{0} copy(param_0.3430)
}

wrapped_copy_computation.79 {
  param_0.3431 = f64[20]{0} parameter(0)
  ROOT copy.1923 = f64[20]{0} copy(param_0.3431)
}

command_buffer.54 {
  p.610 = f64[] parameter(0)
  p.611 = (f64[20]{0}, f64[20]{0}, f64[20]{0}, f64[20]{0}, f64[20]{0}, /*index=5*/f64[20]{0}, f64[20]{0}, f64[20]{0}, f64[20]{0}, f64[20]{0}, /*index=10*/f64[20]{0}, f64[20]{0}, f64[], f64[20]{0}, f64[20]{0}, /*index=15*/f64[20]{0}, f64[20]{0}, f64[20]{0}, f64[20]{0}) parameter(1)
  wrapped_copy.73 = f64[] fusion(p.610), kind=kLoop, calls=wrapped_copy_computation.73
  get-tuple-element.17330 = f64[20]{0} get-tuple-element(p.611), index=18
  get-tuple-element.17329 = f64[20]{0} get-tuple-element(p.611), index=17
  get-tuple-element.17328 = f64[20]{0} get-tuple-element(p.611), index=16
  get-tuple-element.17327 = f64[20]{0} get-tuple-element(p.611), index=15
  get-tuple-element.17326 = f64[20]{0} get-tuple-element(p.611), index=14
  get-tuple-element.17325 = f64[20]{0} get-tuple-element(p.611), index=13
  get-tuple-element.17323 = f64[20]{0} get-tuple-element(p.611), index=11
  get-tuple-element.17322 = f64[20]{0} get-tuple-element(p.611), index=10
  get-tuple-element.17321 = f64[20]{0} get-tuple-element(p.611), index=9
  get-tuple-element.17320 = f64[20]{0} get-tuple-element(p.611), index=8
  get-tuple-element.17319 = f64[20]{0} get-tuple-element(p.611), index=7
  get-tuple-element.17318 = f64[20]{0} get-tuple-element(p.611), index=6
  get-tuple-element.17317 = f64[20]{0} get-tuple-element(p.611), index=5
  get-tuple-element.17316 = f64[20]{0} get-tuple-element(p.611), index=4
  get-tuple-element.17315 = f64[20]{0} get-tuple-element(p.611), index=3
  get-tuple-element.17314 = f64[20]{0} get-tuple-element(p.611), index=2
  get-tuple-element.17313 = f64[20]{0} get-tuple-element(p.611), index=1
  get-tuple-element.17312 = f64[20]{0} get-tuple-element(p.611), index=0
  wrapped_copy.61 = f64[20]{0} fusion(get-tuple-element.17312), kind=kLoop, calls=wrapped_copy_computation.61
  wrapped_copy.62 = f64[20]{0} fusion(get-tuple-element.17313), kind=kLoop, calls=wrapped_copy_computation.62
  wrapped_copy.63 = f64[20]{0} fusion(get-tuple-element.17314), kind=kLoop, calls=wrapped_copy_computation.63
  wrapped_copy.64 = f64[20]{0} fusion(get-tuple-element.17315), kind=kLoop, calls=wrapped_copy_computation.64
  wrapped_copy.65 = f64[20]{0} fusion(get-tuple-element.17316), kind=kLoop, calls=wrapped_copy_computation.65
  wrapped_copy.66 = f64[20]{0} fusion(get-tuple-element.17317), kind=kLoop, calls=wrapped_copy_computation.66
  wrapped_copy.67 = f64[20]{0} fusion(get-tuple-element.17318), kind=kLoop, calls=wrapped_copy_computation.67
  wrapped_copy.68 = f64[20]{0} fusion(get-tuple-element.17319), kind=kLoop, calls=wrapped_copy_computation.68
  wrapped_copy.69 = f64[20]{0} fusion(get-tuple-element.17320), kind=kLoop, calls=wrapped_copy_computation.69
  wrapped_copy.70 = f64[20]{0} fusion(get-tuple-element.17321), kind=kLoop, calls=wrapped_copy_computation.70
  wrapped_copy.71 = f64[20]{0} fusion(get-tuple-element.17322), kind=kLoop, calls=wrapped_copy_computation.71
  wrapped_copy.72 = f64[20]{0} fusion(get-tuple-element.17323), kind=kLoop, calls=wrapped_copy_computation.72
  wrapped_copy.74 = f64[20]{0} fusion(get-tuple-element.17325), kind=kLoop, calls=wrapped_copy_computation.74
  wrapped_copy.75 = f64[20]{0} fusion(get-tuple-element.17326), kind=kLoop, calls=wrapped_copy_computation.75
  wrapped_copy.76 = f64[20]{0} fusion(get-tuple-element.17327), kind=kLoop, calls=wrapped_copy_computation.76
  wrapped_copy.77 = f64[20]{0} fusion(get-tuple-element.17328), kind=kLoop, calls=wrapped_copy_computation.77
  wrapped_copy.78 = f64[20]{0} fusion(get-tuple-element.17329), kind=kLoop, calls=wrapped_copy_computation.78
  wrapped_copy.79 = f64[20]{0} fusion(get-tuple-element.17330), kind=kLoop, calls=wrapped_copy_computation.79
  ROOT tuple.688 = (f64[], f64[20]{0}, f64[20]{0}, f64[20]{0}, f64[20]{0}, /*index=5*/f64[20]{0}, f64[20]{0}, f64[20]{0}, f64[20]{0}, f64[20]{0}, /*index=10*/f64[20]{0}, f64[20]{0}, f64[20]{0}, f64[20]{0}, f64[20]{0}, /*index=15*/f64[20]{0}, f64[20]{0}, f64[20]{0}, f64[20]{0}) tuple(wrapped_copy.73, wrapped_copy.61, wrapped_copy.62, wrapped_copy.63, wrapped_copy.64, /*index=5*/wrapped_copy.65, wrapped_copy.66, wrapped_copy.67, wrapped_copy.68, wrapped_copy.69, /*index=10*/wrapped_copy.70, wrapped_copy.71, wrapped_copy.72, wrapped_copy.74, wrapped_copy.75, /*index=15*/wrapped_copy.76, wrapped_copy.77, wrapped_copy.78, wrapped_copy.79)
} // command_buffer.54

region_2.1157.clone {
  arg_tuple.83.0 = (f64[20]{0}, f64[20]{0}, f64[20]{0}, f64[20]{0}, f64[20]{0}, /*index=5*/f64[20]{0}, f64[20]{0}, f64[20]{0}, f64[20]{0}, f64[20]{0}, /*index=10*/f64[20]{0}, f64[20]{0}, f64[], f64[20]{0}, f64[20]{0}, /*index=15*/f64[20]{0}, f64[20]{0}, f64[20]{0}, f64[20]{0}) parameter(0)
  get-tuple-element.17324 = f64[] get-tuple-element(arg_tuple.83.0), index=12
