HloModule jit_scan, is_scheduled=true, entry_computation_layout={(f64[2,20]{1,0}, f64[2,20]{1,0}, f64[2,20]{1,0}, f64[2,20]{1,0}, f64[2,20]{1,0}, /*index=5*/f64[2,20]{1,0}, f64[2]{0}, f64[2,20]{1,0}, f64[2,20]{1,0}, f64[2,20]{1,0}, /*index=10*/f64[2,20]{1,0}, f64[2,20]{1,0}, f64[2,20]{1,0}, u32[10,2]{1,0})->(f64[2,20]{1,0}, f64[2,20]{1,0}, f64[2,20]{1,0}, f64[2,20]{1,0}, f64[2,20]{1,0}, /*index=5*/f64[2,20]{1,0}, f64[2]{0}, f64[2,20]{1,0}, f64[2,20]{1,0}, f64[2,20]{1,0}, /*index=10*/f64[2,20]{1,0}, f64[2,20]{1,0}, f64[2,20]{1,0}, f64[10,2,20]{2,1,0}, f64[10,2,20]{2,1,0}, /*index=15*/f64[10,2,20]{2,1,0}, f64[10,2,20]{2,1,0}, f64[10,2,20]{2,1,0}, f64[10,2,20]{2,1,0}, f64[10,2]{1,0}, /*index=20*/f64[10,2,20]{2,1,0}, f64[10,2,20]{2,1,0}, f64[10,2,20]{2,1,0}, f64[10,2,20]{2,1,0}, f64[10,2,20]{2,1,0}, /*index=25*/f64[10,2,20]{2,1,0}, f64[10,2,20]{2,1,0}, f64[10,2,20]{2,1,0}, f64[10,2,20]{2,1,0}, f64[10,2,20]{2,1,0}, /*index=30*/f64[10,2,20]{2,1,0}, f64[10,2,20]{2,1,0}, pred[10,2]{1,0}, pred[10,2]{1,0}, f64[10,2]{1,0}, /*index=35*/f64[10,2,20]{2,1,0}, f64[10,2,20]{2,1,0}, f64[10,2,20]{2,1,0}, f64[10,2,20]{2,1,0}, f64[10,2,20]{2,1,0}, /*index=40*/f64[10,2,20]{2,1,0}, f64[10,2,20]{2,1,0}, f64[10,2,20]{2,1,0}, f64[10,2,20]{2,1,0}, f64[10,2,20]{2,1,0}, /*index=45*/f64[10,2,20]{2,1,0}, f64[10,2,20]{2,1,0}, f64[10,2]{1,0}, f64[10,2,20]{2,1,0}, f64[10,2,20]{2,1,0}, /*index=50*/f64[10,2,20]{2,1,0}, f64[10,2,20]{2,1,0}, f64[10,2,20]{2,1,0}, f64[10,2,20]{2,1,0}, f64[10,2,20]{2,1,0}, /*index=55*/f64[10,2,20]{2,1,0}, f64[10,2,20]{2,1,0}, f64[10,2,20]{2,1,0}, f64[10,2,20]{2,1,0}, f64[10,2,20]{2,1,0}, /*index=60*/f64[10,2,20]{2,1,0}, f64[10,2,20]{2,1,0}, f64[10,2,20]{2,1,0}, f64[10,2,20]{2,1,0}, f64[10,2,20]{2,1,0}, /*index=65*/f64[10,2,20]{2,1,0}, f64[10,2]{1,0}, f64[10,2,20]{2,1,0}, f64[10,2,20]{2,1,0}, f64[10,2,20]{2,1,0}, /*index=70*/f64[10,2,20]{2,1,0}, f64[10,2,20]{2,1,0}, f64[10,2,20]{2,1,0}, s64[10,2]{1,0}, s64[10,2]{1,0}, /*index=75*/f64[10,2]{1,0})}, allow_spmd_sharding_propagation_to_parameters={true,true,true,true,true,true,true,true,true,true,true,true,true,true}, allow_spmd_sharding_propagation_to_output={true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true}, frontend_attributes={fingerprint_before_lhs="c93fa838abdf95de98111822e5cd5bbe"}

fused_select {
  param_3.44 = s32[2]{0} parameter(3)
  param_4.38 = s32[2]{0} parameter(4)
  compare.1126.2 = pred[2]{0} compare(param_3.44, param_4.38), direction=GE, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body_pred/ge" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  param_0.34 = pred[2]{0} parameter(0)
  not.20.2 = pred[2]{0} not(param_0.34), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body_pred/not" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  and.64.1 = pred[2]{0} and(compare.1126.2, not.20.2), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body_pred/and" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  param_2.53 = f64[2]{0} parameter(2)
  constant_6912_1 = f64[] constant(0)
  broadcast.4015.clone.9 = f64[2]{0} broadcast(constant_6912_1), dimensions={}
  compare.1128.3 = pred[2]{0} compare(param_2.53, broadcast.4015.clone.9), direction=LE, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body/le" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  param_1.51 = f64[2]{0} parameter(1)
  compare.1129.5 = pred[2]{0} compare(param_1.51, broadcast.4015.clone.9), direction=LE, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body/le" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  or.801.3 = pred[2]{0} or(compare.1128.3, compare.1129.5), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body/or" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  select.2971.1 = pred[2]{0} select(and.64.1, or.801.3, param_0.34), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while[cond_nconsts=1 body_nconsts=5]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  constant_1334_1_clone_1 = s32[] constant(-1)
  broadcast.4010.3.clone.1 = s32[2]{0} broadcast(constant_1334_1_clone_1), dimensions={}
  add.3970.3.clone.1 = s32[2]{0} add(param_3.44, broadcast.4010.3.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body/sub" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  select.2969.1.clone.1 = s32[2]{0} select(and.64.1, add.3970.3.clone.1, param_3.44), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while[cond_nconsts=1 body_nconsts=5]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  ROOT tuple.479 = (pred[2]{0}, s32[2]{0}) tuple(select.2971.1, select.2969.1.clone.1)
} // fused_select

scalar_add_computation {
  scalar_rhs = f64[] parameter(1)
  scalar_lhs = f64[] parameter(0)
  ROOT add.3969 = f64[] add(scalar_lhs, scalar_rhs)
}

fused_reduce {
  param_0.43 = f64[2,10,120]{2,1,0} parameter(0)
  iota.42.4 = s32[2,1]{1,0} iota(), iota_dimension=0, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body/iota[dtype=int32 shape=(2, 1) dimension=0]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  param_1.64 = s32[2]{0} parameter(1)
  constant_6918_2 = s32[] constant(0)
  broadcast.4011.4 = s32[2]{0} broadcast(constant_6918_2), dimensions={}
  compare.1127.4 = pred[2]{0} compare(param_1.64, broadcast.4011.4), direction=LT, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body/lt" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  constant_6920_2 = s32[] constant(10)
  broadcast.4012.4 = s32[2]{0} broadcast(constant_6920_2), dimensions={}
  add.3971.4 = s32[2]{0} add(param_1.64, broadcast.4012.4), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  select.2970.4 = s32[2]{0} select(compare.1127.4, add.3971.4, param_1.64), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  bitcast.10507.19 = s32[2,1]{1,0} bitcast(select.2970.4)
  broadcast.4013.4 = s32[2,1]{1,0} broadcast(constant_6918_2), dimensions={}
  concatenate.36.19 = s32[2,3]{1,0} concatenate(iota.42.4, bitcast.10507.19, broadcast.4013.4), dimensions={1}, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body/concatenate[dimension=1]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  gather.3.11 = f64[2,1,1,120]{3,0,2,1} gather(param_0.43, concatenate.36.19), offset_dims={1,2,3}, collapsed_slice_dims={}, start_index_map={0,1,2}, index_vector_dim=1, slice_sizes={1,1,120}, indices_are_sorted=true, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body/gather[dimension_numbers=GatherDimensionNumbers(offset_dims=(np.int64(1), np.int64(2)), collapsed_slice_dims=(0,), start_index_map=(0, np.int64(1), np.int64(2))) slice_sizes=(1, 1, 120) unique_indices=True indices_are_sorted=True mode=GatherScatterMode.PROMISE_IN_BOUNDS fill_value=None]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  bitcast.10535.11 = f64[2,120]{1,0} bitcast(gather.3.11)
  param_3.49 = f64[2,120]{1,0} parameter(3)
  param_4.43 = f64[2,10,120]{2,1,0} parameter(4)
  gather.4.9 = f64[2,1,1,120]{3,0,2,1} gather(param_4.43, concatenate.36.19), offset_dims={1,2,3}, collapsed_slice_dims={}, start_index_map={0,1,2}, index_vector_dim=1, slice_sizes={1,1,120}, indices_are_sorted=true, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body/gather[dimension_numbers=GatherDimensionNumbers(offset_dims=(np.int64(1), np.int64(2)), collapsed_slice_dims=(0,), start_index_map=(0, np.int64(1), np.int64(2))) slice_sizes=(1, 1, 120) unique_indices=True indices_are_sorted=True mode=GatherScatterMode.PROMISE_IN_BOUNDS fill_value=None]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  bitcast.10525.7 = f64[2,120]{1,0} bitcast(gather.4.9)
  subtract.218.7 = f64[2,120]{1,0} subtract(param_3.49, bitcast.10525.7), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body/sub" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  add.3972.7 = f64[2,120]{1,0} add(subtract.218.7, bitcast.10535.11), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  param_2.58 = f64[2,120]{1,0} parameter(2)
  add.3973.9 = f64[2,120]{1,0} add(param_2.58, bitcast.10535.11), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  constant_1117_1 = f64[] constant(0.5)
  broadcast.4014.7 = f64[2,120]{1,0} broadcast(constant_1117_1), dimensions={}
  multiply.2886.7 = f64[2,120]{1,0} multiply(add.3973.9, broadcast.4014.7), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body/div" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  subtract.219.5 = f64[2,120]{1,0} subtract(add.3972.7, multiply.2886.7), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body/sub" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  multiply.2887.3 = f64[2,120]{1,0} multiply(bitcast.10535.11, subtract.219.5)
  constant_6912_2 = f64[] constant(0)
  reduce.13.1 = f64[2]{0} reduce(multiply.2887.3, constant_6912_2), dimensions={1}, to_apply=scalar_add_computation, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body/dot_general[dimension_numbers=(((1,), (1,)), ((0,), (0,))) precision=None preferred_element_type=float64]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  multiply.2888.1.clone.1 = f64[2,120]{1,0} multiply(param_2.58, subtract.219.5)
  reduce.14.1.clone.1 = f64[2]{0} reduce(multiply.2888.1.clone.1, constant_6912_2), dimensions={1}, to_apply=scalar_add_computation, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body/dot_general[dimension_numbers=(((1,), (1,)), ((0,), (0,))) precision=None preferred_element_type=float64]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  ROOT tuple.478 = (f64[2]{0}, f64[2]{0}) tuple(reduce.13.1, reduce.14.1.clone.1)
} // fused_reduce

region_35.6903 {
  arg_tuple.6904.0 = (s32[2]{0}, pred[2]{0}, s32[2]{0}, f64[2,10,120]{2,1,0}, f64[2,120]{1,0}, /*index=5*/f64[2,10,120]{2,1,0}, f64[2,120]{1,0}) parameter(0)
  get-tuple-element.16411 = s32[2]{0} get-tuple-element(arg_tuple.6904.0), index=0
  get-tuple-element.16420 = s32[2]{0} get-tuple-element(arg_tuple.6904.0), index=2
  get-tuple-element.16421 = f64[2,10,120]{2,1,0} get-tuple-element(arg_tuple.6904.0), index=3
  get-tuple-element.16422 = f64[2,120]{1,0} get-tuple-element(arg_tuple.6904.0), index=4
  get-tuple-element.16423 = f64[2,10,120]{2,1,0} get-tuple-element(arg_tuple.6904.0), index=5
  get-tuple-element.16424 = f64[2,120]{1,0} get-tuple-element(arg_tuple.6904.0), index=6
  get-tuple-element.16412 = pred[2]{0} get-tuple-element(arg_tuple.6904.0), index=1
  input_reduce_fusion = (f64[2]{0}, f64[2]{0}) fusion(get-tuple-element.16423, get-tuple-element.16411, get-tuple-element.16424, get-tuple-element.16422, get-tuple-element.16421), kind=kInput, calls=fused_reduce, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body/dot_general[dimension_numbers=(((1,), (1,)), ((0,), (0,))) precision=None preferred_element_type=float64]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  get-tuple-element.15649 = f64[2]{0} get-tuple-element(input_reduce_fusion), index=1, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body/dot_general[dimension_numbers=(((1,), (1,)), ((0,), (0,))) precision=None preferred_element_type=float64]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  get-tuple-element.15648 = f64[2]{0} get-tuple-element(input_reduce_fusion), index=0, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body/dot_general[dimension_numbers=(((1,), (1,)), ((0,), (0,))) precision=None preferred_element_type=float64]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  loop_select_fusion = (pred[2]{0}, s32[2]{0}) fusion(get-tuple-element.16412, get-tuple-element.15649, get-tuple-element.15648, get-tuple-element.16411, get-tuple-element.16420), kind=kLoop, calls=fused_select, control-predecessors={input_reduce_fusion}, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while[cond_nconsts=1 body_nconsts=5]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  get-tuple-element.16418 = s32[2]{0} get-tuple-element(loop_select_fusion), index=1, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while[cond_nconsts=1 body_nconsts=5]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  get-tuple-element.16419 = pred[2]{0} get-tuple-element(loop_select_fusion), index=0, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while[cond_nconsts=1 body_nconsts=5]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  ROOT tuple.749 = (s32[2]{0}, pred[2]{0}, s32[2]{0}, f64[2,10,120]{2,1,0}, f64[2,120]{1,0}, /*index=5*/f64[2,10,120]{2,1,0}, f64[2,120]{1,0}) tuple(get-tuple-element.16418, get-tuple-element.16419, get-tuple-element.16420, get-tuple-element.16421, get-tuple-element.16422, /*index=5*/get-tuple-element.16423, get-tuple-element.16424)
} // region_35.6903

region_37.6968 {
  Arg_1.6970 = pred[] parameter(1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while[cond_nconsts=1 body_nconsts=5]"}
  Arg_0.6969 = pred[] parameter(0), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while[cond_nconsts=1 body_nconsts=5]"}
  ROOT or.802 = pred[] or(Arg_0.6969, Arg_1.6970), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while[cond_nconsts=1 body_nconsts=5]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
}

fused_reduce.1 {
  param_1.70 = s32[2]{0} parameter(1)
  param_2.64 = s32[2]{0} parameter(2)
  compare.1130.1 = pred[2]{0} compare(param_1.70, param_2.64), direction=GE, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/cond/ge" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  param_0.47 = pred[2]{0} parameter(0)
  not.21.1 = pred[2]{0} not(param_0.47), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/cond/not" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  and.65.1 = pred[2]{0} and(compare.1130.1, not.21.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/cond/and" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  constant_6981_1 = pred[] constant(false)
  ROOT reduce.6985.1 = pred[] reduce(and.65.1, constant_6981_1), dimensions={0}, to_apply=region_37.6968, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while[cond_nconsts=1 body_nconsts=5]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
} // fused_reduce.1

region_36.6972 {
  arg_tuple.6973.0 = (s32[2]{0}, pred[2]{0}, s32[2]{0}, f64[2,10,120]{2,1,0}, f64[2,120]{1,0}, /*index=5*/f64[2,10,120]{2,1,0}, f64[2,120]{1,0}) parameter(0)
  get-tuple-element.6974.0 = s32[2]{0} get-tuple-element(arg_tuple.6973.0), index=0
  get-tuple-element.6976.0 = s32[2]{0} get-tuple-element(arg_tuple.6973.0), index=2
  get-tuple-element.6975.0 = pred[2]{0} get-tuple-element(arg_tuple.6973.0), index=1
  ROOT input_reduce_fusion.1 = pred[] fusion(get-tuple-element.6975.0, get-tuple-element.6974.0, get-tuple-element.6976.0), kind=kInput, calls=fused_reduce.1, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while[cond_nconsts=1 body_nconsts=5]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
}

fused_broadcast.2 {
  constant_1429_3 = f64[] constant(0)
  ROOT broadcast.4019.1 = f64[20,1]{1,0} broadcast(constant_1429_3), dimensions={}
}

fused_broadcast.1 {
  constant_1429_2 = f64[] constant(0)
  ROOT broadcast.4016.1 = f64[20]{0} broadcast(constant_1429_2), dimensions={}
}

fused_broadcast {
  constant_1429_1 = f64[] constant(0)
  ROOT broadcast.4017.1 = f64[2,20]{1,0} broadcast(constant_1429_1), dimensions={}
}

wrapped_copy_computation.179 {
  param_0.5589 = f64[2,20]{1,0} parameter(0)
  ROOT copy.1368 = f64[2,20]{1,0} copy(param_0.5589)
}

fused_multiply_negate {
  param_0.5322 = f64[2,20]{1,0} parameter(0)
  param_4.3615 = f64[] parameter(4)
  broadcast.4018.3.clone.1 = f64[2,20]{1,0} broadcast(param_4.3615), dimensions={}, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  param_2.5828 = f64[2,20]{1,0} parameter(2)
  param_3.4932 = f64[2,20]{1,0} parameter(3)
  multiply.2889.2.clone.1 = f64[2,20]{1,0} multiply(param_2.5828, param_3.4932), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  negate.466.4.clone.1 = f64[2,20]{1,0} negate(multiply.2889.2.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/neg" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  multiply.2891.3.clone.1 = f64[2,20]{1,0} multiply(broadcast.4018.3.clone.1, negate.466.4.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  param_1.7591 = f64[2,20]{1,0} parameter(1)
  multiply.2892.1.clone.1 = f64[2,20]{1,0} multiply(multiply.2891.3.clone.1, param_1.7591), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  multiply.2893.1 = f64[2,20]{1,0} multiply(param_0.5322, multiply.2892.1.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  param_5.2976 = f64[2,20]{1,0} parameter(5)
  multiply.2890.1.clone.1 = f64[2,20]{1,0} multiply(negate.466.4.clone.1, param_5.2976), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  negate.467.1.clone.1 = f64[2,20]{1,0} negate(multiply.2890.1.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/neg" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  ROOT tuple.481 = (f64[2,20]{1,0}, f64[2,20]{1,0}, f64[2,20]{1,0}) tuple(multiply.2893.1, multiply.2892.1.clone.1, negate.467.1.clone.1)
} // fused_multiply_negate

command_buffer.22 {
  p.944 = f64[2,20]{1,0} parameter(0)
  p.945 = f64[2,20]{1,0} parameter(1)
  p.946 = f64[2,20]{1,0} parameter(2)
  p.947 = f64[2,20]{1,0} parameter(3)
  p.948 = f64[] parameter(4)
  p.949 = f64[2,20]{1,0} parameter(5)
  loop_broadcast_fusion.2 = f64[20,1]{1,0} fusion(), kind=kLoop, calls=fused_broadcast.2
  loop_broadcast_fusion.1 = f64[20]{0} fusion(), kind=kLoop, calls=fused_broadcast.1
  loop_broadcast_fusion = f64[2,20]{1,0} fusion(), kind=kLoop, calls=fused_broadcast
  wrapped_copy.179 = f64[2,20]{1,0} fusion(loop_broadcast_fusion), kind=kLoop, calls=wrapped_copy_computation.179
  loop_multiply_negate_fusion = (f64[2,20]{1,0}, f64[2,20]{1,0}, f64[2,20]{1,0}) fusion(p.944, p.945, p.946, p.947, p.948, /*index=5*/p.949), kind=kLoop, calls=fused_multiply_negate, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  ROOT tuple.786 = (f64[20,1]{1,0}, f64[20]{0}, f64[2,20]{1,0}, f64[2,20]{1,0}, (f64[2,20]{1,0}, f64[2,20]{1,0}, f64[2,20]{1,0})) tuple(loop_broadcast_fusion.2, loop_broadcast_fusion.1, loop_broadcast_fusion, wrapped_copy.179, loop_multiply_negate_fusion)
} // command_buffer.22

region_29.5206.clone {
  arg_tuple.6.0 = (f64[2,20]{1,0}, f64[], f64[2,20]{1,0}, f64[2,20]{1,0}, f64[2,20]{1,0}, /*index=5*/f64[2,20]{1,0}) parameter(0)
  get-tuple-element.2425.0 = f64[] get-tuple-element(arg_tuple.6.0), index=1
  get-tuple-element.2429.0 = f64[2,20]{1,0} get-tuple-element(arg_tuple.6.0), index=5
  get-tuple-element.2428.0 = f64[2,20]{1,0} get-tuple-element(arg_tuple.6.0), index=4
  get-tuple-element.2427.0 = f64[2,20]{1,0} get-tuple-element(arg_tuple.6.0), index=3
  get-tuple-element.2426.0 = f64[2,20]{1,0} get-tuple-element(arg_tuple.6.0), index=2
  get-tuple-element.2424.0 = f64[2,20]{1,0} get-tuple-element(arg_tuple.6.0), index=0
  call.12 = (f64[20,1]{1,0}, f64[20]{0}, f64[2,20]{1,0}, f64[2,20]{1,0}, (f64[2,20]{1,0}, f64[2,20]{1,0}, f64[2,20]{1,0})) call(get-tuple-element.2426.0, get-tuple-element.2427.0, get-tuple-element.2429.0, get-tuple-element.2428.0, get-tuple-element.2425.0, /*index=5*/get-tuple-element.2424.0), to_apply=command_buffer.22
  get-tuple-element.18041 = f64[20,1]{1,0} get-tuple-element(call.12), index=0
  get-tuple-element.18042 = f64[20]{0} get-tuple-element(call.12), index=1
  get-tuple-element.18043 = f64[2,20]{1,0} get-tuple-element(call.12), index=2
  get-tuple-element.18044 = f64[2,20]{1,0} get-tuple-element(call.12), index=3
  get-tuple-element.18045 = (f64[2,20]{1,0}, f64[2,20]{1,0}, f64[2,20]{1,0}) get-tuple-element(call.12), index=4
  get-tuple-element.15964 = f64[2,20]{1,0} get-tuple-element(get-tuple-element.18045), index=2, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  get-tuple-element.15965 = f64[2,20]{1,0} get-tuple-element(get-tuple-element.18045), index=1, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  get-tuple-element.15966 = f64[2,20]{1,0} get-tuple-element(get-tuple-element.18045), index=0, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  ROOT tuple.739 = (f64[20]{0}, f64[2,20]{1,0}, f64[2,20]{1,0}, f64[2,20]{1,0}, f64[2,20]{1,0}, /*index=5*/f64[2,20]{1,0}, f64[20,1]{1,0}) tuple(get-tuple-element.18042, get-tuple-element.18043, get-tuple-element.18044, get-tuple-element.15964, get-tuple-element.15965, /*index=5*/get-tuple-element.15966, get-tuple-element.18041)
} // region_29.5206.clone

fused_broadcast.4 {
  constant_1436_3 = f64[] constant(0)
  ROOT broadcast.4023.1 = f64[20,1]{1,0} broadcast(constant_1436_3), dimensions={}
}

fused_broadcast.3 {
  constant_1436_2 = f64[] constant(0)
  ROOT broadcast.4020.1 = f64[20]{0} broadcast(constant_1436_2), dimensions={}
}

fused_broadcast_multiply_select {
  param_0.61 = f64[2,20]{1,0} parameter(0)
  param_2.5829 = pred[2,20]{1,0} parameter(2)
  param_3.4933 = f64[2,20]{1,0} parameter(3)
  constant_1436_1_clone_1 = f64[] constant(0)
  broadcast.4021.clone.2.1.clone.1 = f64[2,20]{1,0} broadcast(constant_1436_1_clone_1), dimensions={}, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_1_fun/jit(precision_update)/jit(_where)/broadcast_in_dim[shape=(2, 20) broadcast_dimensions=(np.int64(1),)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  select.2972.1 = f64[2,20]{1,0} select(param_2.5829, param_3.4933, broadcast.4021.clone.2.1.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_1_fun/jit(precision_update)/jit(_where)/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  param_1.7592 = f64[] parameter(1)
  broadcast.4022.3 = f64[2,20]{1,0} broadcast(param_1.7592), dimensions={}, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_1_fun/jit(precision_update)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  multiply.2894.3 = f64[2,20]{1,0} multiply(select.2972.1, broadcast.4022.3), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_1_fun/jit(precision_update)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  multiply.2895.1 = f64[2,20]{1,0} multiply(param_0.61, multiply.2894.3), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_1_fun/jit(precision_update)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  ROOT tuple.483 = (f64[2,20]{1,0}, f64[2,20]{1,0}, f64[2,20]{1,0}) tuple(multiply.2895.1, select.2972.1, broadcast.4021.clone.2.1.clone.1)
} // fused_broadcast_multiply_select

wrapped_copy_computation.180 {
  param_0.5590 = f64[2,20]{1,0} parameter(0)
  ROOT copy.1369 = f64[2,20]{1,0} copy(param_0.5590)
}

wrapped_copy_computation.181 {
  param_0.5591 = f64[2,20]{1,0} parameter(0)
  ROOT copy.1370 = f64[2,20]{1,0} copy(param_0.5591)
}

command_buffer.20 {
  p.936 = f64[2,20]{1,0} parameter(0)
  p.937 = f64[] parameter(1)
  p.938 = pred[2,20]{1,0} parameter(2)
  p.939 = f64[2,20]{1,0} parameter(3)
  loop_broadcast_fusion.4 = f64[20,1]{1,0} fusion(), kind=kLoop, calls=fused_broadcast.4
  loop_broadcast_fusion.3 = f64[20]{0} fusion(), kind=kLoop, calls=fused_broadcast.3
  loop_broadcast_multiply_select_fusion = (f64[2,20]{1,0}, f64[2,20]{1,0}, f64[2,20]{1,0}) fusion(p.936, p.937, p.938, p.939), kind=kLoop, calls=fused_broadcast_multiply_select, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_1_fun/jit(precision_update)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  get-tuple-element.15973 = f64[2,20]{1,0} get-tuple-element(loop_broadcast_multiply_select_fusion), index=2, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_1_fun/jit(precision_update)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  get-tuple-element.15970 = f64[2,20]{1,0} get-tuple-element(loop_broadcast_multiply_select_fusion), index=1, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_1_fun/jit(precision_update)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  get-tuple-element.15969 = f64[2,20]{1,0} get-tuple-element(loop_broadcast_multiply_select_fusion), index=0, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_1_fun/jit(precision_update)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  wrapped_copy.180 = f64[2,20]{1,0} fusion(get-tuple-element.15973), kind=kLoop, calls=wrapped_copy_computation.180
  wrapped_copy.181 = f64[2,20]{1,0} fusion(get-tuple-element.15973), kind=kLoop, calls=wrapped_copy_computation.181
  ROOT tuple.784 = (f64[20,1]{1,0}, f64[20]{0}, f64[2,20]{1,0}, f64[2,20]{1,0}, f64[2,20]{1,0}, /*index=5*/f64[2,20]{1,0}, f64[2,20]{1,0}) tuple(loop_broadcast_fusion.4, loop_broadcast_fusion.3, get-tuple-element.15973, get-tuple-element.15970, get-tuple-element.15969, /*index=5*/wrapped_copy.180, wrapped_copy.181)
} // command_buffer.20

region_30.5243.clone.clone {
  arg_tuple.8.0 = (f64[2,20]{1,0}, f64[], pred[2,20]{1,0}, f64[2,20]{1,0}) parameter(0)
  get-tuple-element.2449.0 = f64[] get-tuple-element(arg_tuple.8.0), index=1
  get-tuple-element.2451.0 = f64[2,20]{1,0} get-tuple-element(arg_tuple.8.0), index=3
  get-tuple-element.2450.0 = pred[2,20]{1,0} get-tuple-element(arg_tuple.8.0), index=2
  get-tuple-element.2448.0 = f64[2,20]{1,0} get-tuple-element(arg_tuple.8.0), index=0
  call.11 = (f64[20,1]{1,0}, f64[20]{0}, f64[2,20]{1,0}, f64[2,20]{1,0}, f64[2,20]{1,0}, /*index=5*/f64[2,20]{1,0}, f64[2,20]{1,0}) call(get-tuple-element.2448.0, get-tuple-element.2449.0, get-tuple-element.2450.0, get-tuple-element.2451.0), to_apply=command_buffer.20
  get-tuple-element.18034 = f64[20,1]{1,0} get-tuple-element(call.11), index=0
  get-tuple-element.18035 = f64[20]{0} get-tuple-element(call.11), index=1
  get-tuple-element.18036 = f64[2,20]{1,0} get-tuple-element(call.11), index=2
  get-tuple-element.18037 = f64[2,20]{1,0} get-tuple-element(call.11), index=3
  get-tuple-element.18038 = f64[2,20]{1,0} get-tuple-element(call.11), index=4
  get-tuple-element.18039 = f64[2,20]{1,0} get-tuple-element(call.11), index=5
  get-tuple-element.18040 = f64[2,20]{1,0} get-tuple-element(call.11), index=6
  ROOT tuple.740 = (f64[20]{0}, f64[2,20]{1,0}, f64[2,20]{1,0}, f64[2,20]{1,0}, f64[2,20]{1,0}, /*index=5*/f64[2,20]{1,0}, f64[20,1]{1,0}) tuple(get-tuple-element.18035, get-tuple-element.18038, get-tuple-element.18037, get-tuple-element.18036, get-tuple-element.18039, /*index=5*/get-tuple-element.18040, get-tuple-element.18034)
} // region_30.5243.clone.clone

fused_add_select {
  param_1.1056 = pred[192,2,20]{2,1,0} parameter(1)
  constant_1987_20 = s64[] constant(191)
  param_2.880 = s64[] parameter(2)
  subtract.220.39 = s64[] subtract(constant_1987_20, param_2.880), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/sub" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  constant_1980_14 = s64[] constant(0)
  compare.1131.39 = pred[] compare(subtract.220.39, constant_1980_14), direction=LT, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/lt" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  constant_1988_20 = s64[] constant(383)
  subtract.221.39 = s64[] subtract(constant_1988_20, param_2.880), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  select.2973.39 = s64[] select(compare.1131.39, subtract.221.39, subtract.220.39), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  dynamic-slice.1237.30 = pred[1,2,20]{2,1,0} dynamic-slice(param_1.1056, select.2973.39, constant_1980_14, constant_1980_14), dynamic_slice_sizes={1,2,20}, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/dynamic_slice[slice_sizes=(1, 2, 20)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  bitcast.10661.29 = pred[2,20]{1,0} bitcast(dynamic-slice.1237.30)
  constant_1982_20 = f64[] constant(0)
  broadcast.4024.clone.83 = f64[2,20]{1,0} broadcast(constant_1982_20), dimensions={}
  param_0.272 = f64[2,20]{1,0} parameter(0)
  select.3007.1 = f64[2,20]{1,0} select(bitcast.10661.29, broadcast.4024.clone.83, param_0.272), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(_where)/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  param_9.1697 = f64[2,20]{1,0} parameter(9)
  select.3009.3.clone.1 = f64[2,20]{1,0} select(bitcast.10661.29, broadcast.4024.clone.83, param_9.1697), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(_where)/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=370}
  param_4.3627 = f64[2,20]{1,0} parameter(4)
  param_21.1493 = f64[192,2,20]{2,1,0} parameter(21)
  dynamic-slice.1261.6.clone.1 = f64[1,2,20]{2,1,0} dynamic-slice(param_21.1493, select.2973.39, constant_1980_14, constant_1980_14), dynamic_slice_sizes={1,2,20}, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/dynamic_slice[slice_sizes=(1, 2, 20)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  bitcast.11117.6.clone.1 = f64[2,20]{1,0} bitcast(dynamic-slice.1261.6.clone.1)
  param_20.1751 = pred[192,2,20]{2,1,0} parameter(20)
  dynamic-slice.1274.3.clone.1 = pred[1,2,20]{2,1,0} dynamic-slice(param_20.1751, select.2973.39, constant_1980_14, constant_1980_14), dynamic_slice_sizes={1,2,20}, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/dynamic_slice[slice_sizes=(1, 2, 20)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  bitcast.11451.5.clone.1 = pred[2,20]{1,0} bitcast(dynamic-slice.1274.3.clone.1)
  param_37.234 = f64[2,20]{1,0} parameter(37)
  select.2996.9.clone.1 = f64[2,20]{1,0} select(bitcast.10661.29, param_37.234, broadcast.4024.clone.83), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(_where)/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  param_36.258 = f64[2,20]{1,0} parameter(36)
  select.2982.9.clone.1 = f64[2,20]{1,0} select(bitcast.10661.29, param_36.258, broadcast.4024.clone.83), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(_where)/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  param_18.1529 = pred[192,2,20]{2,1,0} parameter(18)
  dynamic-slice.1243.13.clone.1 = pred[1,2,20]{2,1,0} dynamic-slice(param_18.1529, select.2973.39, constant_1980_14, constant_1980_14), dynamic_slice_sizes={1,2,20}, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/dynamic_slice[slice_sizes=(1, 2, 20)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  bitcast.10789.29.clone.1 = pred[2,20]{1,0} bitcast(dynamic-slice.1243.13.clone.1)
  param_35.267 = f64[192,2,20]{2,1,0} parameter(35)
  dynamic-slice.1244.11.clone.1 = f64[1,2,20]{2,1,0} dynamic-slice(param_35.267, select.2973.39, constant_1980_14, constant_1980_14), dynamic_slice_sizes={1,2,20}, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/dynamic_slice[slice_sizes=(1, 2, 20)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  bitcast.10798.11.clone.1 = f64[2,20]{1,0} bitcast(dynamic-slice.1244.11.clone.1)
  param_16.1173 = pred[192,2,20]{2,1,0} parameter(16)
  dynamic-slice.1245.18.clone.1 = pred[1,2,20]{2,1,0} dynamic-slice(param_16.1173, select.2973.39, constant_1980_14, constant_1980_14), dynamic_slice_sizes={1,2,20}, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/dynamic_slice[slice_sizes=(1, 2, 20)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  bitcast.10807.25.clone.1 = pred[2,20]{1,0} bitcast(dynamic-slice.1245.18.clone.1)
  param_15.1073 = s32[192,2,20]{2,1,0} parameter(15)
  dynamic-slice.1246.26.clone.1 = s32[1,2,20]{2,1,0} dynamic-slice(param_15.1073, select.2973.39, constant_1980_14, constant_1980_14), dynamic_slice_sizes={1,2,20}, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/dynamic_slice[slice_sizes=(1, 2, 20)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  constant_1983_3_clone_1 = s32[] constant(1)
  broadcast.4025.21.clone.1 = s32[1,2,20]{2,1,0} broadcast(constant_1983_3_clone_1), dimensions={}
  compare.1132.21.clone.1 = pred[1,2,20]{2,1,0} compare(dynamic-slice.1246.26.clone.1, broadcast.4025.21.clone.1), direction=EQ, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update_ehgf)/jit(posterior_update_precision_continuous_node)/eq" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  bitcast.10819.25.clone.1 = pred[2,20]{1,0} bitcast(compare.1132.21.clone.1)
  param_14.1075 = f64[2,20]{1,0} parameter(14)
  select.2983.31.clone.1 = f64[2,20]{1,0} select(bitcast.10661.29, param_14.1075, broadcast.4024.clone.83), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(_where)/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  select.2984.25.clone.1 = f64[2,20]{1,0} select(bitcast.10819.25.clone.1, select.2983.31.clone.1, broadcast.4024.clone.83), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update_ehgf)/jit(posterior_update_precision_continuous_node)/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  select.2985.25.clone.1 = f64[2,20]{1,0} select(bitcast.10807.25.clone.1, select.2984.25.clone.1, broadcast.4024.clone.83), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update_ehgf)/jit(posterior_update_precision_continuous_node)/jit(precision_update)/jit(_where)/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  param_13.1167 = f64[192,2,20]{2,1,0} parameter(13)
  dynamic-slice.1247.32.clone.1 = f64[1,2,20]{2,1,0} dynamic-slice(param_13.1167, select.2973.39, constant_1980_14, constant_1980_14), dynamic_slice_sizes={1,2,20}, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/dynamic_slice[slice_sizes=(1, 2, 20)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  bitcast.10839.32.clone.1 = f64[2,20]{1,0} bitcast(dynamic-slice.1247.32.clone.1)
  multiply.2896.13.clone.1 = f64[2,20]{1,0} multiply(select.2985.25.clone.1, bitcast.10839.32.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update_ehgf)/jit(posterior_update_precision_continuous_node)/jit(precision_update)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  negate.468.16.clone.1 = f64[2,20]{1,0} negate(multiply.2896.13.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update_ehgf)/jit(posterior_update_precision_continuous_node)/jit(precision_update)/neg" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  multiply.2897.11.clone.1 = f64[2,20]{1,0} multiply(bitcast.10798.11.clone.1, negate.468.16.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update_ehgf)/jit(posterior_update_precision_continuous_node)/jit(precision_update)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  param_34.278 = f64[192,2,20]{2,1,0} parameter(34)
  dynamic-slice.1248.9.clone.1 = f64[1,2,20]{2,1,0} dynamic-slice(param_34.278, select.2973.39, constant_1980_14, constant_1980_14), dynamic_slice_sizes={1,2,20}, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/dynamic_slice[slice_sizes=(1, 2, 20)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  bitcast.10851.9.clone.1 = f64[2,20]{1,0} bitcast(dynamic-slice.1248.9.clone.1)
  multiply.2898.9.clone.1 = f64[2,20]{1,0} multiply(bitcast.10851.9.clone.1, multiply.2896.13.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update_ehgf)/jit(posterior_update_precision_continuous_node)/jit(precision_update)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
