HloModule jit_scan, is_scheduled=true, entry_computation_layout={(f64[], f64[], f64[], f64[], s64[], /*index=5*/f64[], f64[], f64[1]{0}, f64[], f64[], /*index=10*/f64[], f64[], s64[], f64[], f64[], /*index=15*/f64[], f64[], f64[], f64[], f64[], /*index=20*/f64[1]{0}, f64[192,1]{1,0}, s64[192]{0}, f64[192]{0})->(f64[], f64[], f64[], f64[], s64[], /*index=5*/f64[], f64[], f64[1]{0}, f64[], f64[], /*index=10*/f64[], f64[], s64[], f64[], f64[], /*index=15*/f64[], f64[], f64[], f64[], f64[], /*index=20*/f64[1]{0}, f64[192]{0}, f64[192]{0}, f64[192]{0}, f64[192]{0}, /*index=25*/s64[192]{0}, f64[192]{0}, f64[192]{0}, f64[192,1]{1,0}, f64[192]{0}, /*index=30*/f64[192]{0}, f64[192]{0}, f64[192]{0}, s64[192]{0}, f64[192]{0}, /*index=35*/f64[192]{0}, f64[192]{0}, f64[192]{0}, f64[192]{0}, f64[192]{0}, /*index=40*/f64[192]{0}, f64[192,1]{1,0})}, allow_spmd_sharding_propagation_to_parameters={true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true}, allow_spmd_sharding_propagation_to_output={true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true}, frontend_attributes={fingerprint_before_lhs="f6d427db0ff5964f64c57091cc7ff1be"}

fused_divide {
  constant_3_1 = f64[] constant(1)
  param_2.3 = f64[] parameter(2)
  divide.35.1 = f64[] divide(constant_3_1, param_2.3), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/div" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  param_0.1 = f64[] parameter(0)
  param_1.3 = f64[] parameter(1)
  exponential.13.1 = f64[] exponential(param_1.3), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/exp" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  multiply.65.1 = f64[] multiply(param_0.1, exponential.13.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  add.31.1 = f64[] add(divide.35.1, multiply.65.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  ROOT divide.36.1 = f64[] divide(constant_3_1, add.31.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/div" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
} // fused_divide

region_2.109 {
  arg_tuple.110.0 = (f64[], f64[], f64[]) parameter(0)
  get-tuple-element.113.0 = f64[] get-tuple-element(arg_tuple.110.0), index=2
  get-tuple-element.112.0 = f64[] get-tuple-element(arg_tuple.110.0), index=1
  get-tuple-element.111.0 = f64[] get-tuple-element(arg_tuple.110.0), index=0
  loop_divide_fusion = f64[] fusion(get-tuple-element.111.0, get-tuple-element.113.0, get-tuple-element.112.0), kind=kLoop, calls=fused_divide, metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/div" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  ROOT tuple.44 = (f64[]) tuple(loop_divide_fusion)
} // region_2.109

fused_select {
  param_0.13 = f64[] parameter(0)
  param_3.11 = f64[1]{0} parameter(3)
  multiply.66.1 = f64[1]{0} multiply(param_3.11, param_3.11), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_1_fun/jit(precision_update)/integer_pow[y=2]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  bitcast.582.7 = f64[] bitcast(multiply.66.1)
  param_1.19 = f64[] parameter(1)
  multiply.67.7 = f64[] multiply(bitcast.582.7, param_1.19), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_1_fun/jit(precision_update)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  param_2.15 = s64[] parameter(2)
  convert.21.1 = f64[] convert(param_2.15), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_1_fun/jit(precision_update)/convert_element_type[new_dtype=float64 weak_type=False sharding=None]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  multiply.68.5 = f64[] multiply(multiply.67.7, convert.21.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_1_fun/jit(precision_update)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  add.32.3 = f64[] add(param_0.13, multiply.68.5), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_1_fun/jit(precision_update)/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  constant_5_1 = f64[] constant(1e-128)
  compare.18.1 = pred[] compare(add.32.3, constant_5_1), direction=GT, metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_1_fun/jit(precision_update)/gt" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  constant_6_1 = f64[] constant(nan)
  ROOT select.12.1 = f64[] select(compare.18.1, add.32.3, constant_6_1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_prediction)/jit(predict_precision)/jit(_where)/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
} // fused_select

region_3.137 {
  arg_tuple.138.0 = (f64[], s64[], f64[], f64[1]{0}) parameter(0)
  get-tuple-element.142.0 = f64[1]{0} get-tuple-element(arg_tuple.138.0), index=3, metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_1_fun/jit(precision_update)/squeeze[dimensions=(0,)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  get-tuple-element.141.0 = f64[] get-tuple-element(arg_tuple.138.0), index=2
  get-tuple-element.140.0 = s64[] get-tuple-element(arg_tuple.138.0), index=1
  get-tuple-element.139.0 = f64[] get-tuple-element(arg_tuple.138.0), index=0
  loop_select_fusion = f64[] fusion(get-tuple-element.141.0, get-tuple-element.139.0, get-tuple-element.140.0, get-tuple-element.142.0), kind=kLoop, calls=fused_select, metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_prediction)/jit(predict_precision)/jit(_where)/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  ROOT tuple.45 = (f64[]) tuple(loop_select_fusion)
} // region_3.137

fused_add_divide_dynamic_slice_multiply {
  constant_38_2 = f64[] constant(1)
  param_3.147 = f64[] parameter(3)
  param_4.102 = f64[] parameter(4)
  multiply.69.1.clone.1 = f64[] multiply(param_3.147, param_4.102), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_prediction)/jit(predict_mean)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  param_1.197 = f64[192]{0} parameter(1)
  param_2.195 = s64[] parameter(2)
  constant_37_28_clone_1 = s64[] constant(0)
  compare.19.55.clone.1 = pred[] compare(param_2.195, constant_37_28_clone_1), direction=LT, metadata={op_name="jit(scan)/jit(main)/while/body/lt" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  constant_36_28_clone_1 = s64[] constant(192)
  add.34.55.clone.1 = s64[] add(param_2.195, constant_36_28_clone_1), metadata={op_name="jit(scan)/jit(main)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  select.13.55.clone.1 = s64[] select(compare.19.55.clone.1, add.34.55.clone.1, param_2.195), metadata={op_name="jit(scan)/jit(main)/while/body/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  dynamic-slice.6.2.clone.1 = f64[1]{0} dynamic-slice(param_1.197, select.13.55.clone.1), dynamic_slice_sizes={1}, metadata={op_name="jit(scan)/jit(main)/while/body/dynamic_slice[slice_sizes=(1,)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  bitcast.714.4.clone.1 = f64[] bitcast(dynamic-slice.6.2.clone.1)
  param_0.127 = f64[] parameter(0)
  multiply.70.3.clone.1 = f64[] multiply(bitcast.714.4.clone.1, param_0.127), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_prediction)/jit(predict_mean)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  add.35.1.clone.1 = f64[] add(multiply.69.1.clone.1, multiply.70.3.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_prediction)/jit(predict_mean)/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  negate.5.1.clone.1 = f64[] negate(add.35.1.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(binary_state_node_prediction)/neg" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  exponential.14.1.clone.1 = f64[] exponential(negate.5.1.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(binary_state_node_prediction)/exp" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  add.36.1.clone.1 = f64[] add(exponential.14.1.clone.1, constant_38_2), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(binary_state_node_prediction)/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  divide.37.1.clone.1 = f64[] divide(constant_38_2, add.36.1.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(binary_state_node_prediction)/div" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  subtract.11.1 = f64[] subtract(constant_38_2, divide.37.1.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(binary_state_node_prediction)/sub" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  multiply.71.1 = f64[] multiply(divide.37.1.clone.1, subtract.11.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(binary_state_node_prediction)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  param_5.44 = f64[] parameter(5)
  exponential.15.3.clone.1 = f64[] exponential(param_5.44), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_prediction)/jit(predict_precision)/exp" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  multiply.73.5.clone.1 = f64[] multiply(bitcast.714.4.clone.1, exponential.15.3.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_prediction)/jit(predict_precision)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  constant_39_1_clone_1_clone_1 = f64[] constant(1e-128)
  compare.20.3.clone.1 = pred[] compare(multiply.73.5.clone.1, constant_39_1_clone_1_clone_1), direction=GT, metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_prediction)/jit(predict_precision)/gt" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  constant_40_1_clone_1_clone_1 = f64[] constant(nan)
  select.14.3.clone.1 = f64[] select(compare.20.3.clone.1, multiply.73.5.clone.1, constant_40_1_clone_1_clone_1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_prediction)/jit(predict_precision)/jit(_where)/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  param_6.28 = f64[] parameter(6)
  divide.39.1.clone.1.clone.1 = f64[] divide(constant_38_2, param_6.28), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_prediction)/jit(predict_precision)/div" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  add.37.1.clone.1.clone.1 = f64[] add(divide.39.1.clone.1.clone.1, select.14.3.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_prediction)/jit(predict_precision)/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  divide.40.1.clone.1.clone.1 = f64[] divide(constant_38_2, add.37.1.clone.1.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_prediction)/jit(predict_precision)/div" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  multiply.77.1.clone.1 = f64[] multiply(select.14.3.clone.1, divide.40.1.clone.1.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_prediction)/jit(predict_precision)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  ROOT tuple.42 = (f64[], f64[], f64[], f64[], f64[], /*index=5*/f64[], f64[1]{0}) tuple(multiply.71.1, divide.37.1.clone.1, add.35.1.clone.1, multiply.77.1.clone.1, divide.40.1.clone.1.clone.1, /*index=5*/divide.39.1.clone.1.clone.1, dynamic-slice.6.2.clone.1)
} // fused_add_divide_dynamic_slice_multiply

fused_convert_dynamic_slice {
  param_0.87 = s64[192]{0} parameter(0)
  param_1.136 = s64[] parameter(1)
  constant_37_10 = s64[] constant(0)
  compare.19.11 = pred[] compare(param_1.136, constant_37_10), direction=LT, metadata={op_name="jit(scan)/jit(main)/while/body/lt" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  constant_36_6 = s64[] constant(192)
  add.34.11 = s64[] add(param_1.136, constant_36_6), metadata={op_name="jit(scan)/jit(main)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  select.13.11 = s64[] select(compare.19.11, add.34.11, param_1.136), metadata={op_name="jit(scan)/jit(main)/while/body/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  dynamic-slice.8.8 = s64[1]{0} dynamic-slice(param_0.87, select.13.11), dynamic_slice_sizes={1}, metadata={op_name="jit(scan)/jit(main)/while/body/dynamic_slice[slice_sizes=(1,)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  constant_41_1_clone_1 = s64[1]{0} constant({0})
  compare.21.1.clone.1 = pred[1]{0} compare(dynamic-slice.8.8, constant_41_1_clone_1), direction=NE, metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/convert_element_type[new_dtype=bool weak_type=False sharding=None]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  bitcast.710.1.clone.1 = pred[] bitcast(compare.21.1.clone.1)
  convert.23.1.clone.1 = s32[] convert(bitcast.710.1.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/convert_element_type[new_dtype=int32 weak_type=False sharding=None]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  ROOT tuple.35 = (s64[1]{0}, s32[]) tuple(dynamic-slice.8.8, convert.23.1.clone.1)
} // fused_convert_dynamic_slice

wrapped_copy_computation.1 {
  param_0.166 = f64[] parameter(0)
  ROOT copy.223 = f64[] copy(param_0.166)
}

fused_add_divide_dynamic_slice {
  param_0.58 = f64[] parameter(0)
  param_3.24 = f64[1]{0} parameter(3)
  bitcast.701.7 = f64[] bitcast(param_3.24)
  param_2.70 = f64[] parameter(2)
  multiply.74.7 = f64[] multiply(bitcast.701.7, param_2.70), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_mean_continuous_node)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  param_1.88 = f64[] parameter(1)
  divide.41.5 = f64[] divide(multiply.74.7, param_1.88), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_mean_continuous_node)/div" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  param_7.20 = f64[192,1]{1,0} parameter(7)
  param_5.40 = s64[] parameter(5)
  constant_37_27 = s64[] constant(0)
  compare.19.53.clone.1 = pred[] compare(param_5.40, constant_37_27), direction=LT, metadata={op_name="jit(scan)/jit(main)/while/body/lt" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  constant_36_26 = s64[] constant(192)
  add.34.53.clone.1 = s64[] add(param_5.40, constant_36_26), metadata={op_name="jit(scan)/jit(main)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  select.13.53.clone.1 = s64[] select(compare.19.53.clone.1, add.34.53.clone.1, param_5.40), metadata={op_name="jit(scan)/jit(main)/while/body/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  dynamic-slice.7.2.clone.1 = f64[1,1]{1,0} dynamic-slice(param_7.20, select.13.53.clone.1, constant_37_27), dynamic_slice_sizes={1,1}, metadata={op_name="jit(scan)/jit(main)/while/body/dynamic_slice[slice_sizes=(1, 1)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  bitcast.650.5.clone.1 = f64[] bitcast(dynamic-slice.7.2.clone.1)
  param_6.24 = f64[] parameter(6)
  subtract.12.5.clone.1 = f64[] subtract(bitcast.650.5.clone.1, param_6.24), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(binary_state_node_prediction_error)/sub" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  param_4.98 = s64[192]{0} parameter(4)
  dynamic-slice.8.7.clone.1 = s64[1]{0} dynamic-slice(param_4.98, select.13.53.clone.1), dynamic_slice_sizes={1}, metadata={op_name="jit(scan)/jit(main)/while/body/dynamic_slice[slice_sizes=(1,)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  bitcast.722.5.clone.1 = s64[] bitcast(dynamic-slice.8.7.clone.1)
  convert.22.5.clone.1 = f64[] convert(bitcast.722.5.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(binary_state_node_prediction_error)/convert_element_type[new_dtype=float64 weak_type=False sharding=None]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  multiply.72.3.clone.1 = f64[] multiply(subtract.12.5.clone.1, convert.22.5.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(binary_state_node_prediction_error)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  divide.38.1.clone.1 = f64[] divide(multiply.72.3.clone.1, param_2.70), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(binary_state_node_prediction_error)/div" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  multiply.75.1 = f64[] multiply(divide.38.1.clone.1, convert.22.5.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_mean_continuous_node)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  multiply.76.3 = f64[] multiply(divide.41.5, multiply.75.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_mean_continuous_node)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  add.38.1 = f64[] add(param_0.58, multiply.76.3), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_mean_continuous_node)/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  ROOT tuple.36 = (f64[], f64[], f64[1,1]{1,0}) tuple(add.38.1, divide.38.1.clone.1, dynamic-slice.7.2.clone.1)
} // fused_add_divide_dynamic_slice

fused_dynamic_update_slice.9 {
  param_0.23 = f64[192]{0} parameter(0)
  param_1.160 = f64[] parameter(1)
  bitcast.840.1 = f64[1]{0} bitcast(param_1.160)
  param_2.148 = s64[] parameter(2)
  constant_37_19 = s64[] constant(0)
  compare.19.35 = pred[] compare(param_2.148, constant_37_19), direction=LT, metadata={op_name="jit(scan)/jit(main)/while/body/lt" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  constant_36_18 = s64[] constant(192)
  add.34.35 = s64[] add(param_2.148, constant_36_18), metadata={op_name="jit(scan)/jit(main)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  select.13.35 = s64[] select(compare.19.35, add.34.35, param_2.148), metadata={op_name="jit(scan)/jit(main)/while/body/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  ROOT dynamic-update-slice.51.1 = f64[192]{0} dynamic-update-slice(param_0.23, bitcast.840.1, select.13.35), metadata={op_name="jit(scan)/jit(main)/while/body/dynamic_update_slice" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
} // fused_dynamic_update_slice.9

fused_dynamic_update_slice.14 {
  param_0.28 = f64[192]{0} parameter(0)
  param_1.150 = f64[] parameter(1)
  bitcast.793.1 = f64[1]{0} bitcast(param_1.150)
  param_2.134 = s64[] parameter(2)
  constant_37_15 = s64[] constant(0)
  compare.19.25 = pred[] compare(param_2.134, constant_37_15), direction=LT, metadata={op_name="jit(scan)/jit(main)/while/body/lt" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  constant_36_13 = s64[] constant(192)
  add.34.25 = s64[] add(param_2.134, constant_36_13), metadata={op_name="jit(scan)/jit(main)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  select.13.25 = s64[] select(compare.19.25, add.34.25, param_2.134), metadata={op_name="jit(scan)/jit(main)/while/body/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  ROOT dynamic-update-slice.46.1 = f64[192]{0} dynamic-update-slice(param_0.28, bitcast.793.1, select.13.25), metadata={op_name="jit(scan)/jit(main)/while/body/dynamic_update_slice" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
} // fused_dynamic_update_slice.14

fused_dynamic_update_slice.7 {
  param_0.21 = f64[192]{0} parameter(0)
  param_1.164 = f64[] parameter(1)
  bitcast.858.1 = f64[1]{0} bitcast(param_1.164)
  param_2.154 = s64[] parameter(2)
  constant_37_21 = s64[] constant(0)
  compare.19.39 = pred[] compare(param_2.154, constant_37_21), direction=LT, metadata={op_name="jit(scan)/jit(main)/while/body/lt" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  constant_36_20 = s64[] constant(192)
  add.34.39 = s64[] add(param_2.154, constant_36_20), metadata={op_name="jit(scan)/jit(main)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  select.13.39 = s64[] select(compare.19.39, add.34.39, param_2.154), metadata={op_name="jit(scan)/jit(main)/while/body/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  ROOT dynamic-update-slice.53.1 = f64[192]{0} dynamic-update-slice(param_0.21, bitcast.858.1, select.13.39), metadata={op_name="jit(scan)/jit(main)/while/body/dynamic_update_slice" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
} // fused_dynamic_update_slice.7

fused_dynamic_update_slice.16 {
  param_0.30 = f64[192]{0} parameter(0)
  param_1.142 = f64[] parameter(1)
  bitcast.768.1 = f64[1]{0} bitcast(param_1.142)
  param_2.124 = s64[] parameter(2)
  constant_37_13 = s64[] constant(0)
  compare.19.17 = pred[] compare(param_2.124, constant_37_13), direction=LT, metadata={op_name="jit(scan)/jit(main)/while/body/lt" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  constant_36_9 = s64[] constant(192)
  add.34.17 = s64[] add(param_2.124, constant_36_9), metadata={op_name="jit(scan)/jit(main)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  select.13.17 = s64[] select(compare.19.17, add.34.17, param_2.124), metadata={op_name="jit(scan)/jit(main)/while/body/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  ROOT dynamic-update-slice.43.1 = f64[192]{0} dynamic-update-slice(param_0.30, bitcast.768.1, select.13.17), metadata={op_name="jit(scan)/jit(main)/while/body/dynamic_update_slice" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
} // fused_dynamic_update_slice.16

fused_dynamic_update_slice.17 {
  param_0.31 = f64[192]{0} parameter(0)
  param_1.140 = f64[] parameter(1)
  bitcast.759.1 = f64[1]{0} bitcast(param_1.140)
  param_2.121 = s64[] parameter(2)
  constant_37_12 = s64[] constant(0)
  compare.19.15 = pred[] compare(param_2.121, constant_37_12), direction=LT, metadata={op_name="jit(scan)/jit(main)/while/body/lt" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  constant_36_8 = s64[] constant(192)
  add.34.15 = s64[] add(param_2.121, constant_36_8), metadata={op_name="jit(scan)/jit(main)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  select.13.15 = s64[] select(compare.19.15, add.34.15, param_2.121), metadata={op_name="jit(scan)/jit(main)/while/body/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  ROOT dynamic-update-slice.42.1 = f64[192]{0} dynamic-update-slice(param_0.31, bitcast.759.1, select.13.15), metadata={op_name="jit(scan)/jit(main)/while/body/dynamic_update_slice" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
} // fused_dynamic_update_slice.17

fused_dynamic_update_slice.11 {
  param_0.25 = f64[192]{0} parameter(0)
  param_1.156 = f64[] parameter(1)
  bitcast.822.1 = f64[1]{0} bitcast(param_1.156)
  param_2.142 = s64[] parameter(2)
  constant_37_17 = s64[] constant(0)
  compare.19.31 = pred[] compare(param_2.142, constant_37_17), direction=LT, metadata={op_name="jit(scan)/jit(main)/while/body/lt" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  constant_36_16 = s64[] constant(192)
  add.34.31 = s64[] add(param_2.142, constant_36_16), metadata={op_name="jit(scan)/jit(main)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  select.13.31 = s64[] select(compare.19.31, add.34.31, param_2.142), metadata={op_name="jit(scan)/jit(main)/while/body/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  ROOT dynamic-update-slice.49.1 = f64[192]{0} dynamic-update-slice(param_0.25, bitcast.822.1, select.13.31), metadata={op_name="jit(scan)/jit(main)/while/body/dynamic_update_slice" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
} // fused_dynamic_update_slice.11

fused_dynamic_update_slice.5 {
  param_0.19 = f64[192]{0} parameter(0)
  param_1.168 = f64[] parameter(1)
  bitcast.876.1 = f64[1]{0} bitcast(param_1.168)
  param_2.160 = s64[] parameter(2)
  constant_37_23 = s64[] constant(0)
  compare.19.43 = pred[] compare(param_2.160, constant_37_23), direction=LT, metadata={op_name="jit(scan)/jit(main)/while/body/lt" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  constant_36_22 = s64[] constant(192)
  add.34.43 = s64[] add(param_2.160, constant_36_22), metadata={op_name="jit(scan)/jit(main)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  select.13.43 = s64[] select(compare.19.43, add.34.43, param_2.160), metadata={op_name="jit(scan)/jit(main)/while/body/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  ROOT dynamic-update-slice.55.1 = f64[192]{0} dynamic-update-slice(param_0.19, bitcast.876.1, select.13.43), metadata={op_name="jit(scan)/jit(main)/while/body/dynamic_update_slice" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
} // fused_dynamic_update_slice.5

fused_dynamic_update_slice.10 {
  param_0.24 = f64[192]{0} parameter(0)
  param_1.158 = f64[] parameter(1)
  bitcast.831.1 = f64[1]{0} bitcast(param_1.158)
  param_2.145 = s64[] parameter(2)
  constant_37_18 = s64[] constant(0)
  compare.19.33 = pred[] compare(param_2.145, constant_37_18), direction=LT, metadata={op_name="jit(scan)/jit(main)/while/body/lt" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  constant_36_17 = s64[] constant(192)
  add.34.33 = s64[] add(param_2.145, constant_36_17), metadata={op_name="jit(scan)/jit(main)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  select.13.33 = s64[] select(compare.19.33, add.34.33, param_2.145), metadata={op_name="jit(scan)/jit(main)/while/body/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  ROOT dynamic-update-slice.50.1 = f64[192]{0} dynamic-update-slice(param_0.24, bitcast.831.1, select.13.33), metadata={op_name="jit(scan)/jit(main)/while/body/dynamic_update_slice" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
} // fused_dynamic_update_slice.10

fused_dynamic_update_slice.6 {
  param_0.20 = f64[192]{0} parameter(0)
  param_1.166 = f64[] parameter(1)
  bitcast.867.1 = f64[1]{0} bitcast(param_1.166)
  param_2.157 = s64[] parameter(2)
  constant_37_22 = s64[] constant(0)
  compare.19.41 = pred[] compare(param_2.157, constant_37_22), direction=LT, metadata={op_name="jit(scan)/jit(main)/while/body/lt" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  constant_36_21 = s64[] constant(192)
  add.34.41 = s64[] add(param_2.157, constant_36_21), metadata={op_name="jit(scan)/jit(main)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  select.13.41 = s64[] select(compare.19.41, add.34.41, param_2.157), metadata={op_name="jit(scan)/jit(main)/while/body/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  ROOT dynamic-update-slice.54.1 = f64[192]{0} dynamic-update-slice(param_0.20, bitcast.867.1, select.13.41), metadata={op_name="jit(scan)/jit(main)/while/body/dynamic_update_slice" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
} // fused_dynamic_update_slice.6

fused_dynamic_update_slice {
  param_0.14 = f64[192,1]{1,0} parameter(0)
  param_1.180 = f64[1]{0} parameter(1)
  bitcast.921.1 = f64[1,1]{1,0} bitcast(param_1.180)
  param_2.177 = s64[] parameter(2)
  constant_37_1 = s64[] constant(0)
  compare.19.23 = pred[] compare(param_2.177, constant_37_1), direction=LT, metadata={op_name="jit(scan)/jit(main)/while/body/lt" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  constant_36_12 = s64[] constant(192)
  add.34.23 = s64[] add(param_2.177, constant_36_12), metadata={op_name="jit(scan)/jit(main)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  select.13.23 = s64[] select(compare.19.23, add.34.23, param_2.177), metadata={op_name="jit(scan)/jit(main)/while/body/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  ROOT dynamic-update-slice.60.1 = f64[192,1]{1,0} dynamic-update-slice(param_0.14, bitcast.921.1, select.13.23, constant_37_1), metadata={op_name="jit(scan)/jit(main)/while/body/dynamic_update_slice" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
} // fused_dynamic_update_slice

fused_dynamic_update_slice.1 {
  param_0.15 = f64[192]{0} parameter(0)
  param_1.125 = f64[] parameter(1)
  bitcast.912.1 = f64[1]{0} bitcast(param_1.125)
  param_2.103 = s64[] parameter(2)
  constant_37_8 = s64[] constant(0)
  compare.19.5 = pred[] compare(param_2.103, constant_37_8), direction=LT, metadata={op_name="jit(scan)/jit(main)/while/body/lt" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  constant_36_3 = s64[] constant(192)
  add.34.5 = s64[] add(param_2.103, constant_36_3), metadata={op_name="jit(scan)/jit(main)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  select.13.5 = s64[] select(compare.19.5, add.34.5, param_2.103), metadata={op_name="jit(scan)/jit(main)/while/body/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  ROOT dynamic-update-slice.59.1 = f64[192]{0} dynamic-update-slice(param_0.15, bitcast.912.1, select.13.5), metadata={op_name="jit(scan)/jit(main)/while/body/dynamic_update_slice" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
} // fused_dynamic_update_slice.1

fused_dynamic_update_slice.2 {
  param_0.16 = f64[192]{0} parameter(0)
  param_1.123 = f64[] parameter(1)
  bitcast.903.1 = f64[1]{0} bitcast(param_1.123)
  param_2.100 = s64[] parameter(2)
  constant_37_7 = s64[] constant(0)
  compare.19.3 = pred[] compare(param_2.100, constant_37_7), direction=LT, metadata={op_name="jit(scan)/jit(main)/while/body/lt" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  constant_36_2 = s64[] constant(192)
  add.34.3 = s64[] add(param_2.100, constant_36_2), metadata={op_name="jit(scan)/jit(main)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  select.13.3 = s64[] select(compare.19.3, add.34.3, param_2.100), metadata={op_name="jit(scan)/jit(main)/while/body/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  ROOT dynamic-update-slice.58.1 = f64[192]{0} dynamic-update-slice(param_0.16, bitcast.903.1, select.13.3), metadata={op_name="jit(scan)/jit(main)/while/body/dynamic_update_slice" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
} // fused_dynamic_update_slice.2

fused_dynamic_update_slice.3 {
  param_0.17 = f64[192]{0} parameter(0)
  param_1.172 = f64[] parameter(1)
  bitcast.894.1 = f64[1]{0} bitcast(param_1.172)
  param_2.166 = s64[] parameter(2)
  constant_37_25 = s64[] constant(0)
  compare.19.47 = pred[] compare(param_2.166, constant_37_25), direction=LT, metadata={op_name="jit(scan)/jit(main)/while/body/lt" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  constant_36_24 = s64[] constant(192)
  add.34.47 = s64[] add(param_2.166, constant_36_24), metadata={op_name="jit(scan)/jit(main)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  select.13.47 = s64[] select(compare.19.47, add.34.47, param_2.166), metadata={op_name="jit(scan)/jit(main)/while/body/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  ROOT dynamic-update-slice.57.1 = f64[192]{0} dynamic-update-slice(param_0.17, bitcast.894.1, select.13.47), metadata={op_name="jit(scan)/jit(main)/while/body/dynamic_update_slice" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
} // fused_dynamic_update_slice.3

fused_dynamic_update_slice.4 {
  param_0.18 = f64[192]{0} parameter(0)
  param_1.170 = f64[] parameter(1)
  bitcast.885.1 = f64[1]{0} bitcast(param_1.170)
  param_2.163 = s64[] parameter(2)
  constant_37_24 = s64[] constant(0)
  compare.19.45 = pred[] compare(param_2.163, constant_37_24), direction=LT, metadata={op_name="jit(scan)/jit(main)/while/body/lt" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  constant_36_23 = s64[] constant(192)
  add.34.45 = s64[] add(param_2.163, constant_36_23), metadata={op_name="jit(scan)/jit(main)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  select.13.45 = s64[] select(compare.19.45, add.34.45, param_2.163), metadata={op_name="jit(scan)/jit(main)/while/body/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  ROOT dynamic-update-slice.56.1 = f64[192]{0} dynamic-update-slice(param_0.18, bitcast.885.1, select.13.45), metadata={op_name="jit(scan)/jit(main)/while/body/dynamic_update_slice" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
} // fused_dynamic_update_slice.4

fused_dynamic_update_slice.8 {
  param_0.22 = s64[192]{0} parameter(0)
  param_1.162 = s64[] parameter(1)
  bitcast.849.1 = s64[1]{0} bitcast(param_1.162)
  param_2.151 = s64[] parameter(2)
  constant_37_20 = s64[] constant(0)
  compare.19.37 = pred[] compare(param_2.151, constant_37_20), direction=LT, metadata={op_name="jit(scan)/jit(main)/while/body/lt" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  constant_36_19 = s64[] constant(192)
  add.34.37 = s64[] add(param_2.151, constant_36_19), metadata={op_name="jit(scan)/jit(main)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  select.13.37 = s64[] select(compare.19.37, add.34.37, param_2.151), metadata={op_name="jit(scan)/jit(main)/while/body/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  ROOT dynamic-update-slice.52.1 = s64[192]{0} dynamic-update-slice(param_0.22, bitcast.849.1, select.13.37), metadata={op_name="jit(scan)/jit(main)/while/body/dynamic_update_slice" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
} // fused_dynamic_update_slice.8

fused_dynamic_update_slice.12 {
  param_0.26 = f64[192]{0} parameter(0)
  param_1.154 = f64[] parameter(1)
  bitcast.813.1 = f64[1]{0} bitcast(param_1.154)
  param_2.139 = s64[] parameter(2)
  constant_37_16 = s64[] constant(0)
  compare.19.29 = pred[] compare(param_2.139, constant_37_16), direction=LT, metadata={op_name="jit(scan)/jit(main)/while/body/lt" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  constant_36_15 = s64[] constant(192)
  add.34.29 = s64[] add(param_2.139, constant_36_15), metadata={op_name="jit(scan)/jit(main)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  select.13.29 = s64[] select(compare.19.29, add.34.29, param_2.139), metadata={op_name="jit(scan)/jit(main)/while/body/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  ROOT dynamic-update-slice.48.1 = f64[192]{0} dynamic-update-slice(param_0.26, bitcast.813.1, select.13.29), metadata={op_name="jit(scan)/jit(main)/while/body/dynamic_update_slice" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
} // fused_dynamic_update_slice.12

fused_dynamic_update_slice.13 {
  param_0.27 = f64[192,1]{1,0} parameter(0)
  param_1.181 = f64[1]{0} parameter(1)
  bitcast.802.1 = f64[1,1]{1,0} bitcast(param_1.181)
  param_2.178 = s64[] parameter(2)
  constant_37_3 = s64[] constant(0)
  compare.19.27 = pred[] compare(param_2.178, constant_37_3), direction=LT, metadata={op_name="jit(scan)/jit(main)/while/body/lt" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  constant_36_14 = s64[] constant(192)
  add.34.27 = s64[] add(param_2.178, constant_36_14), metadata={op_name="jit(scan)/jit(main)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  select.13.27 = s64[] select(compare.19.27, add.34.27, param_2.178), metadata={op_name="jit(scan)/jit(main)/while/body/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  ROOT dynamic-update-slice.47.1 = f64[192,1]{1,0} dynamic-update-slice(param_0.27, bitcast.802.1, select.13.27, constant_37_3), metadata={op_name="jit(scan)/jit(main)/while/body/dynamic_update_slice" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
} // fused_dynamic_update_slice.13

fused_dynamic_update_slice.18 {
  param_0.72 = s64[192]{0} parameter(0)
  param_1.146 = s64[192]{0} parameter(1)
  param_2.129 = s64[] parameter(2)
  constant_37_14 = s64[] constant(0)
  compare.19.21 = pred[] compare(param_2.129, constant_37_14), direction=LT, metadata={op_name="jit(scan)/jit(main)/while/body/lt" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  constant_36_11 = s64[] constant(192)
  add.34.21 = s64[] add(param_2.129, constant_36_11), metadata={op_name="jit(scan)/jit(main)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  select.13.21 = s64[] select(compare.19.21, add.34.21, param_2.129), metadata={op_name="jit(scan)/jit(main)/while/body/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  dynamic-slice.8.2 = s64[1]{0} dynamic-slice(param_1.146, select.13.21), dynamic_slice_sizes={1}, metadata={op_name="jit(scan)/jit(main)/while/body/dynamic_slice[slice_sizes=(1,)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  ROOT dynamic-update-slice.45.1 = s64[192]{0} dynamic-update-slice(param_0.72, dynamic-slice.8.2, select.13.21), metadata={op_name="jit(scan)/jit(main)/while/body/dynamic_update_slice" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
} // fused_dynamic_update_slice.18

fused_dynamic_update_slice.15 {
  param_0.29 = f64[192]{0} parameter(0)
  param_1.144 = f64[192,1]{1,0} parameter(1)
  param_2.179 = s64[] parameter(2)
  constant_37_5 = s64[] constant(0)
  compare.19.19 = pred[] compare(param_2.179, constant_37_5), direction=LT, metadata={op_name="jit(scan)/jit(main)/while/body/lt" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  constant_36_10 = s64[] constant(192)
  add.34.19 = s64[] add(param_2.179, constant_36_10), metadata={op_name="jit(scan)/jit(main)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  select.13.19 = s64[] select(compare.19.19, add.34.19, param_2.179), metadata={op_name="jit(scan)/jit(main)/while/body/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  dynamic-slice.7.1 = f64[1,1]{1,0} dynamic-slice(param_1.144, select.13.19, constant_37_5), dynamic_slice_sizes={1,1}, metadata={op_name="jit(scan)/jit(main)/while/body/dynamic_slice[slice_sizes=(1, 1)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  bitcast.777.1 = f64[1]{0} bitcast(dynamic-slice.7.1)
  ROOT dynamic-update-slice.44.1 = f64[192]{0} dynamic-update-slice(param_0.29, bitcast.777.1, select.13.19), metadata={op_name="jit(scan)/jit(main)/while/body/dynamic_update_slice" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
} // fused_dynamic_update_slice.15

fused_dynamic_update_slice.19 {
  param_0.74 = f64[192]{0} parameter(0)
  param_1.138 = f64[192]{0} parameter(1)
  param_2.118 = s64[] parameter(2)
  constant_37_11 = s64[] constant(0)
  compare.19.13 = pred[] compare(param_2.118, constant_37_11), direction=LT, metadata={op_name="jit(scan)/jit(main)/while/body/lt" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  constant_36_7 = s64[] constant(192)
  add.34.13 = s64[] add(param_2.118, constant_36_7), metadata={op_name="jit(scan)/jit(main)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
