HloModule jit_scan, is_scheduled=true, entry_computation_layout={(f64[2,4]{1,0}, f64[2,4]{1,0}, f64[2,4]{1,0}, f64[2,4]{1,0}, f64[2,4]{1,0}, /*index=5*/f64[2,4]{1,0}, f64[2]{0}, f64[2,4]{1,0}, f64[2,4]{1,0}, f64[2,4]{1,0}, /*index=10*/f64[2,4]{1,0}, f64[2,4]{1,0}, f64[2,4]{1,0}, u32[10,2]{1,0})->(f64[2,4]{1,0}, f64[2,4]{1,0}, f64[2,4]{1,0}, f64[2,4]{1,0}, f64[2,4]{1,0}, /*index=5*/f64[2,4]{1,0}, f64[2]{0}, f64[2,4]{1,0}, f64[2,4]{1,0}, f64[2,4]{1,0}, /*index=10*/f64[2,4]{1,0}, f64[2,4]{1,0}, f64[2,4]{1,0}, f64[10,2,4]{2,1,0}, f64[10,2,4]{2,1,0}, /*index=15*/f64[10,2,4]{2,1,0}, f64[10,2,4]{2,1,0}, f64[10,2,4]{2,1,0}, f64[10,2,4]{2,1,0}, f64[10,2]{1,0}, /*index=20*/f64[10,2,4]{2,1,0}, f64[10,2,4]{2,1,0}, f64[10,2,4]{2,1,0}, f64[10,2,4]{2,1,0}, f64[10,2,4]{2,1,0}, /*index=25*/f64[10,2,4]{2,1,0}, f64[10,2,4]{2,1,0}, f64[10,2,4]{2,1,0}, f64[10,2,4]{2,1,0}, f64[10,2,4]{2,1,0}, /*index=30*/f64[10,2,4]{2,1,0}, f64[10,2,4]{2,1,0}, pred[10,2]{1,0}, pred[10,2]{1,0}, f64[10,2]{1,0}, /*index=35*/f64[10,2,4]{2,1,0}, f64[10,2,4]{2,1,0}, f64[10,2,4]{2,1,0}, f64[10,2,4]{2,1,0}, f64[10,2,4]{2,1,0}, /*index=40*/f64[10,2,4]{2,1,0}, f64[10,2,4]{2,1,0}, f64[10,2,4]{2,1,0}, f64[10,2,4]{2,1,0}, f64[10,2,4]{2,1,0}, /*index=45*/f64[10,2,4]{2,1,0}, f64[10,2,4]{2,1,0}, f64[10,2]{1,0}, f64[10,2,4]{2,1,0}, f64[10,2,4]{2,1,0}, /*index=50*/f64[10,2,4]{2,1,0}, f64[10,2,4]{2,1,0}, f64[10,2,4]{2,1,0}, f64[10,2,4]{2,1,0}, f64[10,2,4]{2,1,0}, /*index=55*/f64[10,2,4]{2,1,0}, f64[10,2,4]{2,1,0}, f64[10,2,4]{2,1,0}, f64[10,2,4]{2,1,0}, f64[10,2,4]{2,1,0}, /*index=60*/f64[10,2,4]{2,1,0}, f64[10,2,4]{2,1,0}, f64[10,2,4]{2,1,0}, f64[10,2,4]{2,1,0}, f64[10,2,4]{2,1,0}, /*index=65*/f64[10,2,4]{2,1,0}, f64[10,2]{1,0}, f64[10,2,4]{2,1,0}, f64[10,2,4]{2,1,0}, f64[10,2,4]{2,1,0}, /*index=70*/f64[10,2,4]{2,1,0}, f64[10,2,4]{2,1,0}, f64[10,2,4]{2,1,0}, s64[10,2]{1,0}, s64[10,2]{1,0}, /*index=75*/f64[10,2]{1,0})}, allow_spmd_sharding_propagation_to_parameters={true,true,true,true,true,true,true,true,true,true,true,true,true,true}, allow_spmd_sharding_propagation_to_output={true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true}, frontend_attributes={fingerprint_before_lhs="dc68c74cfa1d076db0b2be38fc11e816"}

fused_multiply {
  param_0.37 = f64[2,10,24]{2,1,0} parameter(0)
  iota.42.6 = s32[2,1]{1,0} iota(), iota_dimension=0, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body/iota[dtype=int32 shape=(2, 1) dimension=0]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  param_1.60 = s32[2]{0} parameter(1)
  constant_6918_1 = s32[] constant(0)
  broadcast.4011.6 = s32[2]{0} broadcast(constant_6918_1), dimensions={}
  compare.1127.6 = pred[2]{0} compare(param_1.60, broadcast.4011.6), direction=LT, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body/lt" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  constant_6920_1 = s32[] constant(10)
  broadcast.4012.6 = s32[2]{0} broadcast(constant_6920_1), dimensions={}
  add.3971.6 = s32[2]{0} add(param_1.60, broadcast.4012.6), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  select.2970.6 = s32[2]{0} select(compare.1127.6, add.3971.6, param_1.60), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  bitcast.10507.13 = s32[2,1]{1,0} bitcast(select.2970.6)
  broadcast.4013.6 = s32[2,1]{1,0} broadcast(constant_6918_1), dimensions={}
  concatenate.36.13 = s32[2,3]{1,0} concatenate(iota.42.6, bitcast.10507.13, broadcast.4013.6), dimensions={1}, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body/concatenate[dimension=1]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  gather.3.5 = f64[2,1,1,24]{3,0,2,1} gather(param_0.37, concatenate.36.13), offset_dims={1,2,3}, collapsed_slice_dims={}, start_index_map={0,1,2}, index_vector_dim=1, slice_sizes={1,1,24}, indices_are_sorted=true, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body/gather[dimension_numbers=GatherDimensionNumbers(offset_dims=(np.int64(1), np.int64(2)), collapsed_slice_dims=(0,), start_index_map=(0, np.int64(1), np.int64(2))) slice_sizes=(1, 1, 24) unique_indices=True indices_are_sorted=True mode=GatherScatterMode.PROMISE_IN_BOUNDS fill_value=None]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  bitcast.10535.1 = f64[2,24]{1,0} bitcast(gather.3.5)
  param_3.43 = f64[2,24]{1,0} parameter(3)
  param_4.36 = f64[2,10,24]{2,1,0} parameter(4)
  gather.4.9 = f64[2,1,1,24]{3,0,2,1} gather(param_4.36, concatenate.36.13), offset_dims={1,2,3}, collapsed_slice_dims={}, start_index_map={0,1,2}, index_vector_dim=1, slice_sizes={1,1,24}, indices_are_sorted=true, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body/gather[dimension_numbers=GatherDimensionNumbers(offset_dims=(np.int64(1), np.int64(2)), collapsed_slice_dims=(0,), start_index_map=(0, np.int64(1), np.int64(2))) slice_sizes=(1, 1, 24) unique_indices=True indices_are_sorted=True mode=GatherScatterMode.PROMISE_IN_BOUNDS fill_value=None]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  bitcast.10525.7 = f64[2,24]{1,0} bitcast(gather.4.9)
  subtract.218.7 = f64[2,24]{1,0} subtract(param_3.43, bitcast.10525.7), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body/sub" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  add.3972.7 = f64[2,24]{1,0} add(subtract.218.7, bitcast.10535.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  param_2.50 = f64[2,24]{1,0} parameter(2)
  add.3973.7 = f64[2,24]{1,0} add(param_2.50, bitcast.10535.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  constant_1117_1 = f64[] constant(0.5)
  broadcast.4014.7 = f64[2,24]{1,0} broadcast(constant_1117_1), dimensions={}
  multiply.2886.7 = f64[2,24]{1,0} multiply(add.3973.7, broadcast.4014.7), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body/div" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  subtract.219.5 = f64[2,24]{1,0} subtract(add.3972.7, multiply.2886.7), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body/sub" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  multiply.2887.1 = f64[2,24]{1,0} multiply(bitcast.10535.1, subtract.219.5)
  multiply.2888.1.clone.1 = f64[2,24]{1,0} multiply(param_2.50, subtract.219.5)
  ROOT tuple.478 = (f64[2,24]{1,0}, f64[2,24]{1,0}) tuple(multiply.2887.1, multiply.2888.1.clone.1)
} // fused_multiply

scalar_add_computation {
  scalar_rhs = f64[] parameter(1)
  scalar_lhs = f64[] parameter(0)
  ROOT add.3969 = f64[] add(scalar_lhs, scalar_rhs)
}

fused_compare {
  param_0.38 = f64[2,24]{1,0} parameter(0)
  constant_6912_2 = f64[] constant(0)
  reduce.13.1 = f64[2]{0} reduce(param_0.38, constant_6912_2), dimensions={1}, to_apply=scalar_add_computation, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body/dot_general[dimension_numbers=(((1,), (1,)), ((0,), (0,))) precision=None preferred_element_type=float64]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  broadcast.4015.clone.2 = f64[2]{0} broadcast(constant_6912_2), dimensions={}
  ROOT compare.1128.1 = pred[2]{0} compare(reduce.13.1, broadcast.4015.clone.2), direction=LE, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body/le" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
}

fused_select {
  param_3.39 = s32[2]{0} parameter(3)
  param_4.31 = s32[2]{0} parameter(4)
  compare.1126.2 = pred[2]{0} compare(param_3.39, param_4.31), direction=GE, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body_pred/ge" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  param_0.30 = pred[2]{0} parameter(0)
  not.20.2 = pred[2]{0} not(param_0.30), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body_pred/not" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  and.64.1 = pred[2]{0} and(compare.1126.2, not.20.2), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body_pred/and" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  param_1.48 = pred[2]{0} parameter(1)
  param_2.47 = f64[2,24]{1,0} parameter(2)
  constant_6912_1 = f64[] constant(0)
  reduce.14.5 = f64[2]{0} reduce(param_2.47, constant_6912_1), dimensions={1}, to_apply=scalar_add_computation, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body/dot_general[dimension_numbers=(((1,), (1,)), ((0,), (0,))) precision=None preferred_element_type=float64]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  broadcast.4015.clone.7 = f64[2]{0} broadcast(constant_6912_1), dimensions={}
  compare.1129.5 = pred[2]{0} compare(reduce.14.5, broadcast.4015.clone.7), direction=LE, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body/le" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  or.801.3 = pred[2]{0} or(param_1.48, compare.1129.5), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body/or" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  select.2971.1 = pred[2]{0} select(and.64.1, or.801.3, param_0.30), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while[cond_nconsts=1 body_nconsts=5]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  constant_1334_1_clone_1 = s32[] constant(-1)
  broadcast.4010.3.clone.1 = s32[2]{0} broadcast(constant_1334_1_clone_1), dimensions={}
  add.3970.3.clone.1 = s32[2]{0} add(param_3.39, broadcast.4010.3.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body/sub" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  select.2969.1.clone.1 = s32[2]{0} select(and.64.1, add.3970.3.clone.1, param_3.39), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while[cond_nconsts=1 body_nconsts=5]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  ROOT tuple.479 = (pred[2]{0}, s32[2]{0}) tuple(select.2971.1, select.2969.1.clone.1)
} // fused_select

region_35.6903 {
  arg_tuple.6904.0 = (s32[2]{0}, pred[2]{0}, s32[2]{0}, f64[2,10,24]{2,1,0}, f64[2,24]{1,0}, /*index=5*/f64[2,10,24]{2,1,0}, f64[2,24]{1,0}) parameter(0)
  get-tuple-element.16408 = s32[2]{0} get-tuple-element(arg_tuple.6904.0), index=0
  get-tuple-element.16417 = s32[2]{0} get-tuple-element(arg_tuple.6904.0), index=2
  get-tuple-element.16418 = f64[2,10,24]{2,1,0} get-tuple-element(arg_tuple.6904.0), index=3
  get-tuple-element.16419 = f64[2,24]{1,0} get-tuple-element(arg_tuple.6904.0), index=4
  get-tuple-element.16420 = f64[2,10,24]{2,1,0} get-tuple-element(arg_tuple.6904.0), index=5
  get-tuple-element.16421 = f64[2,24]{1,0} get-tuple-element(arg_tuple.6904.0), index=6
  get-tuple-element.16409 = pred[2]{0} get-tuple-element(arg_tuple.6904.0), index=1
  loop_multiply_fusion = (f64[2,24]{1,0}, f64[2,24]{1,0}) fusion(get-tuple-element.16420, get-tuple-element.16408, get-tuple-element.16421, get-tuple-element.16419, get-tuple-element.16418), kind=kLoop, calls=fused_multiply
  get-tuple-element.15649 = f64[2,24]{1,0} get-tuple-element(loop_multiply_fusion), index=1
  get-tuple-element.15648 = f64[2,24]{1,0} get-tuple-element(loop_multiply_fusion), index=0
  loop_compare_fusion = pred[2]{0} fusion(get-tuple-element.15648), kind=kLoop, calls=fused_compare, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body/le" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147 deduplicated_name="loop_compare_fusion"}
  loop_select_fusion = (pred[2]{0}, s32[2]{0}) fusion(get-tuple-element.16409, loop_compare_fusion, get-tuple-element.15649, get-tuple-element.16408, get-tuple-element.16417), kind=kLoop, calls=fused_select, control-predecessors={loop_multiply_fusion}, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while[cond_nconsts=1 body_nconsts=5]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  get-tuple-element.16415 = s32[2]{0} get-tuple-element(loop_select_fusion), index=1, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while[cond_nconsts=1 body_nconsts=5]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  get-tuple-element.16416 = pred[2]{0} get-tuple-element(loop_select_fusion), index=0, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while[cond_nconsts=1 body_nconsts=5]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  ROOT tuple.747 = (s32[2]{0}, pred[2]{0}, s32[2]{0}, f64[2,10,24]{2,1,0}, f64[2,24]{1,0}, /*index=5*/f64[2,10,24]{2,1,0}, f64[2,24]{1,0}) tuple(get-tuple-element.16415, get-tuple-element.16416, get-tuple-element.16417, get-tuple-element.16418, get-tuple-element.16419, /*index=5*/get-tuple-element.16420, get-tuple-element.16421)
} // region_35.6903

region_37.6968 {
  Arg_1.6970 = pred[] parameter(1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while[cond_nconsts=1 body_nconsts=5]"}
  Arg_0.6969 = pred[] parameter(0), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while[cond_nconsts=1 body_nconsts=5]"}
  ROOT or.802 = pred[] or(Arg_0.6969, Arg_1.6970), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while[cond_nconsts=1 body_nconsts=5]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
}

fused_reduce {
  param_1.66 = s32[2]{0} parameter(1)
  param_2.56 = s32[2]{0} parameter(2)
  compare.1130.1 = pred[2]{0} compare(param_1.66, param_2.56), direction=GE, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/cond/ge" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  param_0.41 = pred[2]{0} parameter(0)
  not.21.1 = pred[2]{0} not(param_0.41), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/cond/not" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  and.65.1 = pred[2]{0} and(compare.1130.1, not.21.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/cond/and" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  constant_6981_1 = pred[] constant(false)
  ROOT reduce.6985.1 = pred[] reduce(and.65.1, constant_6981_1), dimensions={0}, to_apply=region_37.6968, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while[cond_nconsts=1 body_nconsts=5]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
} // fused_reduce

region_36.6972 {
  arg_tuple.6973.0 = (s32[2]{0}, pred[2]{0}, s32[2]{0}, f64[2,10,24]{2,1,0}, f64[2,24]{1,0}, /*index=5*/f64[2,10,24]{2,1,0}, f64[2,24]{1,0}) parameter(0)
  get-tuple-element.6974.0 = s32[2]{0} get-tuple-element(arg_tuple.6973.0), index=0
  get-tuple-element.6976.0 = s32[2]{0} get-tuple-element(arg_tuple.6973.0), index=2
  get-tuple-element.6975.0 = pred[2]{0} get-tuple-element(arg_tuple.6973.0), index=1
  ROOT input_reduce_fusion = pred[] fusion(get-tuple-element.6975.0, get-tuple-element.6974.0, get-tuple-element.6976.0), kind=kInput, calls=fused_reduce, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while[cond_nconsts=1 body_nconsts=5]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
}

fused_broadcast.2 {
  constant_1429_3 = f64[] constant(0)
  ROOT broadcast.4019.1 = f64[4,1]{1,0} broadcast(constant_1429_3), dimensions={}
}

fused_broadcast.1 {
  constant_1429_2 = f64[] constant(0)
  ROOT broadcast.4016.1 = f64[4]{0} broadcast(constant_1429_2), dimensions={}
}

fused_broadcast {
  constant_1429_1 = f64[] constant(0)
  ROOT broadcast.4017.1 = f64[2,4]{1,0} broadcast(constant_1429_1), dimensions={}
}

wrapped_copy_computation.178 {
  param_0.5589 = f64[2,4]{1,0} parameter(0)
  ROOT copy.1367 = f64[2,4]{1,0} copy(param_0.5589)
}

fused_multiply_negate {
  param_0.5326 = f64[2,4]{1,0} parameter(0)
  param_4.3519 = f64[] parameter(4)
  broadcast.4018.1.clone.1 = f64[2,4]{1,0} broadcast(param_4.3519), dimensions={}, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  param_2.5791 = f64[2,4]{1,0} parameter(2)
  param_3.4691 = f64[2,4]{1,0} parameter(3)
  multiply.2889.3.clone.1 = f64[2,4]{1,0} multiply(param_2.5791, param_3.4691), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  negate.466.3.clone.1 = f64[2,4]{1,0} negate(multiply.2889.3.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/neg" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  multiply.2891.1.clone.1 = f64[2,4]{1,0} multiply(broadcast.4018.1.clone.1, negate.466.3.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  param_1.7522 = f64[2,4]{1,0} parameter(1)
  multiply.2892.1.clone.1 = f64[2,4]{1,0} multiply(multiply.2891.1.clone.1, param_1.7522), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  multiply.2893.1 = f64[2,4]{1,0} multiply(param_0.5326, multiply.2892.1.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  param_5.2795 = f64[2,4]{1,0} parameter(5)
  multiply.2890.1.clone.1 = f64[2,4]{1,0} multiply(negate.466.3.clone.1, param_5.2795), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  negate.467.1.clone.1 = f64[2,4]{1,0} negate(multiply.2890.1.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/neg" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  ROOT tuple.481 = (f64[2,4]{1,0}, f64[2,4]{1,0}, f64[2,4]{1,0}) tuple(multiply.2893.1, multiply.2892.1.clone.1, negate.467.1.clone.1)
} // fused_multiply_negate

command_buffer.22 {
  p.940 = f64[2,4]{1,0} parameter(0)
  p.941 = f64[2,4]{1,0} parameter(1)
  p.942 = f64[2,4]{1,0} parameter(2)
  p.943 = f64[2,4]{1,0} parameter(3)
  p.944 = f64[] parameter(4)
  p.945 = f64[2,4]{1,0} parameter(5)
  loop_broadcast_fusion.2 = f64[4,1]{1,0} fusion(), kind=kLoop, calls=fused_broadcast.2
  loop_broadcast_fusion.1 = f64[4]{0} fusion(), kind=kLoop, calls=fused_broadcast.1
  loop_broadcast_fusion = f64[2,4]{1,0} fusion(), kind=kLoop, calls=fused_broadcast
  wrapped_copy.178 = f64[2,4]{1,0} fusion(loop_broadcast_fusion), kind=kLoop, calls=wrapped_copy_computation.178
  loop_multiply_negate_fusion = (f64[2,4]{1,0}, f64[2,4]{1,0}, f64[2,4]{1,0}) fusion(p.940, p.941, p.942, p.943, p.944, /*index=5*/p.945), kind=kLoop, calls=fused_multiply_negate, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  ROOT tuple.784 = (f64[4,1]{1,0}, f64[4]{0}, f64[2,4]{1,0}, f64[2,4]{1,0}, (f64[2,4]{1,0}, f64[2,4]{1,0}, f64[2,4]{1,0})) tuple(loop_broadcast_fusion.2, loop_broadcast_fusion.1, loop_broadcast_fusion, wrapped_copy.178, loop_multiply_negate_fusion)
} // command_buffer.22

region_29.5206.clone {
  arg_tuple.6.0 = (f64[2,4]{1,0}, f64[], f64[2,4]{1,0}, f64[2,4]{1,0}, f64[2,4]{1,0}, /*index=5*/f64[2,4]{1,0}) parameter(0)
  get-tuple-element.2425.0 = f64[] get-tuple-element(arg_tuple.6.0), index=1
  get-tuple-element.2429.0 = f64[2,4]{1,0} get-tuple-element(arg_tuple.6.0), index=5
  get-tuple-element.2428.0 = f64[2,4]{1,0} get-tuple-element(arg_tuple.6.0), index=4
  get-tuple-element.2427.0 = f64[2,4]{1,0} get-tuple-element(arg_tuple.6.0), index=3
  get-tuple-element.2426.0 = f64[2,4]{1,0} get-tuple-element(arg_tuple.6.0), index=2
  get-tuple-element.2424.0 = f64[2,4]{1,0} get-tuple-element(arg_tuple.6.0), index=0
  call.12 = (f64[4,1]{1,0}, f64[4]{0}, f64[2,4]{1,0}, f64[2,4]{1,0}, (f64[2,4]{1,0}, f64[2,4]{1,0}, f64[2,4]{1,0})) call(get-tuple-element.2426.0, get-tuple-element.2427.0, get-tuple-element.2429.0, get-tuple-element.2428.0, get-tuple-element.2425.0, /*index=5*/get-tuple-element.2424.0), to_apply=command_buffer.22
  get-tuple-element.18039 = f64[4,1]{1,0} get-tuple-element(call.12), index=0
  get-tuple-element.18040 = f64[4]{0} get-tuple-element(call.12), index=1
  get-tuple-element.18041 = f64[2,4]{1,0} get-tuple-element(call.12), index=2
  get-tuple-element.18042 = f64[2,4]{1,0} get-tuple-element(call.12), index=3
  get-tuple-element.18043 = (f64[2,4]{1,0}, f64[2,4]{1,0}, f64[2,4]{1,0}) get-tuple-element(call.12), index=4
  get-tuple-element.15961 = f64[2,4]{1,0} get-tuple-element(get-tuple-element.18043), index=2, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  get-tuple-element.15962 = f64[2,4]{1,0} get-tuple-element(get-tuple-element.18043), index=1, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  get-tuple-element.15963 = f64[2,4]{1,0} get-tuple-element(get-tuple-element.18043), index=0, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  ROOT tuple.737 = (f64[4]{0}, f64[2,4]{1,0}, f64[2,4]{1,0}, f64[2,4]{1,0}, f64[2,4]{1,0}, /*index=5*/f64[2,4]{1,0}, f64[4,1]{1,0}) tuple(get-tuple-element.18040, get-tuple-element.18041, get-tuple-element.18042, get-tuple-element.15961, get-tuple-element.15962, /*index=5*/get-tuple-element.15963, get-tuple-element.18039)
} // region_29.5206.clone

fused_broadcast.4 {
  constant_1436_3 = f64[] constant(0)
  ROOT broadcast.4023.1 = f64[4,1]{1,0} broadcast(constant_1436_3), dimensions={}
}

fused_broadcast.3 {
  constant_1436_2 = f64[] constant(0)
  ROOT broadcast.4020.1 = f64[4]{0} broadcast(constant_1436_2), dimensions={}
}

fused_broadcast_multiply_select {
  param_0.54 = f64[2,4]{1,0} parameter(0)
  param_2.5792 = pred[2,4]{1,0} parameter(2)
  param_3.4692 = f64[2,4]{1,0} parameter(3)
  constant_1436_1_clone_1 = f64[] constant(0)
  broadcast.4021.clone.2.1.clone.1 = f64[2,4]{1,0} broadcast(constant_1436_1_clone_1), dimensions={}
  select.2972.1 = f64[2,4]{1,0} select(param_2.5792, param_3.4692, broadcast.4021.clone.2.1.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_1_fun/jit(precision_update)/jit(_where)/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  param_1.7523 = f64[] parameter(1)
  broadcast.4022.1 = f64[2,4]{1,0} broadcast(param_1.7523), dimensions={}, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_1_fun/jit(precision_update)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  multiply.2894.1 = f64[2,4]{1,0} multiply(select.2972.1, broadcast.4022.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_1_fun/jit(precision_update)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  multiply.2895.1 = f64[2,4]{1,0} multiply(param_0.54, multiply.2894.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_1_fun/jit(precision_update)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  ROOT tuple.483 = (f64[2,4]{1,0}, f64[2,4]{1,0}, f64[2,4]{1,0}) tuple(multiply.2895.1, select.2972.1, broadcast.4021.clone.2.1.clone.1)
} // fused_broadcast_multiply_select

wrapped_copy_computation.179 {
  param_0.5590 = f64[2,4]{1,0} parameter(0)
  ROOT copy.1368 = f64[2,4]{1,0} copy(param_0.5590)
}

wrapped_copy_computation.180 {
  param_0.5591 = f64[2,4]{1,0} parameter(0)
  ROOT copy.1369 = f64[2,4]{1,0} copy(param_0.5591)
}

command_buffer.20 {
  p.932 = f64[2,4]{1,0} parameter(0)
  p.933 = f64[] parameter(1)
  p.934 = pred[2,4]{1,0} parameter(2)
  p.935 = f64[2,4]{1,0} parameter(3)
  loop_broadcast_fusion.4 = f64[4,1]{1,0} fusion(), kind=kLoop, calls=fused_broadcast.4
  loop_broadcast_fusion.3 = f64[4]{0} fusion(), kind=kLoop, calls=fused_broadcast.3
  loop_broadcast_multiply_select_fusion = (f64[2,4]{1,0}, f64[2,4]{1,0}, f64[2,4]{1,0}) fusion(p.932, p.933, p.934, p.935), kind=kLoop, calls=fused_broadcast_multiply_select, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_1_fun/jit(precision_update)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  get-tuple-element.15970 = f64[2,4]{1,0} get-tuple-element(loop_broadcast_multiply_select_fusion), index=2, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_1_fun/jit(precision_update)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  get-tuple-element.15967 = f64[2,4]{1,0} get-tuple-element(loop_broadcast_multiply_select_fusion), index=1, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_1_fun/jit(precision_update)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  get-tuple-element.15966 = f64[2,4]{1,0} get-tuple-element(loop_broadcast_multiply_select_fusion), index=0, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_1_fun/jit(precision_update)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  wrapped_copy.179 = f64[2,4]{1,0} fusion(get-tuple-element.15970), kind=kLoop, calls=wrapped_copy_computation.179
  wrapped_copy.180 = f64[2,4]{1,0} fusion(get-tuple-element.15970), kind=kLoop, calls=wrapped_copy_computation.180
  ROOT tuple.782 = (f64[4,1]{1,0}, f64[4]{0}, f64[2,4]{1,0}, f64[2,4]{1,0}, f64[2,4]{1,0}, /*index=5*/f64[2,4]{1,0}, f64[2,4]{1,0}) tuple(loop_broadcast_fusion.4, loop_broadcast_fusion.3, get-tuple-element.15970, get-tuple-element.15967, get-tuple-element.15966, /*index=5*/wrapped_copy.179, wrapped_copy.180)
} // command_buffer.20

region_30.5243.clone.clone {
  arg_tuple.8.0 = (f64[2,4]{1,0}, f64[], pred[2,4]{1,0}, f64[2,4]{1,0}) parameter(0)
  get-tuple-element.2449.0 = f64[] get-tuple-element(arg_tuple.8.0), index=1
  get-tuple-element.2451.0 = f64[2,4]{1,0} get-tuple-element(arg_tuple.8.0), index=3
  get-tuple-element.2450.0 = pred[2,4]{1,0} get-tuple-element(arg_tuple.8.0), index=2
  get-tuple-element.2448.0 = f64[2,4]{1,0} get-tuple-element(arg_tuple.8.0), index=0
  call.11 = (f64[4,1]{1,0}, f64[4]{0}, f64[2,4]{1,0}, f64[2,4]{1,0}, f64[2,4]{1,0}, /*index=5*/f64[2,4]{1,0}, f64[2,4]{1,0}) call(get-tuple-element.2448.0, get-tuple-element.2449.0, get-tuple-element.2450.0, get-tuple-element.2451.0), to_apply=command_buffer.20
  get-tuple-element.18032 = f64[4,1]{1,0} get-tuple-element(call.11), index=0
  get-tuple-element.18033 = f64[4]{0} get-tuple-element(call.11), index=1
  get-tuple-element.18034 = f64[2,4]{1,0} get-tuple-element(call.11), index=2
  get-tuple-element.18035 = f64[2,4]{1,0} get-tuple-element(call.11), index=3
  get-tuple-element.18036 = f64[2,4]{1,0} get-tuple-element(call.11), index=4
  get-tuple-element.18037 = f64[2,4]{1,0} get-tuple-element(call.11), index=5
  get-tuple-element.18038 = f64[2,4]{1,0} get-tuple-element(call.11), index=6
  ROOT tuple.738 = (f64[4]{0}, f64[2,4]{1,0}, f64[2,4]{1,0}, f64[2,4]{1,0}, f64[2,4]{1,0}, /*index=5*/f64[2,4]{1,0}, f64[4,1]{1,0}) tuple(get-tuple-element.18033, get-tuple-element.18036, get-tuple-element.18035, get-tuple-element.18034, get-tuple-element.18037, /*index=5*/get-tuple-element.18038, get-tuple-element.18032)
} // region_30.5243.clone.clone

fused_add_select {
  param_1.976 = pred[192,2,4]{2,1,0} parameter(1)
  constant_1987_15 = s64[] constant(191)
  param_2.807 = s64[] parameter(2)
  subtract.220.29 = s64[] subtract(constant_1987_15, param_2.807), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/sub" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  constant_1980_18 = s64[] constant(0)
  compare.1131.29 = pred[] compare(subtract.220.29, constant_1980_18), direction=LT, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/lt" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  constant_1988_15 = s64[] constant(383)
  subtract.221.29 = s64[] subtract(constant_1988_15, param_2.807), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  select.2973.29 = s64[] select(compare.1131.29, subtract.221.29, subtract.220.29), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  dynamic-slice.1237.30 = pred[1,2,4]{2,1,0} dynamic-slice(param_1.976, select.2973.29, constant_1980_18, constant_1980_18), dynamic_slice_sizes={1,2,4}, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/dynamic_slice[slice_sizes=(1, 2, 4)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  bitcast.10661.29 = pred[2,4]{1,0} bitcast(dynamic-slice.1237.30)
  constant_1982_16 = f64[] constant(0)
  broadcast.4024.clone.83 = f64[2,4]{1,0} broadcast(constant_1982_16), dimensions={}
  param_0.554 = f64[2,4]{1,0} parameter(0)
  select.3007.1 = f64[2,4]{1,0} select(bitcast.10661.29, broadcast.4024.clone.83, param_0.554), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(_where)/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  param_9.1340 = f64[2,4]{1,0} parameter(9)
  select.3009.3.clone.1 = f64[2,4]{1,0} select(bitcast.10661.29, broadcast.4024.clone.83, param_9.1340), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(_where)/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=370}
  param_4.3531 = f64[2,4]{1,0} parameter(4)
  param_21.1227 = f64[192,2,4]{2,1,0} parameter(21)
  dynamic-slice.1261.6.clone.1 = f64[1,2,4]{2,1,0} dynamic-slice(param_21.1227, select.2973.29, constant_1980_18, constant_1980_18), dynamic_slice_sizes={1,2,4}, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/dynamic_slice[slice_sizes=(1, 2, 4)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  bitcast.11117.12.clone.1 = f64[2,4]{1,0} bitcast(dynamic-slice.1261.6.clone.1)
  param_20.1469 = pred[192,2,4]{2,1,0} parameter(20)
  dynamic-slice.1274.3.clone.1 = pred[1,2,4]{2,1,0} dynamic-slice(param_20.1469, select.2973.29, constant_1980_18, constant_1980_18), dynamic_slice_sizes={1,2,4}, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/dynamic_slice[slice_sizes=(1, 2, 4)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  bitcast.11451.5.clone.1 = pred[2,4]{1,0} bitcast(dynamic-slice.1274.3.clone.1)
  param_37.141 = f64[2,4]{1,0} parameter(37)
  select.2996.5.clone.1 = f64[2,4]{1,0} select(bitcast.10661.29, param_37.141, broadcast.4024.clone.83), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(_where)/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  param_36.160 = f64[2,4]{1,0} parameter(36)
  select.2982.9.clone.1 = f64[2,4]{1,0} select(bitcast.10661.29, param_36.160, broadcast.4024.clone.83), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(_where)/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  param_18.1197 = pred[192,2,4]{2,1,0} parameter(18)
  dynamic-slice.1243.19.clone.1 = pred[1,2,4]{2,1,0} dynamic-slice(param_18.1197, select.2973.29, constant_1980_18, constant_1980_18), dynamic_slice_sizes={1,2,4}, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/dynamic_slice[slice_sizes=(1, 2, 4)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  bitcast.10789.35.clone.1 = pred[2,4]{1,0} bitcast(dynamic-slice.1243.19.clone.1)
  param_35.170 = f64[192,2,4]{2,1,0} parameter(35)
  dynamic-slice.1244.11.clone.1 = f64[1,2,4]{2,1,0} dynamic-slice(param_35.170, select.2973.29, constant_1980_18, constant_1980_18), dynamic_slice_sizes={1,2,4}, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/dynamic_slice[slice_sizes=(1, 2, 4)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  bitcast.10798.13.clone.1 = f64[2,4]{1,0} bitcast(dynamic-slice.1244.11.clone.1)
  param_16.864 = pred[192,2,4]{2,1,0} parameter(16)
  dynamic-slice.1245.21.clone.1 = pred[1,2,4]{2,1,0} dynamic-slice(param_16.864, select.2973.29, constant_1980_18, constant_1980_18), dynamic_slice_sizes={1,2,4}, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/dynamic_slice[slice_sizes=(1, 2, 4)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  bitcast.10807.21.clone.1 = pred[2,4]{1,0} bitcast(dynamic-slice.1245.21.clone.1)
  param_15.753 = s32[192,2,4]{2,1,0} parameter(15)
  dynamic-slice.1246.26.clone.1 = s32[1,2,4]{2,1,0} dynamic-slice(param_15.753, select.2973.29, constant_1980_18, constant_1980_18), dynamic_slice_sizes={1,2,4}, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/dynamic_slice[slice_sizes=(1, 2, 4)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  constant_1983_4_clone_1 = s32[] constant(1)
  broadcast.4025.21.clone.1 = s32[1,2,4]{2,1,0} broadcast(constant_1983_4_clone_1), dimensions={}
  compare.1132.21.clone.1 = pred[1,2,4]{2,1,0} compare(dynamic-slice.1246.26.clone.1, broadcast.4025.21.clone.1), direction=EQ, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update_ehgf)/jit(posterior_update_precision_continuous_node)/eq" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  bitcast.10819.23.clone.1 = pred[2,4]{1,0} bitcast(compare.1132.21.clone.1)
  param_14.756 = f64[2,4]{1,0} parameter(14)
  select.2983.35.clone.1 = f64[2,4]{1,0} select(bitcast.10661.29, param_14.756, broadcast.4024.clone.83), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(_where)/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  select.2984.23.clone.1 = f64[2,4]{1,0} select(bitcast.10819.23.clone.1, select.2983.35.clone.1, broadcast.4024.clone.83), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update_ehgf)/jit(posterior_update_precision_continuous_node)/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  select.2985.21.clone.1 = f64[2,4]{1,0} select(bitcast.10807.21.clone.1, select.2984.23.clone.1, broadcast.4024.clone.83), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update_ehgf)/jit(posterior_update_precision_continuous_node)/jit(precision_update)/jit(_where)/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  param_13.863 = f64[192,2,4]{2,1,0} parameter(13)
  dynamic-slice.1247.32.clone.1 = f64[1,2,4]{2,1,0} dynamic-slice(param_13.863, select.2973.29, constant_1980_18, constant_1980_18), dynamic_slice_sizes={1,2,4}, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/dynamic_slice[slice_sizes=(1, 2, 4)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  bitcast.10839.32.clone.1 = f64[2,4]{1,0} bitcast(dynamic-slice.1247.32.clone.1)
  multiply.2896.13.clone.1 = f64[2,4]{1,0} multiply(select.2985.21.clone.1, bitcast.10839.32.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update_ehgf)/jit(posterior_update_precision_continuous_node)/jit(precision_update)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  negate.468.12.clone.1 = f64[2,4]{1,0} negate(multiply.2896.13.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update_ehgf)/jit(posterior_update_precision_continuous_node)/jit(precision_update)/neg" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  multiply.2897.13.clone.1 = f64[2,4]{1,0} multiply(bitcast.10798.13.clone.1, negate.468.12.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update_ehgf)/jit(posterior_update_precision_continuous_node)/jit(precision_update)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  param_34.181 = f64[192,2,4]{2,1,0} parameter(34)
  dynamic-slice.1248.9.clone.1 = f64[1,2,4]{2,1,0} dynamic-slice(param_34.181, select.2973.29, constant_1980_18, constant_1980_18), dynamic_slice_sizes={1,2,4}, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/dynamic_slice[slice_sizes=(1, 2, 4)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  bitcast.10851.9.clone.1 = f64[2,4]{1,0} bitcast(dynamic-slice.1248.9.clone.1)
  multiply.2898.9.clone.1 = f64[2,4]{1,0} multiply(bitcast.10851.9.clone.1, multiply.2896.13.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update_ehgf)/jit(posterior_update_precision_continuous_node)/jit(precision_update)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  add.3976.11.clone.1 = f64[2,4]{1,0} add(multiply.2897.13.clone.1, multiply.2898.9.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update_ehgf)/jit(posterior_update_precision_continuous_node)/jit(precision_update)/add_any" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  select.2986.11.clone.1 = f64[2,4]{1,0} select(bitcast.10789.35.clone.1, add.3976.11.clone.1, broadcast.4024.clone.83), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update_ehgf)/jit(posterior_update_precision_continuous_node)/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  param_33.179 = f64[192,2,4]{2,1,0} parameter(33)
