HloModule jit_scan, is_scheduled=true, entry_computation_layout={(f64[48]{0}, f64[48]{0}, f64[48]{0}, f64[48]{0}, f64[48]{0}, /*index=5*/f64[48]{0}, f64[48]{0}, s32[48]{0}, f64[48]{0}, f64[48]{0}, /*index=10*/f64[48,1]{1,0}, f64[48]{0}, f64[48]{0}, f64[48]{0}, f64[48]{0}, /*index=15*/s64[48]{0}, f64[48]{0}, f64[48]{0}, f64[48]{0}, f64[48]{0}, /*index=20*/f64[48]{0}, f64[48]{0}, f64[48]{0}, f64[48,1]{1,0}, f64[48,1]{1,0}, /*index=25*/f64[48]{0}, f64[48]{0}, f64[48]{0}, f64[48]{0}, s64[48]{0}, /*index=30*/f64[48]{0}, f64[48]{0}, f64[48]{0}, f64[48]{0}, f64[48]{0}, /*index=35*/f64[48]{0}, f64[48]{0}, f64[48,1]{1,0}, f64[192,48,1]{2,1,0}, s32[192]{0}, /*index=40*/f64[192]{0})->(f64[48]{0}, f64[48]{0}, f64[48]{0}, f64[48]{0}, s32[48]{0}, /*index=5*/f64[48]{0}, f64[48]{0}, f64[48,1]{1,0}, f64[48]{0}, f64[48]{0}, /*index=10*/f64[48]{0}, f64[48]{0}, s64[48]{0}, f64[48]{0}, f64[48]{0}, /*index=15*/f64[48]{0}, f64[48]{0}, f64[48]{0}, f64[48]{0}, f64[48]{0}, /*index=20*/f64[48,1]{1,0}, f64[48,1]{1,0}, f64[48]{0}, f64[48]{0}, f64[48]{0}, /*index=25*/f64[48]{0}, s64[48]{0}, f64[48]{0}, f64[48]{0}, f64[48]{0}, /*index=30*/f64[48]{0}, f64[48]{0}, f64[48]{0}, f64[48]{0}, f64[48,1]{1,0}, /*index=35*/f64[192,48]{1,0}, f64[192,48]{1,0}, f64[192,48]{1,0}, f64[192,48]{1,0}, pred[192,48]{1,0}, /*index=40*/f64[192,48]{1,0}, f64[192,48]{1,0}, f64[192,48]{1,0}, f64[192,48]{1,0}, f64[192,48]{1,0}, /*index=45*/f64[192,48]{1,0}, f64[192,48]{1,0}, f64[192,48]{1,0}, pred[192,48]{1,0}, f64[192,48]{1,0}, /*index=50*/f64[192,48]{1,0}, f64[192,48]{1,0}, f64[192,48]{1,0}, f64[192,48]{1,0}, f64[192,48]{1,0}, /*index=55*/f64[192,48]{1,0}, f64[192]{0}, f64[192,48]{1,0}, f64[192,48]{1,0}, f64[192,48]{1,0}, /*index=60*/s32[192]{0}, f64[192,48]{1,0}, f64[192]{0}, f64[192,48]{1,0}, f64[192,48]{1,0}, /*index=65*/f64[192,48]{1,0}, pred[192,48]{1,0}, f64[192,48]{1,0}, f64[192,48]{1,0}, f64[192,48]{1,0}, /*index=70*/f64[192,48]{1,0}, f64[192,48]{1,0}, f64[192,48]{1,0}, f64[192]{0}, f64[192,48]{1,0}, /*index=75*/f64[192,48]{1,0}, f64[192,48]{1,0}, f64[192,48]{1,0}, f64[192,48]{1,0}, f64[192,48]{1,0}, /*index=80*/f64[192,48]{1,0}, f64[192,48]{1,0}, f64[192,48]{1,0}, f64[192,48]{1,0}, f64[192,48]{1,0}, /*index=85*/s32[192,48]{1,0}, pred[192,48]{1,0}, pred[192,48,1]{2,1,0}, f64[192,48]{1,0}, f64[192,48]{1,0}, /*index=90*/f64[192,48]{1,0}, f64[192,48]{1,0}, pred[192,48]{1,0}, pred[192,48,1]{2,1,0}, f64[192,48]{1,0}, /*index=95*/f64[192,48]{1,0}, f64[192,48]{1,0}, f64[192,48]{1,0}, f64[192,48]{1,0}, f64[192,48]{1,0}, /*index=100*/f64[192,48]{1,0}, f64[192,48]{1,0}, f64[192,48]{1,0}, f64[192,48]{1,0}, pred[192,48]{1,0}, /*index=105*/pred[192,48]{1,0}, pred[192,48,1]{2,1,0})}, allow_spmd_sharding_propagation_to_parameters={true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true}, allow_spmd_sharding_propagation_to_output={true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true}, frontend_attributes={fingerprint_before_lhs="65812f96ffea46f207d8137aea0f0095"}

fused_divide_exponential {
  constant_17_2 = f64[] constant(1)
  broadcast.445.1 = f64[48]{0} broadcast(constant_17_2), dimensions={}
  param_1.750 = f64[48]{0} parameter(1)
  divide.385.7 = f64[48]{0} divide(broadcast.445.1, param_1.750), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/div" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  param_0.492 = f64[] parameter(0)
  broadcast.446.7 = f64[48]{0} broadcast(param_0.492), dimensions={}, metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  param_2.652 = f64[48]{0} parameter(2)
  param_4.536 = f64[48,1]{1,0} parameter(4)
  bitcast.1630.5.clone.1 = f64[48]{0} bitcast(param_4.536)
  param_3.618 = f64[48]{0} parameter(3)
  multiply.841.5.clone.1 = f64[48]{0} multiply(bitcast.1630.5.clone.1, param_3.618), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  add.335.3.clone.1 = f64[48]{0} add(param_2.652, multiply.841.5.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  exponential.58.1.clone.1 = f64[48]{0} exponential(add.335.3.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/exp" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  multiply.842.7 = f64[48]{0} multiply(broadcast.446.7, exponential.58.1.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  add.336.5 = f64[48]{0} add(divide.385.7, multiply.842.7), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  divide.387.1 = f64[48]{0} divide(broadcast.445.1, add.336.5), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/div" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  multiply.843.1.clone.1 = f64[48]{0} multiply(param_1.750, param_1.750), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  divide.388.1.clone.1 = f64[48]{0} divide(broadcast.445.1, multiply.843.1.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/div" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  multiply.844.1.clone.1 = f64[48]{0} multiply(add.336.5, add.336.5), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  divide.389.1.clone.1 = f64[48]{0} divide(broadcast.445.1, multiply.844.1.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/div" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  ROOT tuple.141 = (f64[48]{0}, f64[48]{0}, f64[48]{0}, f64[48]{0}) tuple(divide.387.1, divide.388.1.clone.1, divide.389.1.clone.1, exponential.58.1.clone.1)
} // fused_divide_exponential

fused_broadcast {
  constant_288_1 = pred[] constant(false)
  ROOT broadcast.447.1 = pred[48]{0} broadcast(constant_288_1), dimensions={}
}

wrapped_copy_computation.4 {
  param_0.600 = f64[48]{0} parameter(0)
  ROOT copy.570 = f64[48]{0} copy(param_0.600)
}

region_2.281 {
  arg_tuple.282.0 = (f64[], f64[48]{0}, f64[48]{0}, f64[48,1]{1,0}, f64[48]{0}) parameter(0)
  get-tuple-element.5167 = f64[] get-tuple-element(arg_tuple.282.0), index=0
  get-tuple-element.286.0 = f64[48,1]{1,0} get-tuple-element(arg_tuple.282.0), index=3
  bitcast.1630.0 = f64[48]{0} bitcast(get-tuple-element.286.0)
  get-tuple-element.287.0 = f64[48]{0} get-tuple-element(arg_tuple.282.0), index=4
  get-tuple-element.285.0 = f64[48]{0} get-tuple-element(arg_tuple.282.0), index=2
  get-tuple-element.284.0 = f64[48]{0} get-tuple-element(arg_tuple.282.0), index=1
  loop_broadcast_fusion = pred[48]{0} fusion(), kind=kLoop, calls=fused_broadcast
  wrapped_copy.4 = f64[48]{0} fusion(bitcast.1630.0), kind=kLoop, calls=wrapped_copy_computation.4
  loop_divide_exponential_fusion = (f64[48]{0}, f64[48]{0}, f64[48]{0}, f64[48]{0}) fusion(get-tuple-element.5167, get-tuple-element.284.0, get-tuple-element.285.0, get-tuple-element.287.0, get-tuple-element.286.0), kind=kLoop, calls=fused_divide_exponential, metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/div" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  get-tuple-element.5169 = f64[48]{0} get-tuple-element(loop_divide_exponential_fusion), index=3, metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/div" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  get-tuple-element.5170 = f64[48]{0} get-tuple-element(loop_divide_exponential_fusion), index=2, metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/div" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  get-tuple-element.5166 = f64[48]{0} get-tuple-element(loop_divide_exponential_fusion), index=1, metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/div" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  get-tuple-element.5165 = f64[48]{0} get-tuple-element(loop_divide_exponential_fusion), index=0, metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/div" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  ROOT tuple.178 = (f64[48]{0}, f64[48]{0}, f64[], f64[48]{0}, f64[48]{0}, /*index=5*/f64[48]{0}, pred[48]{0}) tuple(get-tuple-element.5165, get-tuple-element.5166, get-tuple-element.5167, wrapped_copy.4, get-tuple-element.5169, /*index=5*/get-tuple-element.5170, loop_broadcast_fusion)
} // region_2.281

wrapped_convert_computation {
  param_0.601 = s32[] parameter(0)
  ROOT convert.83.1 = f64[] convert(param_0.601), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_1_fun/jit(precision_update)/convert_element_type[new_dtype=float64 weak_type=False sharding=None]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
}

fused_broadcast.1 {
  constant_335_1 = f64[] constant(0)
  ROOT broadcast.451.1 = f64[48]{0} broadcast(constant_335_1), dimensions={}
}

wrapped_copy_computation.5 {
  param_0.602 = f64[48]{0} parameter(0)
  ROOT copy.571 = f64[48]{0} copy(param_0.602)
}

wrapped_copy_computation.6 {
  param_0.603 = f64[48]{0} parameter(0)
  ROOT copy.572 = f64[48]{0} copy(param_0.603)
}

fused_compare_multiply_select {
  param_0.493 = f64[48]{0} parameter(0)
  param_3.619 = f64[48,1]{1,0} parameter(3)
  multiply.845.5.clone.1 = f64[48,1]{1,0} multiply(param_3.619, param_3.619), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_1_fun/jit(precision_update)/integer_pow[y=2]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  bitcast.1663.7.clone.1 = f64[48]{0} bitcast(multiply.845.5.clone.1)
  param_2.653 = f64[48]{0} parameter(2)
  multiply.846.7.clone.1 = f64[48]{0} multiply(bitcast.1663.7.clone.1, param_2.653), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_1_fun/jit(precision_update)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  param_1.751 = f64[] parameter(1)
  broadcast.448.7.clone.1 = f64[48]{0} broadcast(param_1.751), dimensions={}, metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_1_fun/jit(precision_update)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  multiply.847.7.clone.1 = f64[48]{0} multiply(multiply.846.7.clone.1, broadcast.448.7.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_1_fun/jit(precision_update)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  add.337.5.clone.1 = f64[48]{0} add(param_0.493, multiply.847.7.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_1_fun/jit(precision_update)/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  constant_22_1_clone_1 = f64[] constant(1e-128)
  broadcast.449.1.clone.1 = f64[48]{0} broadcast(constant_22_1_clone_1), dimensions={}
  compare.262.1.clone.1 = pred[48]{0} compare(add.337.5.clone.1, broadcast.449.1.clone.1), direction=GT, metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_1_fun/jit(precision_update)/gt" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  constant_23_1 = f64[] constant(nan)
  broadcast.450.1 = f64[48]{0} broadcast(constant_23_1), dimensions={}, metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_1_fun/jit(precision_update)/jit(_where)/broadcast_in_dim[shape=(48,) broadcast_dimensions=()]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  select.508.1 = f64[48]{0} select(compare.262.1.clone.1, add.337.5.clone.1, broadcast.450.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_1_fun/jit(precision_update)/jit(_where)/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  ROOT tuple.143 = (f64[48]{0}, pred[48]{0}, f64[48,1]{1,0}) tuple(select.508.1, compare.262.1.clone.1, multiply.845.5.clone.1)
} // fused_compare_multiply_select

command_buffer.8 {
  p.314 = s32[] parameter(0)
  p.315 = (f64[48]{0}, s32[], f64[48]{0}, f64[48,1]{1,0}) parameter(1)
  wrapped_convert = f64[] fusion(p.314), kind=kLoop, calls=wrapped_convert_computation, metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_1_fun/jit(precision_update)/convert_element_type[new_dtype=float64 weak_type=False sharding=None]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  get-tuple-element.334.0 = f64[48,1]{1,0} get-tuple-element(p.315), index=3, metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_1_fun/jit(precision_update)/squeeze[dimensions=(1,)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  get-tuple-element.333.0 = f64[48]{0} get-tuple-element(p.315), index=2
  get-tuple-element.331.0 = f64[48]{0} get-tuple-element(p.315), index=0
  loop_broadcast_fusion.1 = f64[48]{0} fusion(), kind=kLoop, calls=fused_broadcast.1
  wrapped_copy.5 = f64[48]{0} fusion(loop_broadcast_fusion.1), kind=kLoop, calls=wrapped_copy_computation.5
  wrapped_copy.6 = f64[48]{0} fusion(loop_broadcast_fusion.1), kind=kLoop, calls=wrapped_copy_computation.6
  loop_compare_multiply_select_fusion = (f64[48]{0}, pred[48]{0}, f64[48,1]{1,0}) fusion(get-tuple-element.333.0, wrapped_convert, get-tuple-element.331.0, get-tuple-element.334.0), kind=kLoop, calls=fused_compare_multiply_select, metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_1_fun/jit(precision_update)/jit(_where)/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  ROOT tuple.204 = (f64[], f64[48]{0}, f64[48]{0}, f64[48]{0}, (f64[48]{0}, pred[48]{0}, f64[48,1]{1,0})) tuple(wrapped_convert, loop_broadcast_fusion.1, wrapped_copy.5, wrapped_copy.6, loop_compare_multiply_select_fusion)
} // command_buffer.8

region_3.329 {
  arg_tuple.330.0 = (f64[48]{0}, s32[], f64[48]{0}, f64[48,1]{1,0}) parameter(0)
  get-tuple-element.332.0 = s32[] get-tuple-element(arg_tuple.330.0), index=1
  call.4 = (f64[], f64[48]{0}, f64[48]{0}, f64[48]{0}, (f64[48]{0}, pred[48]{0}, f64[48,1]{1,0})) call(get-tuple-element.332.0, arg_tuple.330.0), to_apply=command_buffer.8
  get-tuple-element.6086 = f64[] get-tuple-element(call.4), index=0
  get-tuple-element.6087 = f64[48]{0} get-tuple-element(call.4), index=1
  get-tuple-element.6088 = f64[48]{0} get-tuple-element(call.4), index=2
  get-tuple-element.6089 = f64[48]{0} get-tuple-element(call.4), index=3
  get-tuple-element.6090 = (f64[48]{0}, pred[48]{0}, f64[48,1]{1,0}) get-tuple-element(call.4), index=4
  get-tuple-element.5123 = f64[48,1]{1,0} get-tuple-element(get-tuple-element.6090), index=2, metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_1_fun/jit(precision_update)/jit(_where)/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  bitcast.1663.0 = f64[48]{0} bitcast(get-tuple-element.5123)
  get-tuple-element.5178 = pred[48]{0} get-tuple-element(get-tuple-element.6090), index=1, metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_1_fun/jit(precision_update)/jit(_where)/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  get-tuple-element.5172 = f64[48]{0} get-tuple-element(get-tuple-element.6090), index=0, metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_1_fun/jit(precision_update)/jit(_where)/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  ROOT tuple.179 = (f64[48]{0}, f64[48]{0}, f64[], f64[48]{0}, f64[48]{0}, /*index=5*/f64[48]{0}, pred[48]{0}) tuple(get-tuple-element.5172, get-tuple-element.6087, get-tuple-element.6086, bitcast.1663.0, get-tuple-element.6088, /*index=5*/get-tuple-element.6089, get-tuple-element.5178)
} // region_3.329

fused_dynamic_slice {
  param_0.302 = f64[192]{0} parameter(0)
  param_1.423 = s64[] parameter(1)
  constant_357_62 = s64[] constant(0)
  compare.263.7 = pred[] compare(param_1.423, constant_357_62), direction=LT, metadata={op_name="jit(scan)/jit(main)/while/body/lt" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  constant_356_4 = s64[] constant(192)
  add.339.7 = s64[] add(param_1.423, constant_356_4), metadata={op_name="jit(scan)/jit(main)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  select.509.7 = s64[] select(compare.263.7, add.339.7, param_1.423), metadata={op_name="jit(scan)/jit(main)/while/body/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  ROOT dynamic-slice.39.25 = f64[1]{0} dynamic-slice(param_0.302, select.509.7), dynamic_slice_sizes={1}, metadata={op_name="jit(scan)/jit(main)/while/body/dynamic_slice[slice_sizes=(1,)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
} // fused_dynamic_slice

fused_convert_dynamic_slice {
  param_0.304 = s32[192]{0} parameter(0)
  param_1.427 = s64[] parameter(1)
  constant_357_63 = s64[] constant(0)
  compare.263.9 = pred[] compare(param_1.427, constant_357_63), direction=LT, metadata={op_name="jit(scan)/jit(main)/while/body/lt" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  constant_356_5 = s64[] constant(192)
  add.339.9 = s64[] add(param_1.427, constant_356_5), metadata={op_name="jit(scan)/jit(main)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  select.509.9 = s64[] select(compare.263.9, add.339.9, param_1.427), metadata={op_name="jit(scan)/jit(main)/while/body/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  dynamic-slice.40.15 = s32[1]{0} dynamic-slice(param_0.304, select.509.9), dynamic_slice_sizes={1}, metadata={op_name="jit(scan)/jit(main)/while/body/dynamic_slice[slice_sizes=(1,)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  constant_360_2_clone_1 = s32[1]{0} constant({0})
  compare.264.1.clone.1 = pred[1]{0} compare(dynamic-slice.40.15, constant_360_2_clone_1), direction=NE, metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/convert_element_type[new_dtype=bool weak_type=False sharding=None]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  convert.84.2.clone.1 = s32[1]{0} convert(compare.264.1.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/convert_element_type[new_dtype=int32 weak_type=False sharding=None]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  ROOT tuple.172 = (s32[1]{0}, s32[1]{0}) tuple(dynamic-slice.40.15, convert.84.2.clone.1)
} // fused_convert_dynamic_slice

wrapped_copy_computation.3 {
  param_0.599 = f64[48]{0} parameter(0)
  ROOT copy.569 = f64[48]{0} copy(param_0.599)
}

fused_dynamic_update_slice.59 {
  param_0.242 = s32[192]{0} parameter(0)
  param_1.735 = s32[192]{0} parameter(1)
  param_2.623 = s64[] parameter(2)
  constant_357_65 = s64[] constant(0)
  compare.263.63 = pred[] compare(param_2.623, constant_357_65), direction=LT, metadata={op_name="jit(scan)/jit(main)/while/body/lt" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  constant_356_32 = s64[] constant(192)
  add.339.63 = s64[] add(param_2.623, constant_356_32), metadata={op_name="jit(scan)/jit(main)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  select.509.63 = s64[] select(compare.263.63, add.339.63, param_2.623), metadata={op_name="jit(scan)/jit(main)/while/body/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  dynamic-slice.40.1 = s32[1]{0} dynamic-slice(param_1.735, select.509.63), dynamic_slice_sizes={1}, metadata={op_name="jit(scan)/jit(main)/while/body/dynamic_slice[slice_sizes=(1,)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  constant_360_1 = s32[1]{0} constant({0})
  compare.264.2 = pred[1]{0} compare(dynamic-slice.40.1, constant_360_1), direction=NE, metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/convert_element_type[new_dtype=bool weak_type=False sharding=None]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  convert.84.1 = s32[1]{0} convert(compare.264.2), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/convert_element_type[new_dtype=int32 weak_type=False sharding=None]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  ROOT dynamic-update-slice.881.1 = s32[192]{0} dynamic-update-slice(param_0.242, convert.84.1, select.509.63), metadata={op_name="jit(scan)/jit(main)/while/body/dynamic_update_slice" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
} // fused_dynamic_update_slice.59

fused_dynamic_update_slice.38 {
  param_0.82 = f64[192]{0} parameter(0)
  param_1.472 = s32[192]{0} parameter(1)
  param_2.342 = s64[] parameter(2)
  constant_357_64 = s64[] constant(0)
  compare.263.55 = pred[] compare(param_2.342, constant_357_64), direction=LT, metadata={op_name="jit(scan)/jit(main)/while/body/lt" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  constant_356_28 = s64[] constant(192)
  add.339.55 = s64[] add(param_2.342, constant_356_28), metadata={op_name="jit(scan)/jit(main)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  select.509.55 = s64[] select(compare.263.55, add.339.55, param_2.342), metadata={op_name="jit(scan)/jit(main)/while/body/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  dynamic-slice.40.4 = s32[1]{0} dynamic-slice(param_1.472, select.509.55), dynamic_slice_sizes={1}, metadata={op_name="jit(scan)/jit(main)/while/body/dynamic_slice[slice_sizes=(1,)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  bitcast.1762.6 = s32[] bitcast(dynamic-slice.40.4)
  convert.85.3 = f64[] convert(bitcast.1762.6), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(binary_state_node_prediction_error)/convert_element_type[new_dtype=float64 weak_type=False sharding=None]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  bitcast.2344.1 = f64[1]{0} bitcast(convert.85.3)
  ROOT dynamic-update-slice.878.1 = f64[192]{0} dynamic-update-slice(param_0.82, bitcast.2344.1, select.509.55), metadata={op_name="jit(scan)/jit(main)/while/body/dynamic_update_slice" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
} // fused_dynamic_update_slice.38

fused_divide_exponential_multiply {
  constant_358_5 = f64[] constant(1)
  broadcast.453.4 = f64[48]{0} broadcast(constant_358_5), dimensions={}
  param_6.295 = f64[48]{0} parameter(6)
  divide.391.1.clone.1 = f64[48]{0} divide(broadcast.453.4, param_6.295), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_prediction)/jit(predict_precision)/div" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  param_1.752 = f64[192]{0} parameter(1)
  param_2.656 = s64[] parameter(2)
  constant_357_74 = s64[] constant(0)
  compare.263.145 = pred[] compare(param_2.656, constant_357_74), direction=LT, metadata={op_name="jit(scan)/jit(main)/while/body/lt" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  constant_356_73 = s64[] constant(192)
  add.339.145 = s64[] add(param_2.656, constant_356_73), metadata={op_name="jit(scan)/jit(main)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  select.509.145 = s64[] select(compare.263.145, add.339.145, param_2.656), metadata={op_name="jit(scan)/jit(main)/while/body/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  dynamic-slice.39.22 = f64[1]{0} dynamic-slice(param_1.752, select.509.145), dynamic_slice_sizes={1}, metadata={op_name="jit(scan)/jit(main)/while/body/dynamic_slice[slice_sizes=(1,)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  bitcast.1707.34 = f64[] bitcast(dynamic-slice.39.22)
  broadcast.452.31 = f64[48]{0} broadcast(bitcast.1707.34), dimensions={}, metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_prediction)/jit(predict_mean)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  param_3.622 = f64[48]{0} parameter(3)
  param_5.411 = f64[48,1]{1,0} parameter(5)
  bitcast.1776.5.clone.1 = f64[48]{0} bitcast(param_5.411)
  param_4.545 = f64[48]{0} parameter(4)
  multiply.852.5.clone.1 = f64[48]{0} multiply(bitcast.1776.5.clone.1, param_4.545), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_prediction)/jit(predict_precision)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  add.342.3.clone.1 = f64[48]{0} add(param_3.622, multiply.852.5.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_prediction)/jit(predict_precision)/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  exponential.60.1.clone.1 = f64[48]{0} exponential(add.342.3.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_prediction)/jit(predict_precision)/exp" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  multiply.853.13 = f64[48]{0} multiply(broadcast.452.31, exponential.60.1.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_prediction)/jit(predict_precision)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  constant_359_13 = f64[] constant(1e-128)
  broadcast.454.clone.33 = f64[48]{0} broadcast(constant_359_13), dimensions={}
  compare.265.13 = pred[48]{0} compare(multiply.853.13, broadcast.454.clone.33), direction=GT, metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_prediction)/jit(predict_precision)/gt" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  param_0.494 = f64[48]{0} parameter(0)
  select.510.7 = f64[48]{0} select(compare.265.13, multiply.853.13, param_0.494), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_prediction)/jit(predict_precision)/jit(_where)/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  add.343.5 = f64[48]{0} add(divide.391.1.clone.1, select.510.7), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_prediction)/jit(predict_precision)/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  divide.392.1 = f64[48]{0} divide(broadcast.453.4, add.343.5), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_prediction)/jit(predict_precision)/div" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  param_8.160 = f64[48]{0} parameter(8)
  param_9.115 = f64[48]{0} parameter(9)
  multiply.848.7.clone.1.clone.1 = f64[48]{0} multiply(param_8.160, param_9.115), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_prediction)/jit(predict_mean)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  param_7.221 = f64[48]{0} parameter(7)
  multiply.849.9.clone.1.clone.1 = f64[48]{0} multiply(broadcast.452.31, param_7.221), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_prediction)/jit(predict_mean)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  add.340.7.clone.1.clone.1 = f64[48]{0} add(multiply.848.7.clone.1.clone.1, multiply.849.9.clone.1.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_prediction)/jit(predict_mean)/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  negate.18.5.clone.1.clone.1 = f64[48]{0} negate(add.340.7.clone.1.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(binary_state_node_prediction)/neg" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  exponential.59.5.clone.1.clone.1 = f64[48]{0} exponential(negate.18.5.clone.1.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(binary_state_node_prediction)/exp" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  add.341.3.clone.1.clone.1 = f64[48]{0} add(exponential.59.5.clone.1.clone.1, broadcast.453.4), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(binary_state_node_prediction)/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  divide.390.1.clone.1.clone.1 = f64[48]{0} divide(broadcast.453.4, add.341.3.clone.1.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(binary_state_node_prediction)/div" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  subtract.76.5.clone.1 = f64[48]{0} subtract(broadcast.453.4, divide.390.1.clone.1.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(binary_state_node_prediction)/sub" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  multiply.850.1.clone.1 = f64[48]{0} multiply(divide.390.1.clone.1.clone.1, subtract.76.5.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(binary_state_node_prediction)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  ROOT tuple.174 = (f64[48]{0}, f64[48]{0}, f64[48]{0}, f64[48]{0}, f64[48]{0}) tuple(divide.392.1, exponential.60.1.clone.1, divide.391.1.clone.1, multiply.850.1.clone.1, divide.390.1.clone.1.clone.1)
} // fused_divide_exponential_multiply

command_buffer.4 {
  p.94 = f64[192]{0} parameter(0)
  p.95 = s64[] parameter(1)
  p.96 = (s64[], f64[48]{0}, f64[48]{0}, f64[48]{0}, f64[48]{0}, /*index=5*/s32[48]{0}, f64[48]{0}, f64[48]{0}, f64[48]{0}, f64[48]{0}, /*index=10*/f64[48]{0}, f64[48]{0}, s64[48]{0}, f64[48]{0}, f64[48]{0}, /*index=15*/f64[48]{0}, f64[48]{0}, f64[48]{0}, f64[48]{0}, f64[48]{0}, /*index=20*/f64[48,1]{1,0}, f64[48,1]{1,0}, f64[48]{0}, f64[48]{0}, f64[48]{0}, /*index=25*/f64[48]{0}, f64[48]{0}, f64[48]{0}, f64[48]{0}, f64[48]{0}, /*index=30*/f64[48]{0}, f64[48,1]{1,0}, f64[192,48]{1,0}, f64[192,48]{1,0}, f64[192,48]{1,0}, /*index=35*/f64[192,48]{1,0}, pred[192,48]{1,0}, f64[192,48]{1,0}, f64[192,48]{1,0}, f64[192,48]{1,0}, /*index=40*/f64[192,48]{1,0}, f64[192,48]{1,0}, f64[192,48]{1,0}, f64[192,48]{1,0}, pred[192,48]{1,0}, /*index=45*/f64[192,48]{1,0}, f64[192,48]{1,0}, f64[192,48]{1,0}, f64[192,48]{1,0}, f64[192,48]{1,0}, /*index=50*/f64[192,48]{1,0}, f64[192]{0}, f64[192,48]{1,0}, f64[192,48]{1,0}, s32[192]{0}, /*index=55*/f64[192,48]{1,0}, f64[192]{0}, f64[192,48]{1,0}, f64[192,48]{1,0}, f64[192,48]{1,0}, /*index=60*/pred[192,48]{1,0}, f64[192,48]{1,0}, f64[192,48]{1,0}, f64[192,48]{1,0}, f64[192,48]{1,0}, /*index=65*/f64[192,48]{1,0}, f64[192,48]{1,0}, f64[192,48]{1,0}, f64[192,48]{1,0}, f64[192,48]{1,0}, /*index=70*/f64[192,48]{1,0}, f64[192,48]{1,0}, f64[192,48]{1,0}, f64[192,48]{1,0}, f64[192,48]{1,0}, /*index=75*/f64[192,48]{1,0}, f64[192,48]{1,0}, s32[192,48]{1,0}, pred[192,48]{1,0}, pred[192,48,1]{2,1,0}, /*index=80*/f64[192,48]{1,0}, f64[192,48]{1,0}, pred[192,48]{1,0}, pred[192,48,1]{2,1,0}, f64[192,48]{1,0}, /*index=85*/f64[192,48]{1,0}, f64[192,48]{1,0}, f64[192,48]{1,0}, f64[192,48]{1,0}, pred[192,48]{1,0}, /*index=90*/pred[192,48]{1,0}, pred[192,48,1]{2,1,0}, f64[192,48,1]{2,1,0}, s32[192]{0}, f64[192]{0}, /*index=95*/f64[48]{0}, f64[48]{0}, f64[48]{0}) parameter(2)
  loop_dynamic_slice_fusion = f64[1]{0} fusion(p.94, p.95), kind=kLoop, calls=fused_dynamic_slice, metadata={op_name="jit(scan)/jit(main)/while/body/dynamic_slice[slice_sizes=(1,)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  bitcast.1707.0 = f64[] bitcast(loop_dynamic_slice_fusion)
  get-tuple-element.5471 = f64[48]{0} get-tuple-element(p.96), index=96
  get-tuple-element.5406 = f64[48,1]{1,0} get-tuple-element(p.96), index=31
  get-tuple-element.5387 = s64[48]{0} get-tuple-element(p.96), index=12
  get-tuple-element.5468 = s32[192]{0} get-tuple-element(p.96), index=93
  get-tuple-element.5383 = f64[48]{0} get-tuple-element(p.96), index=8
  get-tuple-element.5395 = f64[48,1]{1,0} get-tuple-element(p.96), index=20
  get-tuple-element.5393 = f64[48]{0} get-tuple-element(p.96), index=18
  get-tuple-element.5290 = f64[48]{0} get-tuple-element(p.96), index=13
  get-tuple-element.5396 = f64[48,1]{1,0} get-tuple-element(p.96), index=21
  get-tuple-element.5467 = f64[192,48,1]{2,1,0} get-tuple-element(p.96), index=92
  get-tuple-element.5470 = f64[48]{0} get-tuple-element(p.96), index=95
  get-tuple-element.5394 = f64[48]{0} get-tuple-element(p.96), index=19
  get-tuple-element.5397 = f64[48]{0} get-tuple-element(p.96), index=22
  get-tuple-element.5302 = f64[48]{0} get-tuple-element(p.96), index=25
  get-tuple-element.5303 = f64[48]{0} get-tuple-element(p.96), index=26
  get-tuple-element.5404 = f64[48]{0} get-tuple-element(p.96), index=29
  get-tuple-element.5405 = f64[48]{0} get-tuple-element(p.96), index=30
  get-tuple-element.5472 = f64[48]{0} get-tuple-element(p.96), index=97
  get-tuple-element.5278 = f64[48]{0} get-tuple-element(p.96), index=1
  get-tuple-element.5279 = f64[48]{0} get-tuple-element(p.96), index=2
  get-tuple-element.5280 = f64[48]{0} get-tuple-element(p.96), index=3
  get-tuple-element.5281 = f64[48]{0} get-tuple-element(p.96), index=4
  get-tuple-element.5282 = s32[48]{0} get-tuple-element(p.96), index=5
  get-tuple-element.5283 = f64[48]{0} get-tuple-element(p.96), index=6
  get-tuple-element.5284 = f64[48]{0} get-tuple-element(p.96), index=7
  get-tuple-element.5286 = f64[48]{0} get-tuple-element(p.96), index=9
  get-tuple-element.5287 = f64[48]{0} get-tuple-element(p.96), index=10
  get-tuple-element.5288 = f64[48]{0} get-tuple-element(p.96), index=11
  get-tuple-element.5291 = f64[48]{0} get-tuple-element(p.96), index=14
  get-tuple-element.5292 = f64[48]{0} get-tuple-element(p.96), index=15
  get-tuple-element.5293 = f64[48]{0} get-tuple-element(p.96), index=16
  get-tuple-element.5294 = f64[48]{0} get-tuple-element(p.96), index=17
  get-tuple-element.5300 = f64[48]{0} get-tuple-element(p.96), index=23
  get-tuple-element.5301 = f64[48]{0} get-tuple-element(p.96), index=24
  get-tuple-element.5304 = f64[48]{0} get-tuple-element(p.96), index=27
  get-tuple-element.5305 = f64[48]{0} get-tuple-element(p.96), index=28
  get-tuple-element.5309 = f64[192,48]{1,0} get-tuple-element(p.96), index=32
  get-tuple-element.5310 = f64[192,48]{1,0} get-tuple-element(p.96), index=33
  get-tuple-element.5311 = f64[192,48]{1,0} get-tuple-element(p.96), index=34
  get-tuple-element.5312 = f64[192,48]{1,0} get-tuple-element(p.96), index=35
  get-tuple-element.5313 = pred[192,48]{1,0} get-tuple-element(p.96), index=36
  get-tuple-element.5314 = f64[192,48]{1,0} get-tuple-element(p.96), index=37
  get-tuple-element.5315 = f64[192,48]{1,0} get-tuple-element(p.96), index=38
  get-tuple-element.5316 = f64[192,48]{1,0} get-tuple-element(p.96), index=39
  get-tuple-element.5317 = f64[192,48]{1,0} get-tuple-element(p.96), index=40
  get-tuple-element.5318 = f64[192,48]{1,0} get-tuple-element(p.96), index=41
  get-tuple-element.5319 = f64[192,48]{1,0} get-tuple-element(p.96), index=42
  get-tuple-element.5320 = f64[192,48]{1,0} get-tuple-element(p.96), index=43
  get-tuple-element.5321 = pred[192,48]{1,0} get-tuple-element(p.96), index=44
  get-tuple-element.5322 = f64[192,48]{1,0} get-tuple-element(p.96), index=45
  get-tuple-element.5323 = f64[192,48]{1,0} get-tuple-element(p.96), index=46
  get-tuple-element.5324 = f64[192,48]{1,0} get-tuple-element(p.96), index=47
  get-tuple-element.5325 = f64[192,48]{1,0} get-tuple-element(p.96), index=48
  get-tuple-element.5326 = f64[192,48]{1,0} get-tuple-element(p.96), index=49
  get-tuple-element.5327 = f64[192,48]{1,0} get-tuple-element(p.96), index=50
  get-tuple-element.5328 = f64[192]{0} get-tuple-element(p.96), index=51
  get-tuple-element.5329 = f64[192,48]{1,0} get-tuple-element(p.96), index=52
  get-tuple-element.5330 = f64[192,48]{1,0} get-tuple-element(p.96), index=53
  get-tuple-element.5331 = s32[192]{0} get-tuple-element(p.96), index=54
  get-tuple-element.5332 = f64[192,48]{1,0} get-tuple-element(p.96), index=55
  get-tuple-element.5333 = f64[192]{0} get-tuple-element(p.96), index=56
  get-tuple-element.5334 = f64[192,48]{1,0} get-tuple-element(p.96), index=57
  get-tuple-element.5335 = f64[192,48]{1,0} get-tuple-element(p.96), index=58
  get-tuple-element.5336 = f64[192,48]{1,0} get-tuple-element(p.96), index=59
  get-tuple-element.5337 = pred[192,48]{1,0} get-tuple-element(p.96), index=60
  get-tuple-element.5338 = f64[192,48]{1,0} get-tuple-element(p.96), index=61
  get-tuple-element.5339 = f64[192,48]{1,0} get-tuple-element(p.96), index=62
  get-tuple-element.5340 = f64[192,48]{1,0} get-tuple-element(p.96), index=63
  get-tuple-element.5341 = f64[192,48]{1,0} get-tuple-element(p.96), index=64
  get-tuple-element.5342 = f64[192,48]{1,0} get-tuple-element(p.96), index=65
  get-tuple-element.5343 = f64[192,48]{1,0} get-tuple-element(p.96), index=66
  get-tuple-element.5344 = f64[192,48]{1,0} get-tuple-element(p.96), index=67
  get-tuple-element.5345 = f64[192,48]{1,0} get-tuple-element(p.96), index=68
  get-tuple-element.5346 = f64[192,48]{1,0} get-tuple-element(p.96), index=69
  get-tuple-element.5347 = f64[192,48]{1,0} get-tuple-element(p.96), index=70
  get-tuple-element.5348 = f64[192,48]{1,0} get-tuple-element(p.96), index=71
  get-tuple-element.5349 = f64[192,48]{1,0} get-tuple-element(p.96), index=72
  get-tuple-element.5350 = f64[192,48]{1,0} get-tuple-element(p.96), index=73
  get-tuple-element.5351 = f64[192,48]{1,0} get-tuple-element(p.96), index=74
  get-tuple-element.5352 = f64[192,48]{1,0} get-tuple-element(p.96), index=75
  get-tuple-element.5353 = f64[192,48]{1,0} get-tuple-element(p.96), index=76
  get-tuple-element.5354 = s32[192,48]{1,0} get-tuple-element(p.96), index=77
  get-tuple-element.5355 = pred[192,48]{1,0} get-tuple-element(p.96), index=78
  get-tuple-element.5356 = pred[192,48,1]{2,1,0} get-tuple-element(p.96), index=79
  get-tuple-element.5357 = f64[192,48]{1,0} get-tuple-element(p.96), index=80
  get-tuple-element.5358 = f64[192,48]{1,0} get-tuple-element(p.96), index=81
  get-tuple-element.5359 = pred[192,48]{1,0} get-tuple-element(p.96), index=82
  get-tuple-element.5360 = pred[192,48,1]{2,1,0} get-tuple-element(p.96), index=83
  get-tuple-element.5361 = f64[192,48]{1,0} get-tuple-element(p.96), index=84
  get-tuple-element.5362 = f64[192,48]{1,0} get-tuple-element(p.96), index=85
  get-tuple-element.5363 = f64[192,48]{1,0} get-tuple-element(p.96), index=86
  get-tuple-element.5364 = f64[192,48]{1,0} get-tuple-element(p.96), index=87
  get-tuple-element.5365 = f64[192,48]{1,0} get-tuple-element(p.96), index=88
  get-tuple-element.5366 = pred[192,48]{1,0} get-tuple-element(p.96), index=89
  get-tuple-element.5367 = pred[192,48]{1,0} get-tuple-element(p.96), index=90
  get-tuple-element.5368 = pred[192,48,1]{2,1,0} get-tuple-element(p.96), index=91
  loop_convert_dynamic_slice_fusion = (s32[1]{0}, s32[1]{0}) fusion(get-tuple-element.5468, p.95), kind=kLoop, calls=fused_convert_dynamic_slice, metadata={op_name="jit(scan)/jit(main)/while/body/dynamic_slice[slice_sizes=(1,)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  get-tuple-element.5156 = s32[1]{0} get-tuple-element(loop_convert_dynamic_slice_fusion), index=1, metadata={op_name="jit(scan)/jit(main)/while/body/dynamic_slice[slice_sizes=(1,)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  bitcast.1744.0 = s32[] bitcast(get-tuple-element.5156)
  get-tuple-element.5155 = s32[1]{0} get-tuple-element(loop_convert_dynamic_slice_fusion), index=0, metadata={op_name="jit(scan)/jit(main)/while/body/dynamic_slice[slice_sizes=(1,)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  bitcast.1762.0 = s32[] bitcast(get-tuple-element.5155)
