HloModule jit_while, is_scheduled=true, entry_computation_layout={(s64[], f64[20]{0}, f64[20]{0}, f64[20]{0}, f64[20]{0}, /*index=5*/f64[20]{0}, f64[20]{0}, s64[], f64[], f64[20]{0}, /*index=10*/f64[20]{0}, f64[20]{0}, f64[20]{0}, f64[20]{0}, f64[20]{0}, /*index=15*/f64[], f64[], f64[10,20]{1,0}, f64[10,20]{1,0}, f64[10,20]{1,0}, /*index=20*/f64[10,20]{1,0}, f64[10,20]{1,0}, f64[10,20]{1,0}, f64[10,20]{1,0}, f64[10,20]{1,0}, /*index=25*/f64[10,20]{1,0}, f64[10,20]{1,0}, f64[10,20]{1,0}, f64[10,20]{1,0}, f64[10]{0}, /*index=30*/f64[], pred[], s32[], s32[], s32[])->(s64[], f64[20]{0}, f64[20]{0}, f64[20]{0}, f64[20]{0}, /*index=5*/f64[20]{0}, f64[20]{0}, s64[], f64[], f64[20]{0}, /*index=10*/f64[20]{0}, f64[20]{0}, f64[20]{0}, f64[20]{0}, f64[20]{0}, /*index=15*/f64[], f64[], f64[10,20]{1,0}, f64[10,20]{1,0}, f64[10,20]{1,0}, /*index=20*/f64[10,20]{1,0}, f64[10,20]{1,0}, f64[10,20]{1,0}, f64[10,20]{1,0}, f64[10,20]{1,0}, /*index=25*/f64[10,20]{1,0}, f64[10,20]{1,0}, f64[10,20]{1,0}, f64[10,20]{1,0}, f64[10]{0}, /*index=30*/f64[], pred[], s32[], s32[], s32[])}, allow_spmd_sharding_propagation_to_parameters={true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true}, allow_spmd_sharding_propagation_to_output={true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true}, frontend_attributes={fingerprint_before_lhs="900ee1c87f7c55fbc066fd3605951db5"}

scalar_add_computation {
  scalar_rhs = f64[] parameter(1)
  scalar_lhs = f64[] parameter(0)
  ROOT add.9442 = f64[] add(scalar_lhs, scalar_rhs)
}

fused_reduce {
  param_1.114 = f64[10,20]{1,0} parameter(1)
  param_2.111 = s64[10]{0} parameter(2)
  constant_3324_7 = s64[] constant(9)
  param_3.126 = s64[] parameter(3)
  subtract.813.13 = s64[] subtract(constant_3324_7, param_3.126), metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/sub" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  constant_226_11 = s64[] constant(0)
  compare.2626.13 = pred[] compare(subtract.813.13, constant_226_11), direction=LT, metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/lt" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  constant_3456_7 = s64[] constant(19)
  subtract.814.13 = s64[] subtract(constant_3456_7, param_3.126), metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  select.8893.13 = s64[] select(compare.2626.13, subtract.814.13, subtract.813.13), metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  dynamic-slice.5236.29 = s64[1]{0} dynamic-slice(param_2.111, select.8893.13), dynamic_slice_sizes={1}, metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/dynamic_slice[slice_sizes=(1,)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  bitcast.14930.91 = s64[] bitcast(dynamic-slice.5236.29)
  compare.2627.31 = pred[] compare(bitcast.14930.91, constant_226_11), direction=LT, metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/lt" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  constant_228_5 = s64[] constant(10)
  add.9444.31 = s64[] add(bitcast.14930.91, constant_228_5), metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  select.8894.29 = s64[] select(compare.2627.31, add.9444.31, bitcast.14930.91), metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  dynamic-slice.5238.3 = f64[1,20]{1,0} dynamic-slice(param_1.114, select.8894.29, constant_226_11), dynamic_slice_sizes={1,20}, metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/dynamic_slice[slice_sizes=(1, 20)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  bitcast.14950.3 = f64[20]{0} bitcast(dynamic-slice.5238.3)
  param_0.80 = f64[20]{0} parameter(0)
  multiply.11253.3 = f64[20]{0} multiply(bitcast.14950.3, param_0.80)
  constant_1586_3 = f64[] constant(0)
  reduce.104.1 = f64[] reduce(multiply.11253.3, constant_1586_3), dimensions={0}, to_apply=scalar_add_computation, metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/dot_general[dimension_numbers=(((0,), (0,)), ((), ())) precision=(Precision.HIGHEST, Precision.HIGHEST) preferred_element_type=float64]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  param_5.4038 = f64[10,20]{1,0} parameter(5)
  dynamic-slice.5239.3.clone.1 = f64[1,20]{1,0} dynamic-slice(param_5.4038, select.8894.29, constant_226_11), dynamic_slice_sizes={1,20}, metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/dynamic_slice[slice_sizes=(1, 20)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  bitcast.14965.3.clone.1 = f64[20]{0} bitcast(dynamic-slice.5239.3.clone.1)
  param_4.4925 = f64[20]{0} parameter(4)
  multiply.11254.3.clone.1 = f64[20]{0} multiply(bitcast.14965.3.clone.1, param_4.4925)
  reduce.105.1.clone.1 = f64[] reduce(multiply.11254.3.clone.1, constant_1586_3), dimensions={0}, to_apply=scalar_add_computation, metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/dot_general[dimension_numbers=(((0,), (0,)), ((), ())) precision=(Precision.HIGHEST, Precision.HIGHEST) preferred_element_type=float64]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  param_7.2491 = f64[10,20]{1,0} parameter(7)
  dynamic-slice.5240.3.clone.1 = f64[1,20]{1,0} dynamic-slice(param_7.2491, select.8894.29, constant_226_11), dynamic_slice_sizes={1,20}, metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/dynamic_slice[slice_sizes=(1, 20)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  bitcast.14982.3.clone.1 = f64[20]{0} bitcast(dynamic-slice.5240.3.clone.1)
  param_6.3225 = f64[20]{0} parameter(6)
  multiply.11255.3.clone.1 = f64[20]{0} multiply(bitcast.14982.3.clone.1, param_6.3225)
  reduce.106.1.clone.1 = f64[] reduce(multiply.11255.3.clone.1, constant_1586_3), dimensions={0}, to_apply=scalar_add_computation, metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/dot_general[dimension_numbers=(((0,), (0,)), ((), ())) precision=(Precision.HIGHEST, Precision.HIGHEST) preferred_element_type=float64]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  param_9.1651 = f64[10,20]{1,0} parameter(9)
  dynamic-slice.5241.3.clone.1 = f64[1,20]{1,0} dynamic-slice(param_9.1651, select.8894.29, constant_226_11), dynamic_slice_sizes={1,20}, metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/dynamic_slice[slice_sizes=(1, 20)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  bitcast.14999.3.clone.1 = f64[20]{0} bitcast(dynamic-slice.5241.3.clone.1)
  param_8.1903 = f64[20]{0} parameter(8)
  multiply.11256.3.clone.1 = f64[20]{0} multiply(bitcast.14999.3.clone.1, param_8.1903)
  reduce.107.1.clone.1 = f64[] reduce(multiply.11256.3.clone.1, constant_1586_3), dimensions={0}, to_apply=scalar_add_computation, metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/dot_general[dimension_numbers=(((0,), (0,)), ((), ())) precision=(Precision.HIGHEST, Precision.HIGHEST) preferred_element_type=float64]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  param_11.1124 = f64[10,20]{1,0} parameter(11)
  dynamic-slice.5242.3.clone.1 = f64[1,20]{1,0} dynamic-slice(param_11.1124, select.8894.29, constant_226_11), dynamic_slice_sizes={1,20}, metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/dynamic_slice[slice_sizes=(1, 20)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  bitcast.15016.3.clone.1 = f64[20]{0} bitcast(dynamic-slice.5242.3.clone.1)
  param_10.1319 = f64[20]{0} parameter(10)
  multiply.11257.3.clone.1 = f64[20]{0} multiply(bitcast.15016.3.clone.1, param_10.1319)
  reduce.108.1.clone.1 = f64[] reduce(multiply.11257.3.clone.1, constant_1586_3), dimensions={0}, to_apply=scalar_add_computation, metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/dot_general[dimension_numbers=(((0,), (0,)), ((), ())) precision=(Precision.HIGHEST, Precision.HIGHEST) preferred_element_type=float64]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  ROOT tuple.2179 = (f64[], f64[], f64[], f64[], f64[]) tuple(reduce.104.1, reduce.105.1.clone.1, reduce.106.1.clone.1, reduce.107.1.clone.1, reduce.108.1.clone.1)
} // fused_reduce

fused_multiply {
  param_5.3 = f64[10]{0} parameter(5)
  param_6.132 = s64[10]{0} parameter(6)
  constant_3324_6 = s64[] constant(9)
  param_9.19 = s64[] parameter(9)
  subtract.813.11 = s64[] subtract(constant_3324_6, param_9.19), metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/sub" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  constant_226_3 = s64[] constant(0)
  compare.2626.11 = pred[] compare(subtract.813.11, constant_226_3), direction=LT, metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/lt" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  constant_3456_6 = s64[] constant(19)
  subtract.814.11 = s64[] subtract(constant_3456_6, param_9.19), metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  select.8893.11 = s64[] select(compare.2626.11, subtract.814.11, subtract.813.11), metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  dynamic-slice.5236.7 = s64[1]{0} dynamic-slice(param_6.132, select.8893.11), dynamic_slice_sizes={1}, metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/dynamic_slice[slice_sizes=(1,)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  bitcast.14930.25 = s64[] bitcast(dynamic-slice.5236.7)
  compare.2627.9 = pred[] compare(bitcast.14930.25, constant_226_3), direction=LT, metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/lt" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  constant_228_4 = s64[] constant(10)
  add.9444.9 = s64[] add(bitcast.14930.25, constant_228_4), metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  select.8894.7 = s64[] select(compare.2627.9, add.9444.9, bitcast.14930.25), metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  dynamic-slice.5237.1 = f64[1]{0} dynamic-slice(param_5.3, select.8894.7), dynamic_slice_sizes={1}, metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/dynamic_slice[slice_sizes=(1,)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  bitcast.14941.1 = f64[] bitcast(dynamic-slice.5237.1)
  param_3.28 = f64[] parameter(3)
  param_4.22 = f64[] parameter(4)
  add.9445.1 = f64[] add(param_3.28, param_4.22), metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  param_2.41 = f64[] parameter(2)
  add.9446.1 = f64[] add(add.9445.1, param_2.41), metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  param_1.63 = f64[] parameter(1)
  add.9447.1 = f64[] add(add.9446.1, param_1.63), metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  param_0.35 = f64[] parameter(0)
  add.9448.1 = f64[] add(add.9447.1, param_0.35), metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  param_8.51 = f64[10,20]{1,0} parameter(8)
  dynamic-slice.5243.3 = f64[1,20]{1,0} dynamic-slice(param_8.51, select.8894.7, constant_226_3), dynamic_slice_sizes={1,20}, metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/dynamic_slice[slice_sizes=(1, 20)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  bitcast.15033.3 = f64[20]{0} bitcast(dynamic-slice.5243.3)
  param_7.71 = f64[20]{0} parameter(7)
  multiply.11258.3 = f64[20]{0} multiply(bitcast.15033.3, param_7.71)
  constant_1586_2 = f64[] constant(0)
  reduce.109.1 = f64[] reduce(multiply.11258.3, constant_1586_2), dimensions={0}, to_apply=scalar_add_computation, metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/dot_general[dimension_numbers=(((0,), (0,)), ((), ())) precision=(Precision.HIGHEST, Precision.HIGHEST) preferred_element_type=float64]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  add.9449.1 = f64[] add(add.9448.1, reduce.109.1), metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  ROOT multiply.11259.1 = f64[] multiply(bitcast.14941.1, add.9449.1), metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
} // fused_multiply

fused_dynamic_update_slice {
  param_0 = f64[10]{0} parameter(0)
  param_1.100 = f64[] parameter(1)
  bitcast.15136.1 = f64[1]{0} bitcast(param_1.100)
  constant_3324_3 = s64[] constant(9)
  param_2.115 = s64[] parameter(2)
  subtract.813.5 = s64[] subtract(constant_3324_3, param_2.115), metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/sub" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  constant_226_2 = s64[] constant(0)
  compare.2626.5 = pred[] compare(subtract.813.5, constant_226_2), direction=LT, metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/lt" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  constant_3456_3 = s64[] constant(19)
  subtract.814.5 = s64[] subtract(constant_3456_3, param_2.115), metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  select.8893.5 = s64[] select(compare.2626.5, subtract.814.5, subtract.813.5), metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  ROOT dynamic-update-slice.5521.1 = f64[10]{0} dynamic-update-slice(param_0, bitcast.15136.1, select.8893.5), metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/dynamic_update_slice" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
} // fused_dynamic_update_slice

fused_add {
  param_0.3 = f64[20]{0} parameter(0)
  param_2.104 = f64[] parameter(2)
  negate.1711.5 = f64[] negate(param_2.104), metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/neg" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  broadcast.4916.4 = f64[1,20]{1,0} broadcast(negate.1711.5), dimensions={}, metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  param_1.42 = f64[10,20]{1,0} parameter(1)
  param_3.110 = s64[10]{0} parameter(3)
  constant_3324_2 = s64[] constant(9)
  param_4.124 = s64[] parameter(4)
  subtract.813.3 = s64[] subtract(constant_3324_2, param_4.124), metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/sub" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  constant_226_4 = s64[] constant(0)
  compare.2626.3 = pred[] compare(subtract.813.3, constant_226_4), direction=LT, metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/lt" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  constant_3456_2 = s64[] constant(19)
  subtract.814.3 = s64[] subtract(constant_3456_2, param_4.124), metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  select.8893.3 = s64[] select(compare.2626.3, subtract.814.3, subtract.813.3), metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  dynamic-slice.5236.27 = s64[1]{0} dynamic-slice(param_3.110, select.8893.3), dynamic_slice_sizes={1}, metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/dynamic_slice[slice_sizes=(1,)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  bitcast.14930.85 = s64[] bitcast(dynamic-slice.5236.27)
  compare.2627.29 = pred[] compare(bitcast.14930.85, constant_226_4), direction=LT, metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/lt" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  constant_228_1 = s64[] constant(10)
  add.9444.29 = s64[] add(bitcast.14930.85, constant_228_1), metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  select.8894.27 = s64[] select(compare.2627.29, add.9444.29, bitcast.14930.85), metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  dynamic-slice.5247.1 = f64[1,20]{1,0} dynamic-slice(param_1.42, select.8894.27, constant_226_4), dynamic_slice_sizes={1,20}, metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/dynamic_slice[slice_sizes=(1, 20)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  multiply.11263.1 = f64[1,20]{1,0} multiply(broadcast.4916.4, dynamic-slice.5247.1), metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  bitcast.15099.1 = f64[20]{0} bitcast(multiply.11263.1)
  add.9453.1 = f64[20]{0} add(param_0.3, bitcast.15099.1), metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  param_5.4034 = f64[20]{0} parameter(5)
  param_6.3218 = f64[10,20]{1,0} parameter(6)
  dynamic-slice.5248.1.clone.1 = f64[1,20]{1,0} dynamic-slice(param_6.3218, select.8894.27, constant_226_4), dynamic_slice_sizes={1,20}, metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/dynamic_slice[slice_sizes=(1, 20)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  multiply.11264.1.clone.1 = f64[1,20]{1,0} multiply(broadcast.4916.4, dynamic-slice.5248.1.clone.1), metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  bitcast.15114.1.clone.1 = f64[20]{0} bitcast(multiply.11264.1.clone.1)
  add.9454.1.clone.1 = f64[20]{0} add(param_5.4034, bitcast.15114.1.clone.1), metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  param_7.2480 = f64[20]{0} parameter(7)
  param_8.1892 = f64[10,20]{1,0} parameter(8)
  dynamic-slice.5249.1.clone.1 = f64[1,20]{1,0} dynamic-slice(param_8.1892, select.8894.27, constant_226_4), dynamic_slice_sizes={1,20}, metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/dynamic_slice[slice_sizes=(1, 20)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  multiply.11265.1.clone.1 = f64[1,20]{1,0} multiply(broadcast.4916.4, dynamic-slice.5249.1.clone.1), metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  bitcast.15129.1.clone.1 = f64[20]{0} bitcast(multiply.11265.1.clone.1)
  add.9455.1.clone.1 = f64[20]{0} add(param_7.2480, bitcast.15129.1.clone.1), metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  param_9.1636 = f64[20]{0} parameter(9)
  param_10.1308 = f64[10,20]{1,0} parameter(10)
  dynamic-slice.5246.1.clone.1 = f64[1,20]{1,0} dynamic-slice(param_10.1308, select.8894.27, constant_226_4), dynamic_slice_sizes={1,20}, metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/dynamic_slice[slice_sizes=(1, 20)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  multiply.11262.1.clone.1 = f64[1,20]{1,0} multiply(broadcast.4916.4, dynamic-slice.5246.1.clone.1), metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  bitcast.15084.1.clone.1 = f64[20]{0} bitcast(multiply.11262.1.clone.1)
  add.9452.1.clone.1 = f64[20]{0} add(param_9.1636, bitcast.15084.1.clone.1), metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  param_11.1109 = f64[20]{0} parameter(11)
  param_12.920 = f64[10,20]{1,0} parameter(12)
  dynamic-slice.5244.1.clone.1 = f64[1,20]{1,0} dynamic-slice(param_12.920, select.8894.27, constant_226_4), dynamic_slice_sizes={1,20}, metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/dynamic_slice[slice_sizes=(1, 20)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  multiply.11260.1.clone.1 = f64[1,20]{1,0} multiply(broadcast.4916.4, dynamic-slice.5244.1.clone.1), metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  bitcast.15054.1.clone.1 = f64[20]{0} bitcast(multiply.11260.1.clone.1)
  add.9450.1.clone.1 = f64[20]{0} add(param_11.1109, bitcast.15054.1.clone.1), metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  param_13.865 = f64[20]{0} parameter(13)
  param_14.846 = f64[10,20]{1,0} parameter(14)
  dynamic-slice.5245.1.clone.1 = f64[1,20]{1,0} dynamic-slice(param_14.846, select.8894.27, constant_226_4), dynamic_slice_sizes={1,20}, metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/dynamic_slice[slice_sizes=(1, 20)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  multiply.11261.1.clone.1 = f64[1,20]{1,0} multiply(broadcast.4916.4, dynamic-slice.5245.1.clone.1), metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  bitcast.15069.1.clone.1 = f64[20]{0} bitcast(multiply.11261.1.clone.1)
  add.9451.1.clone.1 = f64[20]{0} add(param_13.865, bitcast.15069.1.clone.1), metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  ROOT tuple.2175 = (f64[20]{0}, f64[20]{0}, f64[20]{0}, f64[20]{0}, f64[20]{0}, /*index=5*/f64[20]{0}) tuple(add.9453.1, add.9454.1.clone.1, add.9455.1.clone.1, add.9452.1.clone.1, add.9450.1.clone.1, /*index=5*/add.9451.1.clone.1)
} // fused_add

fused_add.1 {
  param_0.78 = s64[] parameter(0)
  constant_227_1 = s64[] constant(1)
  ROOT add.9443.1 = s64[] add(param_0.78, constant_227_1), metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
}

command_buffer.66 {
  p.1144 = f64[20]{0} parameter(0)
  p.1145 = f64[10,20]{1,0} parameter(1)
  p.1146 = s64[10]{0} parameter(2)
  p.1147 = s64[] parameter(3)
  p.1148 = f64[20]{0} parameter(4)
  p.1149 = f64[10,20]{1,0} parameter(5)
  p.1150 = f64[20]{0} parameter(6)
  p.1151 = f64[10,20]{1,0} parameter(7)
  p.1152 = f64[20]{0} parameter(8)
  p.1153 = f64[10,20]{1,0} parameter(9)
  p.1154 = f64[20]{0} parameter(10)
  p.1155 = f64[10,20]{1,0} parameter(11)
  p.1156 = f64[10]{0} parameter(12)
  p.1157 = f64[20]{0} parameter(13)
  p.1158 = f64[10,20]{1,0} parameter(14)
  p.1159 = f64[10]{0} parameter(15)
  p.1160 = f64[10,20]{1,0} parameter(16)
  p.1161 = f64[10,20]{1,0} parameter(17)
  p.1162 = f64[10,20]{1,0} parameter(18)
  p.1163 = f64[10,20]{1,0} parameter(19)
  p.1164 = f64[10,20]{1,0} parameter(20)
  p.1165 = f64[10,20]{1,0} parameter(21)
  loop_reduce_fusion = (f64[], f64[], f64[], f64[], f64[]) fusion(p.1144, p.1145, p.1146, p.1147, p.1148, /*index=5*/p.1149, p.1150, p.1151, p.1152, p.1153, /*index=10*/p.1154, p.1155), kind=kLoop, calls=fused_reduce, metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/dot_general[dimension_numbers=(((0,), (0,)), ((), ())) precision=(Precision.HIGHEST, Precision.HIGHEST) preferred_element_type=float64]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  get-tuple-element.59119 = f64[] get-tuple-element(loop_reduce_fusion), index=4, metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/dot_general[dimension_numbers=(((0,), (0,)), ((), ())) precision=(Precision.HIGHEST, Precision.HIGHEST) preferred_element_type=float64]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  get-tuple-element.59118 = f64[] get-tuple-element(loop_reduce_fusion), index=3, metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/dot_general[dimension_numbers=(((0,), (0,)), ((), ())) precision=(Precision.HIGHEST, Precision.HIGHEST) preferred_element_type=float64]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  get-tuple-element.59117 = f64[] get-tuple-element(loop_reduce_fusion), index=2, metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/dot_general[dimension_numbers=(((0,), (0,)), ((), ())) precision=(Precision.HIGHEST, Precision.HIGHEST) preferred_element_type=float64]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  get-tuple-element.59116 = f64[] get-tuple-element(loop_reduce_fusion), index=1, metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/dot_general[dimension_numbers=(((0,), (0,)), ((), ())) precision=(Precision.HIGHEST, Precision.HIGHEST) preferred_element_type=float64]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  get-tuple-element.59115 = f64[] get-tuple-element(loop_reduce_fusion), index=0, metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/dot_general[dimension_numbers=(((0,), (0,)), ((), ())) precision=(Precision.HIGHEST, Precision.HIGHEST) preferred_element_type=float64]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  loop_multiply_fusion = f64[] fusion(get-tuple-element.59119, get-tuple-element.59118, get-tuple-element.59117, get-tuple-element.59115, get-tuple-element.59116, /*index=5*/p.1156, p.1146, p.1157, p.1158, p.1147), kind=kLoop, calls=fused_multiply, metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  loop_dynamic_update_slice_fusion = f64[10]{0} fusion(p.1159, loop_multiply_fusion, p.1147), kind=kLoop, calls=fused_dynamic_update_slice, metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/dynamic_update_slice" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  loop_add_fusion = (f64[20]{0}, f64[20]{0}, f64[20]{0}, f64[20]{0}, f64[20]{0}, /*index=5*/f64[20]{0}) fusion(p.1152, p.1160, loop_multiply_fusion, p.1146, p.1147, /*index=5*/p.1154, p.1161, p.1157, p.1162, p.1150, /*index=10*/p.1163, p.1144, p.1164, p.1148, p.1165), kind=kLoop, calls=fused_add, control-predecessors={loop_reduce_fusion, loop_multiply_fusion}, metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  loop_add_fusion.1 = s64[] fusion(p.1147), kind=kLoop, calls=fused_add.1, control-predecessors={loop_reduce_fusion, loop_multiply_fusion, loop_dynamic_update_slice_fusion, loop_add_fusion}, metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332 deduplicated_name="loop_add_fusion.1"}
  ROOT tuple.2582 = (f64[10]{0}, (f64[20]{0}, f64[20]{0}, f64[20]{0}, f64[20]{0}, f64[20]{0}, /*index=5*/f64[20]{0}), s64[]) tuple(loop_dynamic_update_slice_fusion, loop_add_fusion, loop_add_fusion.1)
} // command_buffer.66

region_1.202 {
  arg_tuple.203.0 = (s64[], f64[20]{0}, f64[20]{0}, f64[20]{0}, f64[20]{0}, /*index=5*/f64[20]{0}, f64[20]{0}, f64[10]{0}, s64[10]{0}, f64[10,20]{1,0}, /*index=10*/f64[10,20]{1,0}, f64[10,20]{1,0}, f64[10,20]{1,0}, f64[10,20]{1,0}, f64[10,20]{1,0}, /*index=15*/f64[10,20]{1,0}, f64[10,20]{1,0}, f64[10,20]{1,0}, f64[10,20]{1,0}, f64[10,20]{1,0}, /*index=20*/f64[10,20]{1,0}, f64[10]{0}) parameter(0)
  get-tuple-element.60874 = s64[] get-tuple-element(arg_tuple.203.0), index=0
  get-tuple-element.60904 = s64[10]{0} get-tuple-element(arg_tuple.203.0), index=8
  get-tuple-element.60875 = f64[20]{0} get-tuple-element(arg_tuple.203.0), index=1
  get-tuple-element.60876 = f64[20]{0} get-tuple-element(arg_tuple.203.0), index=2
  get-tuple-element.60877 = f64[20]{0} get-tuple-element(arg_tuple.203.0), index=3
  get-tuple-element.60878 = f64[20]{0} get-tuple-element(arg_tuple.203.0), index=4
  get-tuple-element.60879 = f64[20]{0} get-tuple-element(arg_tuple.203.0), index=5
  get-tuple-element.60880 = f64[20]{0} get-tuple-element(arg_tuple.203.0), index=6
  get-tuple-element.60905 = f64[10,20]{1,0} get-tuple-element(arg_tuple.203.0), index=9
  get-tuple-element.60906 = f64[10,20]{1,0} get-tuple-element(arg_tuple.203.0), index=10
  get-tuple-element.60907 = f64[10,20]{1,0} get-tuple-element(arg_tuple.203.0), index=11
  get-tuple-element.60908 = f64[10,20]{1,0} get-tuple-element(arg_tuple.203.0), index=12
  get-tuple-element.60909 = f64[10,20]{1,0} get-tuple-element(arg_tuple.203.0), index=13
  get-tuple-element.60910 = f64[10,20]{1,0} get-tuple-element(arg_tuple.203.0), index=14
  get-tuple-element.60911 = f64[10,20]{1,0} get-tuple-element(arg_tuple.203.0), index=15
  get-tuple-element.60912 = f64[10,20]{1,0} get-tuple-element(arg_tuple.203.0), index=16
  get-tuple-element.60913 = f64[10,20]{1,0} get-tuple-element(arg_tuple.203.0), index=17
  get-tuple-element.60914 = f64[10,20]{1,0} get-tuple-element(arg_tuple.203.0), index=18
  get-tuple-element.60915 = f64[10,20]{1,0} get-tuple-element(arg_tuple.203.0), index=19
  get-tuple-element.60916 = f64[10,20]{1,0} get-tuple-element(arg_tuple.203.0), index=20
  get-tuple-element.60917 = f64[10]{0} get-tuple-element(arg_tuple.203.0), index=21
  get-tuple-element.60881 = f64[10]{0} get-tuple-element(arg_tuple.203.0), index=7
  call.51 = (f64[10]{0}, (f64[20]{0}, f64[20]{0}, f64[20]{0}, f64[20]{0}, f64[20]{0}, /*index=5*/f64[20]{0}), s64[]) call(get-tuple-element.60875, get-tuple-element.60905, get-tuple-element.60904, get-tuple-element.60874, get-tuple-element.60876, /*index=5*/get-tuple-element.60906, get-tuple-element.60877, get-tuple-element.60907, get-tuple-element.60878, get-tuple-element.60908, /*index=10*/get-tuple-element.60879, get-tuple-element.60909, get-tuple-element.60917, get-tuple-element.60880, get-tuple-element.60910, /*index=15*/get-tuple-element.60881, get-tuple-element.60914, get-tuple-element.60915, get-tuple-element.60916, get-tuple-element.60913, /*index=20*/get-tuple-element.60911, get-tuple-element.60912), to_apply=command_buffer.66
  get-tuple-element.63870 = f64[10]{0} get-tuple-element(call.51), index=0
  get-tuple-element.63871 = (f64[20]{0}, f64[20]{0}, f64[20]{0}, f64[20]{0}, f64[20]{0}, /*index=5*/f64[20]{0}) get-tuple-element(call.51), index=1
  get-tuple-element.63872 = s64[] get-tuple-element(call.51), index=2
  get-tuple-element.60898 = f64[20]{0} get-tuple-element(get-tuple-element.63871), index=5, metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  get-tuple-element.60897 = f64[20]{0} get-tuple-element(get-tuple-element.63871), index=4, metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  get-tuple-element.60899 = f64[20]{0} get-tuple-element(get-tuple-element.63871), index=3, metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  get-tuple-element.60902 = f64[20]{0} get-tuple-element(get-tuple-element.63871), index=2, metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  get-tuple-element.60901 = f64[20]{0} get-tuple-element(get-tuple-element.63871), index=1, metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  get-tuple-element.60900 = f64[20]{0} get-tuple-element(get-tuple-element.63871), index=0, metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  ROOT tuple.2486 = (s64[], f64[20]{0}, f64[20]{0}, f64[20]{0}, f64[20]{0}, /*index=5*/f64[20]{0}, f64[20]{0}, f64[10]{0}, s64[10]{0}, f64[10,20]{1,0}, /*index=10*/f64[10,20]{1,0}, f64[10,20]{1,0}, f64[10,20]{1,0}, f64[10,20]{1,0}, f64[10,20]{1,0}, /*index=15*/f64[10,20]{1,0}, f64[10,20]{1,0}, f64[10,20]{1,0}, f64[10,20]{1,0}, f64[10,20]{1,0}, /*index=20*/f64[10,20]{1,0}, f64[10]{0}) tuple(get-tuple-element.63872, get-tuple-element.60897, get-tuple-element.60898, get-tuple-element.60899, get-tuple-element.60900, /*index=5*/get-tuple-element.60901, get-tuple-element.60902, get-tuple-element.63870, get-tuple-element.60904, get-tuple-element.60905, /*index=10*/get-tuple-element.60906, get-tuple-element.60907, get-tuple-element.60908, get-tuple-element.60909, get-tuple-element.60910, /*index=15*/get-tuple-element.60911, get-tuple-element.60912, get-tuple-element.60913, get-tuple-element.60914, get-tuple-element.60915, /*index=20*/get-tuple-element.60916, get-tuple-element.60917)
} // region_1.202

fused_compare {
  param_0.84 = s64[] parameter(0)
  constant_275_1 = s64[] constant(10)
  ROOT compare.2628.1 = pred[] compare(param_0.84, constant_275_1), direction=LT, metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/cond/lt" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
}

region_2.251 {
  arg_tuple.252.0 = (s64[], f64[20]{0}, f64[20]{0}, f64[20]{0}, f64[20]{0}, /*index=5*/f64[20]{0}, f64[20]{0}, f64[10]{0}, s64[10]{0}, f64[10,20]{1,0}, /*index=10*/f64[10,20]{1,0}, f64[10,20]{1,0}, f64[10,20]{1,0}, f64[10,20]{1,0}, f64[10,20]{1,0}, /*index=15*/f64[10,20]{1,0}, f64[10,20]{1,0}, f64[10,20]{1,0}, f64[10,20]{1,0}, f64[10,20]{1,0}, /*index=20*/f64[10,20]{1,0}, f64[10]{0}) parameter(0)
  get-tuple-element.253.0 = s64[] get-tuple-element(arg_tuple.252.0), index=0
  ROOT loop_compare_fusion = pred[] fusion(get-tuple-element.253.0), kind=kLoop, calls=fused_compare, metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/cond/lt" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332 deduplicated_name="loop_compare_fusion"}
}

fused_add.2 {
  param_0.88 = f64[20]{0} parameter(0)
  param_2.201 = f64[] parameter(2)
  broadcast.4917.3 = f64[1,20]{1,0} broadcast(param_2.201), dimensions={}, metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  param_1.160 = f64[10,20]{1,0} parameter(1)
  param_3.200 = s64[10]{0} parameter(3)
  param_4.204 = s64[] parameter(4)
  constant_1932_8 = s64[] constant(0)
  compare.2629.29 = pred[] compare(param_4.204, constant_1932_8), direction=LT, metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/lt" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  constant_1931_1 = s64[] constant(10)
  add.9457.29 = s64[] add(param_4.204, constant_1931_1), metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  select.8895.29 = s64[] select(compare.2629.29, add.9457.29, param_4.204), metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  dynamic-slice.5251.25 = s64[1]{0} dynamic-slice(param_3.200, select.8895.29), dynamic_slice_sizes={1}, metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/dynamic_slice[slice_sizes=(1,)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  bitcast.15182.79 = s64[] bitcast(dynamic-slice.5251.25)
  compare.2630.27 = pred[] compare(bitcast.15182.79, constant_1932_8), direction=LT, metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/lt" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  add.9458.27 = s64[] add(bitcast.15182.79, constant_1931_1), metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  select.8896.25 = s64[] select(compare.2630.27, add.9458.27, bitcast.15182.79), metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  dynamic-slice.5261.1 = f64[1,20]{1,0} dynamic-slice(param_1.160, select.8896.25, constant_1932_8), dynamic_slice_sizes={1,20}, metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/dynamic_slice[slice_sizes=(1, 20)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  multiply.11275.1 = f64[1,20]{1,0} multiply(broadcast.4917.3, dynamic-slice.5261.1), metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  bitcast.15339.1 = f64[20]{0} bitcast(multiply.11275.1)
  add.9466.1 = f64[20]{0} add(param_0.88, bitcast.15339.1), metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  param_5.4039 = f64[20]{0} parameter(5)
  param_6.3229 = f64[10,20]{1,0} parameter(6)
  dynamic-slice.5263.1.clone.1 = f64[1,20]{1,0} dynamic-slice(param_6.3229, select.8896.25, constant_1932_8), dynamic_slice_sizes={1,20}, metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/dynamic_slice[slice_sizes=(1, 20)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  multiply.11277.1.clone.1 = f64[1,20]{1,0} multiply(broadcast.4917.3, dynamic-slice.5263.1.clone.1), metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  bitcast.15369.1.clone.1 = f64[20]{0} bitcast(multiply.11277.1.clone.1)
  add.9468.1.clone.1 = f64[20]{0} add(param_5.4039, bitcast.15369.1.clone.1), metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  param_7.2494 = f64[20]{0} parameter(7)
  param_8.1909 = f64[10,20]{1,0} parameter(8)
  dynamic-slice.5264.1.clone.1 = f64[1,20]{1,0} dynamic-slice(param_8.1909, select.8896.25, constant_1932_8), dynamic_slice_sizes={1,20}, metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/dynamic_slice[slice_sizes=(1, 20)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  multiply.11278.1.clone.1 = f64[1,20]{1,0} multiply(broadcast.4917.3, dynamic-slice.5264.1.clone.1), metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  bitcast.15384.1.clone.1 = f64[20]{0} bitcast(multiply.11278.1.clone.1)
  add.9469.1.clone.1 = f64[20]{0} add(param_7.2494, bitcast.15384.1.clone.1), metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  param_9.1659 = f64[20]{0} parameter(9)
  param_10.1331 = f64[10,20]{1,0} parameter(10)
  dynamic-slice.5262.1.clone.1 = f64[1,20]{1,0} dynamic-slice(param_10.1331, select.8896.25, constant_1932_8), dynamic_slice_sizes={1,20}, metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/dynamic_slice[slice_sizes=(1, 20)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  multiply.11276.1.clone.1 = f64[1,20]{1,0} multiply(broadcast.4917.3, dynamic-slice.5262.1.clone.1), metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  bitcast.15354.1.clone.1 = f64[20]{0} bitcast(multiply.11276.1.clone.1)
  add.9467.1.clone.1 = f64[20]{0} add(param_9.1659, bitcast.15354.1.clone.1), metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  param_11.1135 = f64[20]{0} parameter(11)
  param_12.940 = f64[10,20]{1,0} parameter(12)
  dynamic-slice.5259.1.clone.1 = f64[1,20]{1,0} dynamic-slice(param_12.940, select.8896.25, constant_1932_8), dynamic_slice_sizes={1,20}, metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/dynamic_slice[slice_sizes=(1, 20)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  multiply.11273.1.clone.1 = f64[1,20]{1,0} multiply(broadcast.4917.3, dynamic-slice.5259.1.clone.1), metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  bitcast.15309.1.clone.1 = f64[20]{0} bitcast(multiply.11273.1.clone.1)
  add.9464.1.clone.1 = f64[20]{0} add(param_11.1135, bitcast.15309.1.clone.1), metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  param_13.887 = f64[20]{0} parameter(13)
  param_14.862 = f64[10,20]{1,0} parameter(14)
  dynamic-slice.5260.1.clone.1 = f64[1,20]{1,0} dynamic-slice(param_14.862, select.8896.25, constant_1932_8), dynamic_slice_sizes={1,20}, metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/dynamic_slice[slice_sizes=(1, 20)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  multiply.11274.1.clone.1 = f64[1,20]{1,0} multiply(broadcast.4917.3, dynamic-slice.5260.1.clone.1), metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  bitcast.15324.1.clone.1 = f64[20]{0} bitcast(multiply.11274.1.clone.1)
  add.9465.1.clone.1 = f64[20]{0} add(param_13.887, bitcast.15324.1.clone.1), metadata={op_name="jit(while)/jit(main)/while/body/jit(update)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
