HloModule jit_convert_element_type, entry_computation_layout={(pred[120,120]{1,0})->f64[120,120]{1,0}}, allow_spmd_sharding_propagation_to_parameters={true}, allow_spmd_sharding_propagation_to_output={true}

ENTRY main.3 {
  Arg_0.1 = pred[120,120]{1,0} parameter(0), metadata={op_name="args[0]"}
  ROOT convert.2 = f64[120,120]{1,0} convert(Arg_0.1), metadata={op_name="jit(convert_element_type)/jit(main)/convert_element_type[new_dtype=float64 weak_type=False sharding=None]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=388}
}

