HloModule jit_update, is_scheduled=true, entry_computation_layout={(f64[20]{0}, f64[20]{0}, f64[20]{0}, f64[20]{0}, f64[20]{0}, /*index=5*/f64[20]{0}, s64[], f64[], f64[20]{0}, f64[20]{0}, /*index=10*/f64[20]{0}, f64[20]{0}, f64[20]{0}, f64[20]{0}, f64[], /*index=15*/f64[10,20]{1,0}, f64[10,20]{1,0}, f64[10,20]{1,0}, f64[10,20]{1,0}, f64[10,20]{1,0}, /*index=20*/f64[10,20]{1,0}, f64[10,20]{1,0}, f64[10,20]{1,0}, f64[10,20]{1,0}, f64[10,20]{1,0}, /*index=25*/f64[10,20]{1,0}, f64[10,20]{1,0}, f64[10]{0}, f64[], s32[], /*index=30*/s32[], s32[])->(f64[20]{0}, f64[20]{0}, f64[20]{0}, f64[20]{0}, f64[20]{0}, /*index=5*/f64[20]{0}, s64[], f64[], f64[20]{0}, f64[20]{0}, /*index=10*/f64[20]{0}, f64[20]{0}, f64[20]{0}, f64[20]{0}, f64[], /*index=15*/f64[], f64[10,20]{1,0}, f64[10,20]{1,0}, f64[10,20]{1,0}, f64[10,20]{1,0}, /*index=20*/f64[10,20]{1,0}, f64[10,20]{1,0}, f64[10,20]{1,0}, f64[10,20]{1,0}, f64[10,20]{1,0}, /*index=25*/f64[10,20]{1,0}, f64[10,20]{1,0}, f64[10,20]{1,0}, f64[10]{0}, f64[], /*index=30*/pred[], s32[], s32[], s32[])}, allow_spmd_sharding_propagation_to_parameters={true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true}, allow_spmd_sharding_propagation_to_output={true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true}, frontend_attributes={fingerprint_before_lhs="44183225aaf7d94a97a152e32dc07e90"}

scalar_add_computation {
  scalar_rhs = f64[] parameter(1)
  scalar_lhs = f64[] parameter(0)
  ROOT add.8784 = f64[] add(scalar_lhs, scalar_rhs)
}

fused_reduce {
  param_1.114 = f64[10,20]{1,0} parameter(1)
  param_2.111 = s64[10]{0} parameter(2)
  constant_2517_7 = s64[] constant(9)
  param_3.126 = s64[] parameter(3)
  subtract.698.13 = s64[] subtract(constant_2517_7, param_3.126), metadata={op_name="jit(update)/jit(main)/while/body/sub" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  constant_319_11 = s64[] constant(0)
  compare.2292.13 = pred[] compare(subtract.698.13, constant_319_11), direction=LT, metadata={op_name="jit(update)/jit(main)/while/body/lt" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  constant_2647_7 = s64[] constant(19)
  subtract.699.13 = s64[] subtract(constant_2647_7, param_3.126), metadata={op_name="jit(update)/jit(main)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  select.7891.13 = s64[] select(compare.2292.13, subtract.699.13, subtract.698.13), metadata={op_name="jit(update)/jit(main)/while/body/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  dynamic-slice.4907.29 = s64[1]{0} dynamic-slice(param_2.111, select.7891.13), dynamic_slice_sizes={1}, metadata={op_name="jit(update)/jit(main)/while/body/dynamic_slice[slice_sizes=(1,)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  bitcast.14764.91 = s64[] bitcast(dynamic-slice.4907.29)
  compare.2293.31 = pred[] compare(bitcast.14764.91, constant_319_11), direction=LT, metadata={op_name="jit(update)/jit(main)/while/body/lt" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  constant_321_5 = s64[] constant(10)
  add.8786.31 = s64[] add(bitcast.14764.91, constant_321_5), metadata={op_name="jit(update)/jit(main)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  select.7892.29 = s64[] select(compare.2293.31, add.8786.31, bitcast.14764.91), metadata={op_name="jit(update)/jit(main)/while/body/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  dynamic-slice.4909.3 = f64[1,20]{1,0} dynamic-slice(param_1.114, select.7892.29, constant_319_11), dynamic_slice_sizes={1,20}, metadata={op_name="jit(update)/jit(main)/while/body/dynamic_slice[slice_sizes=(1, 20)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  bitcast.14784.3 = f64[20]{0} bitcast(dynamic-slice.4909.3)
  param_0.80 = f64[20]{0} parameter(0)
  multiply.10566.3 = f64[20]{0} multiply(bitcast.14784.3, param_0.80)
  constant_1432_3 = f64[] constant(0)
  reduce.65.1 = f64[] reduce(multiply.10566.3, constant_1432_3), dimensions={0}, to_apply=scalar_add_computation, metadata={op_name="jit(update)/jit(main)/while/body/dot_general[dimension_numbers=(((0,), (0,)), ((), ())) precision=(Precision.HIGHEST, Precision.HIGHEST) preferred_element_type=float64]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  param_5.4017 = f64[10,20]{1,0} parameter(5)
  dynamic-slice.4910.3.clone.1 = f64[1,20]{1,0} dynamic-slice(param_5.4017, select.7892.29, constant_319_11), dynamic_slice_sizes={1,20}, metadata={op_name="jit(update)/jit(main)/while/body/dynamic_slice[slice_sizes=(1, 20)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  bitcast.14799.3.clone.1 = f64[20]{0} bitcast(dynamic-slice.4910.3.clone.1)
  param_4.4913 = f64[20]{0} parameter(4)
  multiply.10567.3.clone.1 = f64[20]{0} multiply(bitcast.14799.3.clone.1, param_4.4913)
  reduce.66.1.clone.1 = f64[] reduce(multiply.10567.3.clone.1, constant_1432_3), dimensions={0}, to_apply=scalar_add_computation, metadata={op_name="jit(update)/jit(main)/while/body/dot_general[dimension_numbers=(((0,), (0,)), ((), ())) precision=(Precision.HIGHEST, Precision.HIGHEST) preferred_element_type=float64]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  param_7.2467 = f64[10,20]{1,0} parameter(7)
  dynamic-slice.4911.3.clone.1 = f64[1,20]{1,0} dynamic-slice(param_7.2467, select.7892.29, constant_319_11), dynamic_slice_sizes={1,20}, metadata={op_name="jit(update)/jit(main)/while/body/dynamic_slice[slice_sizes=(1, 20)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  bitcast.14816.3.clone.1 = f64[20]{0} bitcast(dynamic-slice.4911.3.clone.1)
  param_6.3211 = f64[20]{0} parameter(6)
  multiply.10568.3.clone.1 = f64[20]{0} multiply(bitcast.14816.3.clone.1, param_6.3211)
  reduce.67.1.clone.1 = f64[] reduce(multiply.10568.3.clone.1, constant_1432_3), dimensions={0}, to_apply=scalar_add_computation, metadata={op_name="jit(update)/jit(main)/while/body/dot_general[dimension_numbers=(((0,), (0,)), ((), ())) precision=(Precision.HIGHEST, Precision.HIGHEST) preferred_element_type=float64]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  param_9.1650 = f64[10,20]{1,0} parameter(9)
  dynamic-slice.4912.3.clone.1 = f64[1,20]{1,0} dynamic-slice(param_9.1650, select.7892.29, constant_319_11), dynamic_slice_sizes={1,20}, metadata={op_name="jit(update)/jit(main)/while/body/dynamic_slice[slice_sizes=(1, 20)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  bitcast.14833.3.clone.1 = f64[20]{0} bitcast(dynamic-slice.4912.3.clone.1)
  param_8.1894 = f64[20]{0} parameter(8)
  multiply.10569.3.clone.1 = f64[20]{0} multiply(bitcast.14833.3.clone.1, param_8.1894)
  reduce.68.1.clone.1 = f64[] reduce(multiply.10569.3.clone.1, constant_1432_3), dimensions={0}, to_apply=scalar_add_computation, metadata={op_name="jit(update)/jit(main)/while/body/dot_general[dimension_numbers=(((0,), (0,)), ((), ())) precision=(Precision.HIGHEST, Precision.HIGHEST) preferred_element_type=float64]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  param_11.1122 = f64[10,20]{1,0} parameter(11)
  dynamic-slice.4913.3.clone.1 = f64[1,20]{1,0} dynamic-slice(param_11.1122, select.7892.29, constant_319_11), dynamic_slice_sizes={1,20}, metadata={op_name="jit(update)/jit(main)/while/body/dynamic_slice[slice_sizes=(1, 20)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  bitcast.14850.3.clone.1 = f64[20]{0} bitcast(dynamic-slice.4913.3.clone.1)
  param_10.1318 = f64[20]{0} parameter(10)
  multiply.10570.3.clone.1 = f64[20]{0} multiply(bitcast.14850.3.clone.1, param_10.1318)
  reduce.69.1.clone.1 = f64[] reduce(multiply.10570.3.clone.1, constant_1432_3), dimensions={0}, to_apply=scalar_add_computation, metadata={op_name="jit(update)/jit(main)/while/body/dot_general[dimension_numbers=(((0,), (0,)), ((), ())) precision=(Precision.HIGHEST, Precision.HIGHEST) preferred_element_type=float64]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  ROOT tuple.1842 = (f64[], f64[], f64[], f64[], f64[]) tuple(reduce.65.1, reduce.66.1.clone.1, reduce.67.1.clone.1, reduce.68.1.clone.1, reduce.69.1.clone.1)
} // fused_reduce

fused_multiply {
  param_5.3 = f64[10]{0} parameter(5)
  param_6.132 = s64[10]{0} parameter(6)
  constant_2517_6 = s64[] constant(9)
  param_9.19 = s64[] parameter(9)
  subtract.698.11 = s64[] subtract(constant_2517_6, param_9.19), metadata={op_name="jit(update)/jit(main)/while/body/sub" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  constant_319_3 = s64[] constant(0)
  compare.2292.11 = pred[] compare(subtract.698.11, constant_319_3), direction=LT, metadata={op_name="jit(update)/jit(main)/while/body/lt" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  constant_2647_6 = s64[] constant(19)
  subtract.699.11 = s64[] subtract(constant_2647_6, param_9.19), metadata={op_name="jit(update)/jit(main)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  select.7891.11 = s64[] select(compare.2292.11, subtract.699.11, subtract.698.11), metadata={op_name="jit(update)/jit(main)/while/body/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  dynamic-slice.4907.7 = s64[1]{0} dynamic-slice(param_6.132, select.7891.11), dynamic_slice_sizes={1}, metadata={op_name="jit(update)/jit(main)/while/body/dynamic_slice[slice_sizes=(1,)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  bitcast.14764.25 = s64[] bitcast(dynamic-slice.4907.7)
  compare.2293.9 = pred[] compare(bitcast.14764.25, constant_319_3), direction=LT, metadata={op_name="jit(update)/jit(main)/while/body/lt" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  constant_321_4 = s64[] constant(10)
  add.8786.9 = s64[] add(bitcast.14764.25, constant_321_4), metadata={op_name="jit(update)/jit(main)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  select.7892.7 = s64[] select(compare.2293.9, add.8786.9, bitcast.14764.25), metadata={op_name="jit(update)/jit(main)/while/body/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  dynamic-slice.4908.1 = f64[1]{0} dynamic-slice(param_5.3, select.7892.7), dynamic_slice_sizes={1}, metadata={op_name="jit(update)/jit(main)/while/body/dynamic_slice[slice_sizes=(1,)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  bitcast.14775.1 = f64[] bitcast(dynamic-slice.4908.1)
  param_3.28 = f64[] parameter(3)
  param_4.22 = f64[] parameter(4)
  add.8787.1 = f64[] add(param_3.28, param_4.22), metadata={op_name="jit(update)/jit(main)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  param_2.41 = f64[] parameter(2)
  add.8788.1 = f64[] add(add.8787.1, param_2.41), metadata={op_name="jit(update)/jit(main)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  param_1.63 = f64[] parameter(1)
  add.8789.1 = f64[] add(add.8788.1, param_1.63), metadata={op_name="jit(update)/jit(main)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  param_0.35 = f64[] parameter(0)
  add.8790.1 = f64[] add(add.8789.1, param_0.35), metadata={op_name="jit(update)/jit(main)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  param_8.51 = f64[10,20]{1,0} parameter(8)
  dynamic-slice.4914.3 = f64[1,20]{1,0} dynamic-slice(param_8.51, select.7892.7, constant_319_3), dynamic_slice_sizes={1,20}, metadata={op_name="jit(update)/jit(main)/while/body/dynamic_slice[slice_sizes=(1, 20)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  bitcast.14867.3 = f64[20]{0} bitcast(dynamic-slice.4914.3)
  param_7.71 = f64[20]{0} parameter(7)
  multiply.10571.3 = f64[20]{0} multiply(bitcast.14867.3, param_7.71)
  constant_1432_2 = f64[] constant(0)
  reduce.70.1 = f64[] reduce(multiply.10571.3, constant_1432_2), dimensions={0}, to_apply=scalar_add_computation, metadata={op_name="jit(update)/jit(main)/while/body/dot_general[dimension_numbers=(((0,), (0,)), ((), ())) precision=(Precision.HIGHEST, Precision.HIGHEST) preferred_element_type=float64]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  add.8791.1 = f64[] add(add.8790.1, reduce.70.1), metadata={op_name="jit(update)/jit(main)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  ROOT multiply.10572.1 = f64[] multiply(bitcast.14775.1, add.8791.1), metadata={op_name="jit(update)/jit(main)/while/body/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
} // fused_multiply

fused_dynamic_update_slice {
  param_0 = f64[10]{0} parameter(0)
  param_1.100 = f64[] parameter(1)
  bitcast.14970.1 = f64[1]{0} bitcast(param_1.100)
  constant_2517_3 = s64[] constant(9)
  param_2.115 = s64[] parameter(2)
  subtract.698.5 = s64[] subtract(constant_2517_3, param_2.115), metadata={op_name="jit(update)/jit(main)/while/body/sub" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  constant_319_2 = s64[] constant(0)
  compare.2292.5 = pred[] compare(subtract.698.5, constant_319_2), direction=LT, metadata={op_name="jit(update)/jit(main)/while/body/lt" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  constant_2647_3 = s64[] constant(19)
  subtract.699.5 = s64[] subtract(constant_2647_3, param_2.115), metadata={op_name="jit(update)/jit(main)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  select.7891.5 = s64[] select(compare.2292.5, subtract.699.5, subtract.698.5), metadata={op_name="jit(update)/jit(main)/while/body/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  ROOT dynamic-update-slice.5402.1 = f64[10]{0} dynamic-update-slice(param_0, bitcast.14970.1, select.7891.5), metadata={op_name="jit(update)/jit(main)/while/body/dynamic_update_slice" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
} // fused_dynamic_update_slice

fused_add {
  param_0.3 = f64[20]{0} parameter(0)
  param_2.104 = f64[] parameter(2)
  negate.1614.5 = f64[] negate(param_2.104), metadata={op_name="jit(update)/jit(main)/while/body/neg" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  broadcast.4274.4 = f64[1,20]{1,0} broadcast(negate.1614.5), dimensions={}, metadata={op_name="jit(update)/jit(main)/while/body/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  param_1.42 = f64[10,20]{1,0} parameter(1)
  param_3.110 = s64[10]{0} parameter(3)
  constant_2517_2 = s64[] constant(9)
  param_4.124 = s64[] parameter(4)
  subtract.698.3 = s64[] subtract(constant_2517_2, param_4.124), metadata={op_name="jit(update)/jit(main)/while/body/sub" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  constant_319_4 = s64[] constant(0)
  compare.2292.3 = pred[] compare(subtract.698.3, constant_319_4), direction=LT, metadata={op_name="jit(update)/jit(main)/while/body/lt" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  constant_2647_2 = s64[] constant(19)
  subtract.699.3 = s64[] subtract(constant_2647_2, param_4.124), metadata={op_name="jit(update)/jit(main)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  select.7891.3 = s64[] select(compare.2292.3, subtract.699.3, subtract.698.3), metadata={op_name="jit(update)/jit(main)/while/body/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  dynamic-slice.4907.27 = s64[1]{0} dynamic-slice(param_3.110, select.7891.3), dynamic_slice_sizes={1}, metadata={op_name="jit(update)/jit(main)/while/body/dynamic_slice[slice_sizes=(1,)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  bitcast.14764.85 = s64[] bitcast(dynamic-slice.4907.27)
  compare.2293.29 = pred[] compare(bitcast.14764.85, constant_319_4), direction=LT, metadata={op_name="jit(update)/jit(main)/while/body/lt" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  constant_321_1 = s64[] constant(10)
  add.8786.29 = s64[] add(bitcast.14764.85, constant_321_1), metadata={op_name="jit(update)/jit(main)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  select.7892.27 = s64[] select(compare.2293.29, add.8786.29, bitcast.14764.85), metadata={op_name="jit(update)/jit(main)/while/body/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  dynamic-slice.4918.1 = f64[1,20]{1,0} dynamic-slice(param_1.42, select.7892.27, constant_319_4), dynamic_slice_sizes={1,20}, metadata={op_name="jit(update)/jit(main)/while/body/dynamic_slice[slice_sizes=(1, 20)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  multiply.10576.1 = f64[1,20]{1,0} multiply(broadcast.4274.4, dynamic-slice.4918.1), metadata={op_name="jit(update)/jit(main)/while/body/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  bitcast.14933.1 = f64[20]{0} bitcast(multiply.10576.1)
  add.8795.1 = f64[20]{0} add(param_0.3, bitcast.14933.1), metadata={op_name="jit(update)/jit(main)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  param_5.4013 = f64[20]{0} parameter(5)
  param_6.3204 = f64[10,20]{1,0} parameter(6)
  dynamic-slice.4919.1.clone.1 = f64[1,20]{1,0} dynamic-slice(param_6.3204, select.7892.27, constant_319_4), dynamic_slice_sizes={1,20}, metadata={op_name="jit(update)/jit(main)/while/body/dynamic_slice[slice_sizes=(1, 20)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  multiply.10577.1.clone.1 = f64[1,20]{1,0} multiply(broadcast.4274.4, dynamic-slice.4919.1.clone.1), metadata={op_name="jit(update)/jit(main)/while/body/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  bitcast.14948.1.clone.1 = f64[20]{0} bitcast(multiply.10577.1.clone.1)
  add.8796.1.clone.1 = f64[20]{0} add(param_5.4013, bitcast.14948.1.clone.1), metadata={op_name="jit(update)/jit(main)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  param_7.2456 = f64[20]{0} parameter(7)
  param_8.1883 = f64[10,20]{1,0} parameter(8)
  dynamic-slice.4920.1.clone.1 = f64[1,20]{1,0} dynamic-slice(param_8.1883, select.7892.27, constant_319_4), dynamic_slice_sizes={1,20}, metadata={op_name="jit(update)/jit(main)/while/body/dynamic_slice[slice_sizes=(1, 20)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  multiply.10578.1.clone.1 = f64[1,20]{1,0} multiply(broadcast.4274.4, dynamic-slice.4920.1.clone.1), metadata={op_name="jit(update)/jit(main)/while/body/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  bitcast.14963.1.clone.1 = f64[20]{0} bitcast(multiply.10578.1.clone.1)
  add.8797.1.clone.1 = f64[20]{0} add(param_7.2456, bitcast.14963.1.clone.1), metadata={op_name="jit(update)/jit(main)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  param_9.1635 = f64[20]{0} parameter(9)
  param_10.1307 = f64[10,20]{1,0} parameter(10)
  dynamic-slice.4917.1.clone.1 = f64[1,20]{1,0} dynamic-slice(param_10.1307, select.7892.27, constant_319_4), dynamic_slice_sizes={1,20}, metadata={op_name="jit(update)/jit(main)/while/body/dynamic_slice[slice_sizes=(1, 20)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  multiply.10575.1.clone.1 = f64[1,20]{1,0} multiply(broadcast.4274.4, dynamic-slice.4917.1.clone.1), metadata={op_name="jit(update)/jit(main)/while/body/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  bitcast.14918.1.clone.1 = f64[20]{0} bitcast(multiply.10575.1.clone.1)
  add.8794.1.clone.1 = f64[20]{0} add(param_9.1635, bitcast.14918.1.clone.1), metadata={op_name="jit(update)/jit(main)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  param_11.1107 = f64[20]{0} parameter(11)
  param_12.917 = f64[10,20]{1,0} parameter(12)
  dynamic-slice.4915.1.clone.1 = f64[1,20]{1,0} dynamic-slice(param_12.917, select.7892.27, constant_319_4), dynamic_slice_sizes={1,20}, metadata={op_name="jit(update)/jit(main)/while/body/dynamic_slice[slice_sizes=(1, 20)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  multiply.10573.1.clone.1 = f64[1,20]{1,0} multiply(broadcast.4274.4, dynamic-slice.4915.1.clone.1), metadata={op_name="jit(update)/jit(main)/while/body/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  bitcast.14888.1.clone.1 = f64[20]{0} bitcast(multiply.10573.1.clone.1)
  add.8792.1.clone.1 = f64[20]{0} add(param_11.1107, bitcast.14888.1.clone.1), metadata={op_name="jit(update)/jit(main)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  param_13.863 = f64[20]{0} parameter(13)
  param_14.845 = f64[10,20]{1,0} parameter(14)
  dynamic-slice.4916.1.clone.1 = f64[1,20]{1,0} dynamic-slice(param_14.845, select.7892.27, constant_319_4), dynamic_slice_sizes={1,20}, metadata={op_name="jit(update)/jit(main)/while/body/dynamic_slice[slice_sizes=(1, 20)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  multiply.10574.1.clone.1 = f64[1,20]{1,0} multiply(broadcast.4274.4, dynamic-slice.4916.1.clone.1), metadata={op_name="jit(update)/jit(main)/while/body/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  bitcast.14903.1.clone.1 = f64[20]{0} bitcast(multiply.10574.1.clone.1)
  add.8793.1.clone.1 = f64[20]{0} add(param_13.863, bitcast.14903.1.clone.1), metadata={op_name="jit(update)/jit(main)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  ROOT tuple.1838 = (f64[20]{0}, f64[20]{0}, f64[20]{0}, f64[20]{0}, f64[20]{0}, /*index=5*/f64[20]{0}) tuple(add.8795.1, add.8796.1.clone.1, add.8797.1.clone.1, add.8794.1.clone.1, add.8792.1.clone.1, /*index=5*/add.8793.1.clone.1)
} // fused_add

fused_add.1 {
  param_0.78 = s64[] parameter(0)
  constant_320_1 = s64[] constant(1)
  ROOT add.8785.1 = s64[] add(param_0.78, constant_320_1), metadata={op_name="jit(update)/jit(main)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
}

command_buffer.64 {
  p.1122 = f64[20]{0} parameter(0)
  p.1123 = f64[10,20]{1,0} parameter(1)
  p.1124 = s64[10]{0} parameter(2)
  p.1125 = s64[] parameter(3)
  p.1126 = f64[20]{0} parameter(4)
  p.1127 = f64[10,20]{1,0} parameter(5)
  p.1128 = f64[20]{0} parameter(6)
  p.1129 = f64[10,20]{1,0} parameter(7)
  p.1130 = f64[20]{0} parameter(8)
  p.1131 = f64[10,20]{1,0} parameter(9)
  p.1132 = f64[20]{0} parameter(10)
  p.1133 = f64[10,20]{1,0} parameter(11)
  p.1134 = f64[10]{0} parameter(12)
  p.1135 = f64[20]{0} parameter(13)
  p.1136 = f64[10,20]{1,0} parameter(14)
  p.1137 = f64[10]{0} parameter(15)
  p.1138 = f64[10,20]{1,0} parameter(16)
  p.1139 = f64[10,20]{1,0} parameter(17)
  p.1140 = f64[10,20]{1,0} parameter(18)
  p.1141 = f64[10,20]{1,0} parameter(19)
  p.1142 = f64[10,20]{1,0} parameter(20)
  p.1143 = f64[10,20]{1,0} parameter(21)
  loop_reduce_fusion = (f64[], f64[], f64[], f64[], f64[]) fusion(p.1122, p.1123, p.1124, p.1125, p.1126, /*index=5*/p.1127, p.1128, p.1129, p.1130, p.1131, /*index=10*/p.1132, p.1133), kind=kLoop, calls=fused_reduce, metadata={op_name="jit(update)/jit(main)/while/body/dot_general[dimension_numbers=(((0,), (0,)), ((), ())) precision=(Precision.HIGHEST, Precision.HIGHEST) preferred_element_type=float64]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  get-tuple-element.52837 = f64[] get-tuple-element(loop_reduce_fusion), index=4, metadata={op_name="jit(update)/jit(main)/while/body/dot_general[dimension_numbers=(((0,), (0,)), ((), ())) precision=(Precision.HIGHEST, Precision.HIGHEST) preferred_element_type=float64]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  get-tuple-element.52836 = f64[] get-tuple-element(loop_reduce_fusion), index=3, metadata={op_name="jit(update)/jit(main)/while/body/dot_general[dimension_numbers=(((0,), (0,)), ((), ())) precision=(Precision.HIGHEST, Precision.HIGHEST) preferred_element_type=float64]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  get-tuple-element.52835 = f64[] get-tuple-element(loop_reduce_fusion), index=2, metadata={op_name="jit(update)/jit(main)/while/body/dot_general[dimension_numbers=(((0,), (0,)), ((), ())) precision=(Precision.HIGHEST, Precision.HIGHEST) preferred_element_type=float64]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  get-tuple-element.52834 = f64[] get-tuple-element(loop_reduce_fusion), index=1, metadata={op_name="jit(update)/jit(main)/while/body/dot_general[dimension_numbers=(((0,), (0,)), ((), ())) precision=(Precision.HIGHEST, Precision.HIGHEST) preferred_element_type=float64]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  get-tuple-element.52833 = f64[] get-tuple-element(loop_reduce_fusion), index=0, metadata={op_name="jit(update)/jit(main)/while/body/dot_general[dimension_numbers=(((0,), (0,)), ((), ())) precision=(Precision.HIGHEST, Precision.HIGHEST) preferred_element_type=float64]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  loop_multiply_fusion = f64[] fusion(get-tuple-element.52837, get-tuple-element.52836, get-tuple-element.52835, get-tuple-element.52833, get-tuple-element.52834, /*index=5*/p.1134, p.1124, p.1135, p.1136, p.1125), kind=kLoop, calls=fused_multiply, metadata={op_name="jit(update)/jit(main)/while/body/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  loop_dynamic_update_slice_fusion = f64[10]{0} fusion(p.1137, loop_multiply_fusion, p.1125), kind=kLoop, calls=fused_dynamic_update_slice, metadata={op_name="jit(update)/jit(main)/while/body/dynamic_update_slice" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  loop_add_fusion = (f64[20]{0}, f64[20]{0}, f64[20]{0}, f64[20]{0}, f64[20]{0}, /*index=5*/f64[20]{0}) fusion(p.1130, p.1138, loop_multiply_fusion, p.1124, p.1125, /*index=5*/p.1132, p.1139, p.1135, p.1140, p.1128, /*index=10*/p.1141, p.1122, p.1142, p.1126, p.1143), kind=kLoop, calls=fused_add, control-predecessors={loop_reduce_fusion, loop_multiply_fusion}, metadata={op_name="jit(update)/jit(main)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  loop_add_fusion.1 = s64[] fusion(p.1125), kind=kLoop, calls=fused_add.1, control-predecessors={loop_reduce_fusion, loop_multiply_fusion, loop_dynamic_update_slice_fusion, loop_add_fusion}, metadata={op_name="jit(update)/jit(main)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332 deduplicated_name="loop_add_fusion.1"}
  ROOT tuple.2187 = (f64[10]{0}, (f64[20]{0}, f64[20]{0}, f64[20]{0}, f64[20]{0}, f64[20]{0}, /*index=5*/f64[20]{0}), s64[]) tuple(loop_dynamic_update_slice_fusion, loop_add_fusion, loop_add_fusion.1)
} // command_buffer.64

region_0.295 {
  arg_tuple.296.0 = (s64[], f64[20]{0}, f64[20]{0}, f64[20]{0}, f64[20]{0}, /*index=5*/f64[20]{0}, f64[20]{0}, f64[10]{0}, s64[10]{0}, f64[10,20]{1,0}, /*index=10*/f64[10,20]{1,0}, f64[10,20]{1,0}, f64[10,20]{1,0}, f64[10,20]{1,0}, f64[10,20]{1,0}, /*index=15*/f64[10,20]{1,0}, f64[10,20]{1,0}, f64[10,20]{1,0}, f64[10,20]{1,0}, f64[10,20]{1,0}, /*index=20*/f64[10,20]{1,0}, f64[10]{0}) parameter(0)
  get-tuple-element.54606 = s64[] get-tuple-element(arg_tuple.296.0), index=0
  get-tuple-element.54636 = s64[10]{0} get-tuple-element(arg_tuple.296.0), index=8
  get-tuple-element.54607 = f64[20]{0} get-tuple-element(arg_tuple.296.0), index=1
  get-tuple-element.54608 = f64[20]{0} get-tuple-element(arg_tuple.296.0), index=2
  get-tuple-element.54609 = f64[20]{0} get-tuple-element(arg_tuple.296.0), index=3
  get-tuple-element.54610 = f64[20]{0} get-tuple-element(arg_tuple.296.0), index=4
  get-tuple-element.54611 = f64[20]{0} get-tuple-element(arg_tuple.296.0), index=5
  get-tuple-element.54612 = f64[20]{0} get-tuple-element(arg_tuple.296.0), index=6
  get-tuple-element.54637 = f64[10,20]{1,0} get-tuple-element(arg_tuple.296.0), index=9
  get-tuple-element.54638 = f64[10,20]{1,0} get-tuple-element(arg_tuple.296.0), index=10
  get-tuple-element.54639 = f64[10,20]{1,0} get-tuple-element(arg_tuple.296.0), index=11
  get-tuple-element.54640 = f64[10,20]{1,0} get-tuple-element(arg_tuple.296.0), index=12
  get-tuple-element.54641 = f64[10,20]{1,0} get-tuple-element(arg_tuple.296.0), index=13
  get-tuple-element.54642 = f64[10,20]{1,0} get-tuple-element(arg_tuple.296.0), index=14
  get-tuple-element.54643 = f64[10,20]{1,0} get-tuple-element(arg_tuple.296.0), index=15
  get-tuple-element.54644 = f64[10,20]{1,0} get-tuple-element(arg_tuple.296.0), index=16
  get-tuple-element.54645 = f64[10,20]{1,0} get-tuple-element(arg_tuple.296.0), index=17
  get-tuple-element.54646 = f64[10,20]{1,0} get-tuple-element(arg_tuple.296.0), index=18
  get-tuple-element.54647 = f64[10,20]{1,0} get-tuple-element(arg_tuple.296.0), index=19
  get-tuple-element.54648 = f64[10,20]{1,0} get-tuple-element(arg_tuple.296.0), index=20
  get-tuple-element.54649 = f64[10]{0} get-tuple-element(arg_tuple.296.0), index=21
  get-tuple-element.54613 = f64[10]{0} get-tuple-element(arg_tuple.296.0), index=7
  call.49 = (f64[10]{0}, (f64[20]{0}, f64[20]{0}, f64[20]{0}, f64[20]{0}, f64[20]{0}, /*index=5*/f64[20]{0}), s64[]) call(get-tuple-element.54607, get-tuple-element.54637, get-tuple-element.54636, get-tuple-element.54606, get-tuple-element.54608, /*index=5*/get-tuple-element.54638, get-tuple-element.54609, get-tuple-element.54639, get-tuple-element.54610, get-tuple-element.54640, /*index=10*/get-tuple-element.54611, get-tuple-element.54641, get-tuple-element.54649, get-tuple-element.54612, get-tuple-element.54642, /*index=15*/get-tuple-element.54613, get-tuple-element.54646, get-tuple-element.54647, get-tuple-element.54648, get-tuple-element.54645, /*index=20*/get-tuple-element.54643, get-tuple-element.54644), to_apply=command_buffer.64
  get-tuple-element.57543 = f64[10]{0} get-tuple-element(call.49), index=0
  get-tuple-element.57544 = (f64[20]{0}, f64[20]{0}, f64[20]{0}, f64[20]{0}, f64[20]{0}, /*index=5*/f64[20]{0}) get-tuple-element(call.49), index=1
  get-tuple-element.57545 = s64[] get-tuple-element(call.49), index=2
  get-tuple-element.54630 = f64[20]{0} get-tuple-element(get-tuple-element.57544), index=5, metadata={op_name="jit(update)/jit(main)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  get-tuple-element.54629 = f64[20]{0} get-tuple-element(get-tuple-element.57544), index=4, metadata={op_name="jit(update)/jit(main)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  get-tuple-element.54631 = f64[20]{0} get-tuple-element(get-tuple-element.57544), index=3, metadata={op_name="jit(update)/jit(main)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  get-tuple-element.54634 = f64[20]{0} get-tuple-element(get-tuple-element.57544), index=2, metadata={op_name="jit(update)/jit(main)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  get-tuple-element.54633 = f64[20]{0} get-tuple-element(get-tuple-element.57544), index=1, metadata={op_name="jit(update)/jit(main)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  get-tuple-element.54632 = f64[20]{0} get-tuple-element(get-tuple-element.57544), index=0, metadata={op_name="jit(update)/jit(main)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  ROOT tuple.2103 = (s64[], f64[20]{0}, f64[20]{0}, f64[20]{0}, f64[20]{0}, /*index=5*/f64[20]{0}, f64[20]{0}, f64[10]{0}, s64[10]{0}, f64[10,20]{1,0}, /*index=10*/f64[10,20]{1,0}, f64[10,20]{1,0}, f64[10,20]{1,0}, f64[10,20]{1,0}, f64[10,20]{1,0}, /*index=15*/f64[10,20]{1,0}, f64[10,20]{1,0}, f64[10,20]{1,0}, f64[10,20]{1,0}, f64[10,20]{1,0}, /*index=20*/f64[10,20]{1,0}, f64[10]{0}) tuple(get-tuple-element.57545, get-tuple-element.54629, get-tuple-element.54630, get-tuple-element.54631, get-tuple-element.54632, /*index=5*/get-tuple-element.54633, get-tuple-element.54634, get-tuple-element.57543, get-tuple-element.54636, get-tuple-element.54637, /*index=10*/get-tuple-element.54638, get-tuple-element.54639, get-tuple-element.54640, get-tuple-element.54641, get-tuple-element.54642, /*index=15*/get-tuple-element.54643, get-tuple-element.54644, get-tuple-element.54645, get-tuple-element.54646, get-tuple-element.54647, /*index=20*/get-tuple-element.54648, get-tuple-element.54649)
} // region_0.295

fused_compare {
  param_0.84 = s64[] parameter(0)
  constant_368_1 = s64[] constant(10)
  ROOT compare.2294.1 = pred[] compare(param_0.84, constant_368_1), direction=LT, metadata={op_name="jit(update)/jit(main)/while/cond/lt" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
}

region_1.344 {
  arg_tuple.345.0 = (s64[], f64[20]{0}, f64[20]{0}, f64[20]{0}, f64[20]{0}, /*index=5*/f64[20]{0}, f64[20]{0}, f64[10]{0}, s64[10]{0}, f64[10,20]{1,0}, /*index=10*/f64[10,20]{1,0}, f64[10,20]{1,0}, f64[10,20]{1,0}, f64[10,20]{1,0}, f64[10,20]{1,0}, /*index=15*/f64[10,20]{1,0}, f64[10,20]{1,0}, f64[10,20]{1,0}, f64[10,20]{1,0}, f64[10,20]{1,0}, /*index=20*/f64[10,20]{1,0}, f64[10]{0}) parameter(0)
  get-tuple-element.346.0 = s64[] get-tuple-element(arg_tuple.345.0), index=0
  ROOT loop_compare_fusion = pred[] fusion(get-tuple-element.346.0), kind=kLoop, calls=fused_compare, metadata={op_name="jit(update)/jit(main)/while/cond/lt" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332 deduplicated_name="loop_compare_fusion"}
}

fused_add.2 {
  param_0.88 = f64[20]{0} parameter(0)
  param_2.201 = f64[] parameter(2)
  broadcast.4275.3 = f64[1,20]{1,0} broadcast(param_2.201), dimensions={}, metadata={op_name="jit(update)/jit(main)/while/body/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  param_1.160 = f64[10,20]{1,0} parameter(1)
  param_3.200 = s64[10]{0} parameter(3)
  param_4.204 = s64[] parameter(4)
  constant_553_8 = s64[] constant(0)
  compare.2295.29 = pred[] compare(param_4.204, constant_553_8), direction=LT, metadata={op_name="jit(update)/jit(main)/while/body/lt" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  constant_552_1 = s64[] constant(10)
  add.8799.29 = s64[] add(param_4.204, constant_552_1), metadata={op_name="jit(update)/jit(main)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  select.7893.29 = s64[] select(compare.2295.29, add.8799.29, param_4.204), metadata={op_name="jit(update)/jit(main)/while/body/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  dynamic-slice.4922.25 = s64[1]{0} dynamic-slice(param_3.200, select.7893.29), dynamic_slice_sizes={1}, metadata={op_name="jit(update)/jit(main)/while/body/dynamic_slice[slice_sizes=(1,)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  bitcast.15006.79 = s64[] bitcast(dynamic-slice.4922.25)
  compare.2296.27 = pred[] compare(bitcast.15006.79, constant_553_8), direction=LT, metadata={op_name="jit(update)/jit(main)/while/body/lt" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  add.8800.27 = s64[] add(bitcast.15006.79, constant_552_1), metadata={op_name="jit(update)/jit(main)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  select.7894.25 = s64[] select(compare.2296.27, add.8800.27, bitcast.15006.79), metadata={op_name="jit(update)/jit(main)/while/body/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  dynamic-slice.4932.1 = f64[1,20]{1,0} dynamic-slice(param_1.160, select.7894.25, constant_553_8), dynamic_slice_sizes={1,20}, metadata={op_name="jit(update)/jit(main)/while/body/dynamic_slice[slice_sizes=(1, 20)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  multiply.10588.1 = f64[1,20]{1,0} multiply(broadcast.4275.3, dynamic-slice.4932.1), metadata={op_name="jit(update)/jit(main)/while/body/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  bitcast.15163.1 = f64[20]{0} bitcast(multiply.10588.1)
  add.8808.1 = f64[20]{0} add(param_0.88, bitcast.15163.1), metadata={op_name="jit(update)/jit(main)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  param_5.4018 = f64[20]{0} parameter(5)
  param_6.3215 = f64[10,20]{1,0} parameter(6)
  dynamic-slice.4934.1.clone.1 = f64[1,20]{1,0} dynamic-slice(param_6.3215, select.7894.25, constant_553_8), dynamic_slice_sizes={1,20}, metadata={op_name="jit(update)/jit(main)/while/body/dynamic_slice[slice_sizes=(1, 20)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  multiply.10590.1.clone.1 = f64[1,20]{1,0} multiply(broadcast.4275.3, dynamic-slice.4934.1.clone.1), metadata={op_name="jit(update)/jit(main)/while/body/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  bitcast.15193.1.clone.1 = f64[20]{0} bitcast(multiply.10590.1.clone.1)
  add.8810.1.clone.1 = f64[20]{0} add(param_5.4018, bitcast.15193.1.clone.1), metadata={op_name="jit(update)/jit(main)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  param_7.2470 = f64[20]{0} parameter(7)
  param_8.1900 = f64[10,20]{1,0} parameter(8)
  dynamic-slice.4935.1.clone.1 = f64[1,20]{1,0} dynamic-slice(param_8.1900, select.7894.25, constant_553_8), dynamic_slice_sizes={1,20}, metadata={op_name="jit(update)/jit(main)/while/body/dynamic_slice[slice_sizes=(1, 20)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  multiply.10591.1.clone.1 = f64[1,20]{1,0} multiply(broadcast.4275.3, dynamic-slice.4935.1.clone.1), metadata={op_name="jit(update)/jit(main)/while/body/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  bitcast.15208.1.clone.1 = f64[20]{0} bitcast(multiply.10591.1.clone.1)
  add.8811.1.clone.1 = f64[20]{0} add(param_7.2470, bitcast.15208.1.clone.1), metadata={op_name="jit(update)/jit(main)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  param_9.1658 = f64[20]{0} parameter(9)
  param_10.1330 = f64[10,20]{1,0} parameter(10)
  dynamic-slice.4933.1.clone.1 = f64[1,20]{1,0} dynamic-slice(param_10.1330, select.7894.25, constant_553_8), dynamic_slice_sizes={1,20}, metadata={op_name="jit(update)/jit(main)/while/body/dynamic_slice[slice_sizes=(1, 20)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  multiply.10589.1.clone.1 = f64[1,20]{1,0} multiply(broadcast.4275.3, dynamic-slice.4933.1.clone.1), metadata={op_name="jit(update)/jit(main)/while/body/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  bitcast.15178.1.clone.1 = f64[20]{0} bitcast(multiply.10589.1.clone.1)
  add.8809.1.clone.1 = f64[20]{0} add(param_9.1658, bitcast.15178.1.clone.1), metadata={op_name="jit(update)/jit(main)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  param_11.1133 = f64[20]{0} parameter(11)
  param_12.937 = f64[10,20]{1,0} parameter(12)
  dynamic-slice.4930.1.clone.1 = f64[1,20]{1,0} dynamic-slice(param_12.937, select.7894.25, constant_553_8), dynamic_slice_sizes={1,20}, metadata={op_name="jit(update)/jit(main)/while/body/dynamic_slice[slice_sizes=(1, 20)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  multiply.10586.1.clone.1 = f64[1,20]{1,0} multiply(broadcast.4275.3, dynamic-slice.4930.1.clone.1), metadata={op_name="jit(update)/jit(main)/while/body/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  bitcast.15133.1.clone.1 = f64[20]{0} bitcast(multiply.10586.1.clone.1)
  add.8806.1.clone.1 = f64[20]{0} add(param_11.1133, bitcast.15133.1.clone.1), metadata={op_name="jit(update)/jit(main)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  param_13.885 = f64[20]{0} parameter(13)
  param_14.861 = f64[10,20]{1,0} parameter(14)
  dynamic-slice.4931.1.clone.1 = f64[1,20]{1,0} dynamic-slice(param_14.861, select.7894.25, constant_553_8), dynamic_slice_sizes={1,20}, metadata={op_name="jit(update)/jit(main)/while/body/dynamic_slice[slice_sizes=(1, 20)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  multiply.10587.1.clone.1 = f64[1,20]{1,0} multiply(broadcast.4275.3, dynamic-slice.4931.1.clone.1), metadata={op_name="jit(update)/jit(main)/while/body/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  bitcast.15148.1.clone.1 = f64[20]{0} bitcast(multiply.10587.1.clone.1)
  add.8807.1.clone.1 = f64[20]{0} add(param_13.885, bitcast.15148.1.clone.1), metadata={op_name="jit(update)/jit(main)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  ROOT tuple.1847 = (f64[20]{0}, f64[20]{0}, f64[20]{0}, f64[20]{0}, f64[20]{0}, /*index=5*/f64[20]{0}) tuple(add.8808.1, add.8810.1.clone.1, add.8811.1.clone.1, add.8809.1.clone.1, add.8806.1.clone.1, /*index=5*/add.8807.1.clone.1)
} // fused_add.2

fused_subtract {
  param_6.154 = f64[10]{0} parameter(6)
  param_7.110 = s64[] parameter(7)
  constant_553_2 = s64[] constant(0)
  compare.2295.3 = pred[] compare(param_7.110, constant_553_2), direction=LT, metadata={op_name="jit(update)/jit(main)/while/body/lt" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  constant_552_2 = s64[] constant(10)
  add.8799.3 = s64[] add(param_7.110, constant_552_2), metadata={op_name="jit(update)/jit(main)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  select.7893.3 = s64[] select(compare.2295.3, add.8799.3, param_7.110), metadata={op_name="jit(update)/jit(main)/while/body/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  dynamic-slice.4921.1 = f64[1]{0} dynamic-slice(param_6.154, select.7893.3), dynamic_slice_sizes={1}, metadata={op_name="jit(update)/jit(main)/while/body/dynamic_slice[slice_sizes=(1,)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  bitcast.14997.1 = f64[] bitcast(dynamic-slice.4921.1)
  param_5.125 = f64[10]{0} parameter(5)
  param_10.19 = s64[10]{0} parameter(10)
  dynamic-slice.4922.7 = s64[1]{0} dynamic-slice(param_10.19, select.7893.3), dynamic_slice_sizes={1}, metadata={op_name="jit(update)/jit(main)/while/body/dynamic_slice[slice_sizes=(1,)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  bitcast.15006.25 = s64[] bitcast(dynamic-slice.4922.7)
  compare.2296.9 = pred[] compare(bitcast.15006.25, constant_553_2), direction=LT, metadata={op_name="jit(update)/jit(main)/while/body/lt" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
  add.8800.9 = s64[] add(bitcast.15006.25, constant_552_2), metadata={op_name="jit(update)/jit(main)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/fit_vb_laplace_patrl.py" source_line=332}
