HloModule jit_scan, is_scheduled=true, entry_computation_layout={(f64[4]{0}, f64[4]{0}, f64[4]{0}, f64[4]{0}, f64[4]{0}, /*index=5*/f64[4]{0}, f64[4]{0}, s32[4]{0}, f64[4]{0}, f64[4]{0}, /*index=10*/f64[4,1]{1,0}, f64[4]{0}, f64[4]{0}, f64[4]{0}, f64[4]{0}, /*index=15*/s64[4]{0}, f64[4]{0}, f64[4]{0}, f64[4]{0}, f64[4]{0}, /*index=20*/f64[4]{0}, f64[4]{0}, f64[4]{0}, f64[4,1]{1,0}, f64[4,1]{1,0}, /*index=25*/f64[4]{0}, f64[4]{0}, f64[4]{0}, f64[4]{0}, s64[4]{0}, /*index=30*/f64[4]{0}, f64[4]{0}, f64[4]{0}, f64[4]{0}, f64[4]{0}, /*index=35*/f64[4]{0}, f64[4]{0}, f64[4,1]{1,0}, f64[192,4,1]{2,1,0}, s32[192]{0}, /*index=40*/f64[192]{0})->(f64[4]{0}, f64[4]{0}, f64[4]{0}, f64[4]{0}, s32[4]{0}, /*index=5*/f64[4]{0}, f64[4]{0}, f64[4,1]{1,0}, f64[4]{0}, f64[4]{0}, /*index=10*/f64[4]{0}, f64[4]{0}, s64[4]{0}, f64[4]{0}, f64[4]{0}, /*index=15*/f64[4]{0}, f64[4]{0}, f64[4]{0}, f64[4]{0}, f64[4]{0}, /*index=20*/f64[4,1]{1,0}, f64[4,1]{1,0}, f64[4]{0}, f64[4]{0}, f64[4]{0}, /*index=25*/f64[4]{0}, s64[4]{0}, f64[4]{0}, f64[4]{0}, f64[4]{0}, /*index=30*/f64[4]{0}, f64[4]{0}, f64[4]{0}, f64[4]{0}, f64[4,1]{1,0}, /*index=35*/f64[192,4]{1,0}, f64[192,4]{1,0}, f64[192,4]{1,0}, f64[192,4]{1,0}, pred[192,4]{1,0}, /*index=40*/f64[192,4]{1,0}, f64[192,4]{1,0}, f64[192,4]{1,0}, f64[192,4]{1,0}, f64[192,4]{1,0}, /*index=45*/f64[192,4]{1,0}, f64[192,4]{1,0}, f64[192,4]{1,0}, pred[192,4]{1,0}, f64[192,4]{1,0}, /*index=50*/f64[192,4]{1,0}, f64[192,4]{1,0}, f64[192,4]{1,0}, f64[192,4]{1,0}, f64[192,4]{1,0}, /*index=55*/f64[192,4]{1,0}, f64[192]{0}, f64[192,4]{1,0}, f64[192,4]{1,0}, f64[192,4]{1,0}, /*index=60*/s32[192]{0}, f64[192,4]{1,0}, f64[192]{0}, f64[192,4]{1,0}, f64[192,4]{1,0}, /*index=65*/f64[192,4]{1,0}, pred[192,4]{1,0}, f64[192,4]{1,0}, f64[192,4]{1,0}, f64[192,4]{1,0}, /*index=70*/f64[192,4]{1,0}, f64[192,4]{1,0}, f64[192,4]{1,0}, f64[192]{0}, f64[192,4]{1,0}, /*index=75*/f64[192,4]{1,0}, f64[192,4]{1,0}, f64[192,4]{1,0}, f64[192,4]{1,0}, f64[192,4]{1,0}, /*index=80*/f64[192,4]{1,0}, f64[192,4]{1,0}, f64[192,4]{1,0}, f64[192,4]{1,0}, f64[192,4]{1,0}, /*index=85*/s32[192,4]{1,0}, pred[192,4]{1,0}, pred[192,4,1]{2,1,0}, f64[192,4]{1,0}, f64[192,4]{1,0}, /*index=90*/f64[192,4]{1,0}, f64[192,4]{1,0}, pred[192,4]{1,0}, pred[192,4,1]{2,1,0}, f64[192,4]{1,0}, /*index=95*/f64[192,4]{1,0}, f64[192,4]{1,0}, f64[192,4]{1,0}, f64[192,4]{1,0}, f64[192,4]{1,0}, /*index=100*/f64[192,4]{1,0}, f64[192,4]{1,0}, f64[192,4]{1,0}, f64[192,4]{1,0}, pred[192,4]{1,0}, /*index=105*/pred[192,4]{1,0}, pred[192,4,1]{2,1,0})}, allow_spmd_sharding_propagation_to_parameters={true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true}, allow_spmd_sharding_propagation_to_output={true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true}, frontend_attributes={fingerprint_before_lhs="8c000139badf7e2ec734643fc7b18d34"}

fused_divide_exponential {
  constant_17_2 = f64[] constant(1)
  broadcast.445.1 = f64[4]{0} broadcast(constant_17_2), dimensions={}
  param_1.734 = f64[4]{0} parameter(1)
  divide.385.5 = f64[4]{0} divide(broadcast.445.1, param_1.734), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/div" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  param_0.474 = f64[] parameter(0)
  broadcast.446.5 = f64[4]{0} broadcast(param_0.474), dimensions={}, metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  param_2.688 = f64[4]{0} parameter(2)
  param_4.556 = f64[4,1]{1,0} parameter(4)
  bitcast.1630.5.clone.1 = f64[4]{0} bitcast(param_4.556)
  param_3.635 = f64[4]{0} parameter(3)
  multiply.841.5.clone.1 = f64[4]{0} multiply(bitcast.1630.5.clone.1, param_3.635), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  add.335.3.clone.1 = f64[4]{0} add(param_2.688, multiply.841.5.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  exponential.58.1.clone.1 = f64[4]{0} exponential(add.335.3.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/exp" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  multiply.842.5 = f64[4]{0} multiply(broadcast.446.5, exponential.58.1.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  add.336.5 = f64[4]{0} add(divide.385.5, multiply.842.5), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  divide.387.1 = f64[4]{0} divide(broadcast.445.1, add.336.5), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/div" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  multiply.843.1.clone.1 = f64[4]{0} multiply(param_1.734, param_1.734), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  divide.388.1.clone.1 = f64[4]{0} divide(broadcast.445.1, multiply.843.1.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/div" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  multiply.844.1.clone.1 = f64[4]{0} multiply(add.336.5, add.336.5), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  divide.389.1.clone.1 = f64[4]{0} divide(broadcast.445.1, multiply.844.1.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/div" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  ROOT tuple.141 = (f64[4]{0}, f64[4]{0}, f64[4]{0}, f64[4]{0}) tuple(divide.387.1, divide.388.1.clone.1, divide.389.1.clone.1, exponential.58.1.clone.1)
} // fused_divide_exponential

fused_broadcast {
  constant_288_1 = pred[] constant(false)
  ROOT broadcast.447.1 = pred[4]{0} broadcast(constant_288_1), dimensions={}
}

wrapped_copy_computation.4 {
  param_0.582 = f64[4]{0} parameter(0)
  ROOT copy.570 = f64[4]{0} copy(param_0.582)
}

region_2.281 {
  arg_tuple.282.0 = (f64[], f64[4]{0}, f64[4]{0}, f64[4,1]{1,0}, f64[4]{0}) parameter(0)
  get-tuple-element.5168 = f64[] get-tuple-element(arg_tuple.282.0), index=0
  get-tuple-element.286.0 = f64[4,1]{1,0} get-tuple-element(arg_tuple.282.0), index=3
  bitcast.1630.0 = f64[4]{0} bitcast(get-tuple-element.286.0)
  get-tuple-element.287.0 = f64[4]{0} get-tuple-element(arg_tuple.282.0), index=4
  get-tuple-element.285.0 = f64[4]{0} get-tuple-element(arg_tuple.282.0), index=2
  get-tuple-element.284.0 = f64[4]{0} get-tuple-element(arg_tuple.282.0), index=1
  loop_broadcast_fusion = pred[4]{0} fusion(), kind=kLoop, calls=fused_broadcast
  wrapped_copy.4 = f64[4]{0} fusion(bitcast.1630.0), kind=kLoop, calls=wrapped_copy_computation.4
  loop_divide_exponential_fusion = (f64[4]{0}, f64[4]{0}, f64[4]{0}, f64[4]{0}) fusion(get-tuple-element.5168, get-tuple-element.284.0, get-tuple-element.285.0, get-tuple-element.287.0, get-tuple-element.286.0), kind=kLoop, calls=fused_divide_exponential, metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/div" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  get-tuple-element.5170 = f64[4]{0} get-tuple-element(loop_divide_exponential_fusion), index=3, metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/div" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  get-tuple-element.5171 = f64[4]{0} get-tuple-element(loop_divide_exponential_fusion), index=2, metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/div" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  get-tuple-element.5167 = f64[4]{0} get-tuple-element(loop_divide_exponential_fusion), index=1, metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/div" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  get-tuple-element.5166 = f64[4]{0} get-tuple-element(loop_divide_exponential_fusion), index=0, metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/div" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  ROOT tuple.179 = (f64[4]{0}, f64[4]{0}, f64[], f64[4]{0}, f64[4]{0}, /*index=5*/f64[4]{0}, pred[4]{0}) tuple(get-tuple-element.5166, get-tuple-element.5167, get-tuple-element.5168, wrapped_copy.4, get-tuple-element.5170, /*index=5*/get-tuple-element.5171, loop_broadcast_fusion)
} // region_2.281

wrapped_convert_computation {
  param_0.583 = s32[] parameter(0)
  ROOT convert.83.1 = f64[] convert(param_0.583), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_1_fun/jit(precision_update)/convert_element_type[new_dtype=float64 weak_type=False sharding=None]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
}

fused_broadcast.1 {
  constant_335_1 = f64[] constant(0)
  ROOT broadcast.451.1 = f64[4]{0} broadcast(constant_335_1), dimensions={}
}

wrapped_copy_computation.5 {
  param_0.584 = f64[4]{0} parameter(0)
  ROOT copy.571 = f64[4]{0} copy(param_0.584)
}

wrapped_copy_computation.6 {
  param_0.585 = f64[4]{0} parameter(0)
  ROOT copy.572 = f64[4]{0} copy(param_0.585)
}

fused_compare_multiply_select {
  param_0.475 = f64[4]{0} parameter(0)
  param_3.636 = f64[4,1]{1,0} parameter(3)
  multiply.845.5.clone.1 = f64[4,1]{1,0} multiply(param_3.636, param_3.636), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_1_fun/jit(precision_update)/integer_pow[y=2]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  bitcast.1663.9.clone.1 = f64[4]{0} bitcast(multiply.845.5.clone.1)
  param_2.689 = f64[4]{0} parameter(2)
  multiply.846.9.clone.1 = f64[4]{0} multiply(bitcast.1663.9.clone.1, param_2.689), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_1_fun/jit(precision_update)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  param_1.735 = f64[] parameter(1)
  broadcast.448.5.clone.1 = f64[4]{0} broadcast(param_1.735), dimensions={}, metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_1_fun/jit(precision_update)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  multiply.847.7.clone.1 = f64[4]{0} multiply(multiply.846.9.clone.1, broadcast.448.5.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_1_fun/jit(precision_update)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  add.337.5.clone.1 = f64[4]{0} add(param_0.475, multiply.847.7.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_1_fun/jit(precision_update)/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  constant_22_1_clone_1 = f64[] constant(1e-128)
  broadcast.449.1.clone.1 = f64[4]{0} broadcast(constant_22_1_clone_1), dimensions={}
  compare.262.1.clone.1 = pred[4]{0} compare(add.337.5.clone.1, broadcast.449.1.clone.1), direction=GT, metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_1_fun/jit(precision_update)/gt" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  constant_23_1 = f64[] constant(nan)
  broadcast.450.1 = f64[4]{0} broadcast(constant_23_1), dimensions={}, metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_1_fun/jit(precision_update)/jit(_where)/broadcast_in_dim[shape=(4,) broadcast_dimensions=()]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  select.508.1 = f64[4]{0} select(compare.262.1.clone.1, add.337.5.clone.1, broadcast.450.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_1_fun/jit(precision_update)/jit(_where)/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  ROOT tuple.143 = (f64[4]{0}, pred[4]{0}, f64[4,1]{1,0}) tuple(select.508.1, compare.262.1.clone.1, multiply.845.5.clone.1)
} // fused_compare_multiply_select

command_buffer.6 {
  p.312 = s32[] parameter(0)
  p.313 = (f64[4]{0}, s32[], f64[4]{0}, f64[4,1]{1,0}) parameter(1)
  wrapped_convert = f64[] fusion(p.312), kind=kLoop, calls=wrapped_convert_computation, metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_1_fun/jit(precision_update)/convert_element_type[new_dtype=float64 weak_type=False sharding=None]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  get-tuple-element.334.0 = f64[4,1]{1,0} get-tuple-element(p.313), index=3, metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_1_fun/jit(precision_update)/squeeze[dimensions=(1,)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  get-tuple-element.333.0 = f64[4]{0} get-tuple-element(p.313), index=2
  get-tuple-element.331.0 = f64[4]{0} get-tuple-element(p.313), index=0
  loop_broadcast_fusion.1 = f64[4]{0} fusion(), kind=kLoop, calls=fused_broadcast.1
  wrapped_copy.5 = f64[4]{0} fusion(loop_broadcast_fusion.1), kind=kLoop, calls=wrapped_copy_computation.5
  wrapped_copy.6 = f64[4]{0} fusion(loop_broadcast_fusion.1), kind=kLoop, calls=wrapped_copy_computation.6
  loop_compare_multiply_select_fusion = (f64[4]{0}, pred[4]{0}, f64[4,1]{1,0}) fusion(get-tuple-element.333.0, wrapped_convert, get-tuple-element.331.0, get-tuple-element.334.0), kind=kLoop, calls=fused_compare_multiply_select, metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_1_fun/jit(precision_update)/jit(_where)/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  ROOT tuple.203 = (f64[], f64[4]{0}, f64[4]{0}, f64[4]{0}, (f64[4]{0}, pred[4]{0}, f64[4,1]{1,0})) tuple(wrapped_convert, loop_broadcast_fusion.1, wrapped_copy.5, wrapped_copy.6, loop_compare_multiply_select_fusion)
} // command_buffer.6

region_3.329 {
  arg_tuple.330.0 = (f64[4]{0}, s32[], f64[4]{0}, f64[4,1]{1,0}) parameter(0)
  get-tuple-element.332.0 = s32[] get-tuple-element(arg_tuple.330.0), index=1
  call.3 = (f64[], f64[4]{0}, f64[4]{0}, f64[4]{0}, (f64[4]{0}, pred[4]{0}, f64[4,1]{1,0})) call(get-tuple-element.332.0, arg_tuple.330.0), to_apply=command_buffer.6
  get-tuple-element.5891 = f64[] get-tuple-element(call.3), index=0
  get-tuple-element.5892 = f64[4]{0} get-tuple-element(call.3), index=1
  get-tuple-element.5893 = f64[4]{0} get-tuple-element(call.3), index=2
  get-tuple-element.5894 = f64[4]{0} get-tuple-element(call.3), index=3
  get-tuple-element.5895 = (f64[4]{0}, pred[4]{0}, f64[4,1]{1,0}) get-tuple-element(call.3), index=4
  get-tuple-element.5123 = f64[4,1]{1,0} get-tuple-element(get-tuple-element.5895), index=2, metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_1_fun/jit(precision_update)/jit(_where)/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  bitcast.1663.0 = f64[4]{0} bitcast(get-tuple-element.5123)
  get-tuple-element.5179 = pred[4]{0} get-tuple-element(get-tuple-element.5895), index=1, metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_1_fun/jit(precision_update)/jit(_where)/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  get-tuple-element.5173 = f64[4]{0} get-tuple-element(get-tuple-element.5895), index=0, metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_1_fun/jit(precision_update)/jit(_where)/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  ROOT tuple.180 = (f64[4]{0}, f64[4]{0}, f64[], f64[4]{0}, f64[4]{0}, /*index=5*/f64[4]{0}, pred[4]{0}) tuple(get-tuple-element.5173, get-tuple-element.5892, get-tuple-element.5891, bitcast.1663.0, get-tuple-element.5893, /*index=5*/get-tuple-element.5894, get-tuple-element.5179)
} // region_3.329

fused_divide_exponential_multiply {
  constant_358_4 = f64[] constant(1)
  broadcast.453.1.clone.1 = f64[4]{0} broadcast(constant_358_4), dimensions={}
  param_3.646 = f64[4]{0} parameter(3)
  param_4.571 = f64[4]{0} parameter(4)
  multiply.848.7.clone.1 = f64[4]{0} multiply(param_3.646, param_4.571), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_prediction)/jit(predict_mean)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  param_1.743 = f64[192]{0} parameter(1)
  param_2.696 = s64[] parameter(2)
  constant_357_78_clone_1 = s64[] constant(0)
  compare.263.193.clone.1 = pred[] compare(param_2.696, constant_357_78_clone_1), direction=LT, metadata={op_name="jit(scan)/jit(main)/while/body/lt" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  constant_356_78_clone_1 = s64[] constant(192)
  add.339.193.clone.1 = s64[] add(param_2.696, constant_356_78_clone_1), metadata={op_name="jit(scan)/jit(main)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  select.509.193.clone.1 = s64[] select(compare.263.193.clone.1, add.339.193.clone.1, param_2.696), metadata={op_name="jit(scan)/jit(main)/while/body/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  dynamic-slice.39.55.clone.1 = f64[1]{0} dynamic-slice(param_1.743, select.509.193.clone.1), dynamic_slice_sizes={1}, metadata={op_name="jit(scan)/jit(main)/while/body/dynamic_slice[slice_sizes=(1,)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  bitcast.1707.66.clone.1 = f64[] bitcast(dynamic-slice.39.55.clone.1)
  broadcast.452.63.clone.1 = f64[4]{0} broadcast(bitcast.1707.66.clone.1), dimensions={}, metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_prediction)/jit(predict_mean)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  param_0.478 = f64[4]{0} parameter(0)
  multiply.849.9.clone.1 = f64[4]{0} multiply(broadcast.452.63.clone.1, param_0.478), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_prediction)/jit(predict_mean)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  add.340.7.clone.1 = f64[4]{0} add(multiply.848.7.clone.1, multiply.849.9.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_prediction)/jit(predict_mean)/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  negate.18.1.clone.1 = f64[4]{0} negate(add.340.7.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(binary_state_node_prediction)/neg" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  exponential.59.1.clone.1 = f64[4]{0} exponential(negate.18.1.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(binary_state_node_prediction)/exp" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  add.341.1.clone.1 = f64[4]{0} add(exponential.59.1.clone.1, broadcast.453.1.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(binary_state_node_prediction)/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  divide.390.1.clone.1 = f64[4]{0} divide(broadcast.453.1.clone.1, add.341.1.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(binary_state_node_prediction)/div" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  subtract.76.5 = f64[4]{0} subtract(broadcast.453.1.clone.1, divide.390.1.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(binary_state_node_prediction)/sub" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  multiply.850.1 = f64[4]{0} multiply(divide.390.1.clone.1, subtract.76.5), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(binary_state_node_prediction)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  param_9.130 = f64[4]{0} parameter(9)
  divide.391.1.clone.1.clone.1 = f64[4]{0} divide(broadcast.453.1.clone.1, param_9.130), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_prediction)/jit(predict_precision)/div" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  param_6.313 = f64[4]{0} parameter(6)
  param_8.174 = f64[4,1]{1,0} parameter(8)
  bitcast.1776.5.clone.1.clone.1 = f64[4]{0} bitcast(param_8.174)
  param_7.224 = f64[4]{0} parameter(7)
  multiply.852.5.clone.1.clone.1 = f64[4]{0} multiply(bitcast.1776.5.clone.1.clone.1, param_7.224), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_prediction)/jit(predict_precision)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  add.342.3.clone.1.clone.1 = f64[4]{0} add(param_6.313, multiply.852.5.clone.1.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_prediction)/jit(predict_precision)/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  exponential.60.1.clone.1.clone.1 = f64[4]{0} exponential(add.342.3.clone.1.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_prediction)/jit(predict_precision)/exp" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  multiply.853.13.clone.1 = f64[4]{0} multiply(broadcast.452.63.clone.1, exponential.60.1.clone.1.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_prediction)/jit(predict_precision)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  constant_359_13_clone_1 = f64[] constant(1e-128)
  broadcast.454.clone.37.clone.1 = f64[4]{0} broadcast(constant_359_13_clone_1), dimensions={}
  compare.265.15.clone.1 = pred[4]{0} compare(multiply.853.13.clone.1, broadcast.454.clone.37.clone.1), direction=GT, metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_prediction)/jit(predict_precision)/gt" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  param_5.431 = f64[4]{0} parameter(5)
  select.510.11.clone.1 = f64[4]{0} select(compare.265.15.clone.1, multiply.853.13.clone.1, param_5.431), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_prediction)/jit(predict_precision)/jit(_where)/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  add.343.5.clone.1 = f64[4]{0} add(divide.391.1.clone.1.clone.1, select.510.11.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_prediction)/jit(predict_precision)/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  divide.392.1.clone.1 = f64[4]{0} divide(broadcast.453.1.clone.1, add.343.5.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_prediction)/jit(predict_precision)/div" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  ROOT tuple.175 = (f64[4]{0}, f64[4]{0}, f64[4]{0}, f64[4]{0}, f64[4]{0}) tuple(multiply.850.1, divide.390.1.clone.1, divide.392.1.clone.1, exponential.60.1.clone.1.clone.1, divide.391.1.clone.1.clone.1)
} // fused_divide_exponential_multiply

fused_dynamic_slice {
  param_0.329 = f64[192]{0} parameter(0)
  param_1.453 = s64[] parameter(1)
  constant_357_62 = s64[] constant(0)
  compare.263.7 = pred[] compare(param_1.453, constant_357_62), direction=LT, metadata={op_name="jit(scan)/jit(main)/while/body/lt" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  constant_356_4 = s64[] constant(192)
  add.339.7 = s64[] add(param_1.453, constant_356_4), metadata={op_name="jit(scan)/jit(main)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  select.509.7 = s64[] select(compare.263.7, add.339.7, param_1.453), metadata={op_name="jit(scan)/jit(main)/while/body/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  ROOT dynamic-slice.39.7 = f64[1]{0} dynamic-slice(param_0.329, select.509.7), dynamic_slice_sizes={1}, metadata={op_name="jit(scan)/jit(main)/while/body/dynamic_slice[slice_sizes=(1,)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
} // fused_dynamic_slice

fused_convert_dynamic_slice {
  param_0.331 = s32[192]{0} parameter(0)
  param_1.457 = s64[] parameter(1)
  constant_357_63 = s64[] constant(0)
  compare.263.9 = pred[] compare(param_1.457, constant_357_63), direction=LT, metadata={op_name="jit(scan)/jit(main)/while/body/lt" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  constant_356_5 = s64[] constant(192)
  add.339.9 = s64[] add(param_1.457, constant_356_5), metadata={op_name="jit(scan)/jit(main)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  select.509.9 = s64[] select(compare.263.9, add.339.9, param_1.457), metadata={op_name="jit(scan)/jit(main)/while/body/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  dynamic-slice.40.19 = s32[1]{0} dynamic-slice(param_0.331, select.509.9), dynamic_slice_sizes={1}, metadata={op_name="jit(scan)/jit(main)/while/body/dynamic_slice[slice_sizes=(1,)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  constant_360_2_clone_1 = s32[1]{0} constant({0})
  compare.264.1.clone.1 = pred[1]{0} compare(dynamic-slice.40.19, constant_360_2_clone_1), direction=NE, metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/convert_element_type[new_dtype=bool weak_type=False sharding=None]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  convert.84.2.clone.1 = s32[1]{0} convert(compare.264.1.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/convert_element_type[new_dtype=int32 weak_type=False sharding=None]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  ROOT tuple.172 = (s32[1]{0}, s32[1]{0}) tuple(dynamic-slice.40.19, convert.84.2.clone.1)
} // fused_convert_dynamic_slice

wrapped_copy_computation.3 {
  param_0.581 = f64[4]{0} parameter(0)
  ROOT copy.569 = f64[4]{0} copy(param_0.581)
}

fused_dynamic_update_slice.30 {
  param_0.66 = pred[192,4]{1,0} parameter(0)
  param_1.701 = pred[4]{0} parameter(1)
  bitcast.2439.1 = pred[1,4]{1,0} bitcast(param_1.701)
  param_2.629 = s64[] parameter(2)
  constant_357_56 = s64[] constant(0)
  compare.263.75 = pred[] compare(param_2.629, constant_357_56), direction=LT, metadata={op_name="jit(scan)/jit(main)/while/body/lt" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  constant_356_38 = s64[] constant(192)
  add.339.75 = s64[] add(param_2.629, constant_356_38), metadata={op_name="jit(scan)/jit(main)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  select.509.75 = s64[] select(compare.263.75, add.339.75, param_2.629), metadata={op_name="jit(scan)/jit(main)/while/body/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  ROOT dynamic-update-slice.887.1 = pred[192,4]{1,0} dynamic-update-slice(param_0.66, bitcast.2439.1, select.509.75, constant_357_56), metadata={op_name="jit(scan)/jit(main)/while/body/dynamic_update_slice" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
} // fused_dynamic_update_slice.30

fused_dynamic_update_slice.45 {
  param_0.81 = pred[192,4]{1,0} parameter(0)
  param_3.608 = f64[192]{0} parameter(3)
  param_1.715 = s64[] parameter(1)
  constant_357_38 = s64[] constant(0)
  compare.263.167 = pred[] compare(param_1.715, constant_357_38), direction=LT, metadata={op_name="jit(scan)/jit(main)/while/body/lt" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  constant_356_20 = s64[] constant(192)
  add.339.167 = s64[] add(param_1.715, constant_356_20), metadata={op_name="jit(scan)/jit(main)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  select.509.167 = s64[] select(compare.263.167, add.339.167, param_1.715), metadata={op_name="jit(scan)/jit(main)/while/body/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  dynamic-slice.39.29 = f64[1]{0} dynamic-slice(param_3.608, select.509.167), dynamic_slice_sizes={1}, metadata={op_name="jit(scan)/jit(main)/while/body/dynamic_slice[slice_sizes=(1,)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  bitcast.1707.40 = f64[] bitcast(dynamic-slice.39.29)
  broadcast.452.37 = f64[4]{0} broadcast(bitcast.1707.40), dimensions={}, metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_prediction)/jit(predict_mean)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  param_2.652 = f64[4]{0} parameter(2)
  multiply.853.5 = f64[4]{0} multiply(broadcast.452.37, param_2.652), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_prediction)/jit(predict_precision)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  constant_359_6 = f64[] constant(1e-128)
  broadcast.454.clone.15 = f64[4]{0} broadcast(constant_359_6), dimensions={}
  compare.265.3 = pred[4]{0} compare(multiply.853.5, broadcast.454.clone.15), direction=GT, metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_prediction)/jit(predict_precision)/gt" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  bitcast.2263.1 = pred[1,4]{1,0} bitcast(compare.265.3)
  ROOT dynamic-update-slice.871.1 = pred[192,4]{1,0} dynamic-update-slice(param_0.81, bitcast.2263.1, select.509.167, constant_357_38), metadata={op_name="jit(scan)/jit(main)/while/body/dynamic_update_slice" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
} // fused_dynamic_update_slice.45

fused_dynamic_update_slice.8 {
  param_0.44 = pred[192,4,1]{2,1,0} parameter(0)
  param_1.722 = s64[4]{0} parameter(1)
  constant_357_60 = s64[] constant(0)
  broadcast.460.13 = s64[4]{0} broadcast(constant_357_60), dimensions={}
  compare.268.13 = pred[4]{0} compare(param_1.722, broadcast.460.13), direction=NE, metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update_ehgf)/jit(posterior_update_precision_continuous_node)/convert_element_type[new_dtype=bool weak_type=False sharding=None]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  convert.87.13 = s32[4]{0} convert(compare.268.13), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update_ehgf)/jit(posterior_update_precision_continuous_node)/convert_element_type[new_dtype=int32 weak_type=False sharding=None]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  constant_362_3 = s32[] constant(1)
  broadcast.461.clone.9 = s32[4]{0} broadcast(constant_362_3), dimensions={}
  compare.272.3 = pred[4]{0} compare(convert.87.13, broadcast.461.clone.9), direction=EQ, metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update_ehgf)/jit(posterior_update_precision_continuous_node)/eq" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  bitcast.2714.1 = pred[1,4,1]{2,1,0} bitcast(compare.272.3)
  param_2.662 = s64[] parameter(2)
  compare.263.3 = pred[] compare(param_2.662, constant_357_60), direction=LT, metadata={op_name="jit(scan)/jit(main)/while/body/lt" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  constant_356_2 = s64[] constant(192)
  add.339.3 = s64[] add(param_2.662, constant_356_2), metadata={op_name="jit(scan)/jit(main)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  select.509.3 = s64[] select(compare.263.3, add.339.3, param_2.662), metadata={op_name="jit(scan)/jit(main)/while/body/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  ROOT dynamic-update-slice.910.1 = pred[192,4,1]{2,1,0} dynamic-update-slice(param_0.44, bitcast.2714.1, select.509.3, constant_357_60, constant_357_60), metadata={op_name="jit(scan)/jit(main)/while/body/dynamic_update_slice" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
} // fused_dynamic_update_slice.8

fused_dynamic_update_slice.9 {
  param_0.45 = pred[192,4]{1,0} parameter(0)
  param_1.720 = s64[4]{0} parameter(1)
  constant_357_5 = s64[] constant(0)
  broadcast.460.7 = s64[4]{0} broadcast(constant_357_5), dimensions={}
  compare.268.7 = pred[4]{0} compare(param_1.720, broadcast.460.7), direction=NE, metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update_ehgf)/jit(posterior_update_precision_continuous_node)/convert_element_type[new_dtype=bool weak_type=False sharding=None]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  convert.87.7 = s32[4]{0} convert(compare.268.7), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update_ehgf)/jit(posterior_update_precision_continuous_node)/convert_element_type[new_dtype=int32 weak_type=False sharding=None]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  constant_362_1 = s32[] constant(1)
  broadcast.461.clone.11 = s32[4]{0} broadcast(constant_362_1), dimensions={}
  compare.272.5 = pred[4]{0} compare(convert.87.7, broadcast.461.clone.11), direction=EQ, metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update_ehgf)/jit(posterior_update_precision_continuous_node)/eq" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  bitcast.2703.1 = pred[1,4]{1,0} bitcast(compare.272.5)
  param_2.660 = s64[] parameter(2)
  compare.263.127 = pred[] compare(param_2.660, constant_357_5), direction=LT, metadata={op_name="jit(scan)/jit(main)/while/body/lt" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  constant_356_64 = s64[] constant(192)
  add.339.127 = s64[] add(param_2.660, constant_356_64), metadata={op_name="jit(scan)/jit(main)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  select.509.127 = s64[] select(compare.263.127, add.339.127, param_2.660), metadata={op_name="jit(scan)/jit(main)/while/body/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  ROOT dynamic-update-slice.909.1 = pred[192,4]{1,0} dynamic-update-slice(param_0.45, bitcast.2703.1, select.509.127, constant_357_5), metadata={op_name="jit(scan)/jit(main)/while/body/dynamic_update_slice" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
} // fused_dynamic_update_slice.9

fused_dynamic_update_slice.11 {
  param_0.47 = pred[192,4,1]{2,1,0} parameter(0)
  param_1.724 = s64[4]{0} parameter(1)
  constant_357_27 = s64[] constant(0)
  broadcast.460.11 = s64[4]{0} broadcast(constant_357_27), dimensions={}
  compare.268.11 = pred[4]{0} compare(param_1.724, broadcast.460.11), direction=NE, metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update_ehgf)/jit(posterior_update_precision_continuous_node)/convert_element_type[new_dtype=bool weak_type=False sharding=None]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  convert.87.11 = s32[4]{0} convert(compare.268.11), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update_ehgf)/jit(posterior_update_precision_continuous_node)/convert_element_type[new_dtype=int32 weak_type=False sharding=None]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  constant_364_2 = s32[] constant(0)
  broadcast.463.3 = s32[4]{0} broadcast(constant_364_2), dimensions={}
  compare.271.3 = pred[4]{0} compare(convert.87.11, broadcast.463.3), direction=EQ, metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update_ehgf)/jit(posterior_update_precision_continuous_node)/eq" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  bitcast.2662.1 = pred[1,4,1]{2,1,0} bitcast(compare.271.3)
  param_2.666 = s64[] parameter(2)
  compare.263.117 = pred[] compare(param_2.666, constant_357_27), direction=LT, metadata={op_name="jit(scan)/jit(main)/while/body/lt" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  constant_356_59 = s64[] constant(192)
  add.339.117 = s64[] add(param_2.666, constant_356_59), metadata={op_name="jit(scan)/jit(main)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  select.509.117 = s64[] select(compare.263.117, add.339.117, param_2.666), metadata={op_name="jit(scan)/jit(main)/while/body/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  ROOT dynamic-update-slice.906.1 = pred[192,4,1]{2,1,0} dynamic-update-slice(param_0.47, bitcast.2662.1, select.509.117, constant_357_27, constant_357_27), metadata={op_name="jit(scan)/jit(main)/while/body/dynamic_update_slice" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
} // fused_dynamic_update_slice.11

fused_dynamic_update_slice.12 {
  param_0.48 = pred[192,4]{1,0} parameter(0)
  param_1.723 = s64[4]{0} parameter(1)
  constant_357_39 = s64[] constant(0)
  broadcast.460.3 = s64[4]{0} broadcast(constant_357_39), dimensions={}
  compare.268.3 = pred[4]{0} compare(param_1.723, broadcast.460.3), direction=NE, metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update_ehgf)/jit(posterior_update_precision_continuous_node)/convert_element_type[new_dtype=bool weak_type=False sharding=None]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  convert.87.3 = s32[4]{0} convert(compare.268.3), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update_ehgf)/jit(posterior_update_precision_continuous_node)/convert_element_type[new_dtype=int32 weak_type=False sharding=None]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  constant_364_1 = s32[] constant(0)
  broadcast.463.5 = s32[4]{0} broadcast(constant_364_1), dimensions={}
  compare.271.5 = pred[4]{0} compare(convert.87.3, broadcast.463.5), direction=EQ, metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update_ehgf)/jit(posterior_update_precision_continuous_node)/eq" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  bitcast.2651.1 = pred[1,4]{1,0} bitcast(compare.271.5)
  param_2.665 = s64[] parameter(2)
  compare.263.115 = pred[] compare(param_2.665, constant_357_39), direction=LT, metadata={op_name="jit(scan)/jit(main)/while/body/lt" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  constant_356_58 = s64[] constant(192)
  add.339.115 = s64[] add(param_2.665, constant_356_58), metadata={op_name="jit(scan)/jit(main)/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  select.509.115 = s64[] select(compare.263.115, add.339.115, param_2.665), metadata={op_name="jit(scan)/jit(main)/while/body/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
