HloModule jit_scan, entry_computation_layout={(f64[], f64[], f64[], f64[], s64[], /*index=5*/f64[], f64[], f64[1]{0}, f64[], f64[], /*index=10*/f64[], f64[], s64[], f64[], f64[], /*index=15*/f64[], f64[], f64[], f64[], f64[], /*index=20*/f64[1]{0}, f64[192,1]{1,0}, s64[192]{0}, f64[192]{0})->(f64[], f64[], f64[], f64[], s64[], /*index=5*/f64[], f64[], f64[1]{0}, f64[], f64[], /*index=10*/f64[], f64[], s64[], f64[], f64[], /*index=15*/f64[], f64[], f64[], f64[], f64[], /*index=20*/f64[1]{0}, f64[192]{0}, f64[192]{0}, f64[192]{0}, f64[192]{0}, /*index=25*/s64[192]{0}, f64[192]{0}, f64[192]{0}, f64[192,1]{1,0}, f64[192]{0}, /*index=30*/f64[192]{0}, f64[192]{0}, f64[192]{0}, s64[192]{0}, f64[192]{0}, /*index=35*/f64[192]{0}, f64[192]{0}, f64[192]{0}, f64[192]{0}, f64[192]{0}, /*index=40*/f64[192]{0}, f64[192,1]{1,0})}, allow_spmd_sharding_propagation_to_parameters={true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true}, allow_spmd_sharding_propagation_to_output={true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true}

predict_mean.33 {
  Arg_1.35 = f64[] parameter(1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_prediction)/pjit[in_shardings=(UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue) out_shardings=(UnspecifiedValue,) in_layouts=(None, None, None, None) out_layouts=(None,) resource_env=None donated_invars=(False, False, False, False) name=predict_mean keep_unused=False inline=False]"}
  Arg_2.36 = f64[] parameter(2), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_prediction)/pjit[in_shardings=(UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue) out_shardings=(UnspecifiedValue,) in_layouts=(None, None, None, None) out_layouts=(None,) resource_env=None donated_invars=(False, False, False, False) name=predict_mean keep_unused=False inline=False]"}
  multiply.38 = f64[] multiply(Arg_1.35, Arg_2.36), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_prediction)/jit(predict_mean)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  Arg_0.34 = f64[] parameter(0), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_prediction)/pjit[in_shardings=(UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue) out_shardings=(UnspecifiedValue,) in_layouts=(None, None, None, None) out_layouts=(None,) resource_env=None donated_invars=(False, False, False, False) name=predict_mean keep_unused=False inline=False]"}
  Arg_3.37 = f64[] parameter(3), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_prediction)/pjit[in_shardings=(UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue) out_shardings=(UnspecifiedValue,) in_layouts=(None, None, None, None) out_layouts=(None,) resource_env=None donated_invars=(False, False, False, False) name=predict_mean keep_unused=False inline=False]"}
  multiply.39 = f64[] multiply(Arg_0.34, Arg_3.37), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_prediction)/jit(predict_mean)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  ROOT add.40 = f64[] add(multiply.38, multiply.39), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_prediction)/jit(predict_mean)/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
} // predict_mean.33

_where.41 {
  Arg_0.42 = pred[] parameter(0), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_prediction)/jit(predict_precision)/pjit[in_shardings=(UnspecifiedValue, UnspecifiedValue, UnspecifiedValue) out_shardings=(UnspecifiedValue,) in_layouts=(None, None, None) out_layouts=(None,) resource_env=None donated_invars=(False, False, False) name=_where keep_unused=False inline=False]"}
  Arg_1.43 = f64[] parameter(1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_prediction)/jit(predict_precision)/pjit[in_shardings=(UnspecifiedValue, UnspecifiedValue, UnspecifiedValue) out_shardings=(UnspecifiedValue,) in_layouts=(None, None, None) out_layouts=(None,) resource_env=None donated_invars=(False, False, False) name=_where keep_unused=False inline=False]"}
  Arg_2.44 = f64[] parameter(2), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_prediction)/jit(predict_precision)/pjit[in_shardings=(UnspecifiedValue, UnspecifiedValue, UnspecifiedValue) out_shardings=(UnspecifiedValue,) in_layouts=(None, None, None) out_layouts=(None,) resource_env=None donated_invars=(False, False, False) name=_where keep_unused=False inline=False]"}
  ROOT select.45 = f64[] select(Arg_0.42, Arg_1.43, Arg_2.44), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_prediction)/jit(predict_precision)/jit(_where)/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
}

predict_precision.46 {
  constant.50 = f64[] constant(1)
  Arg_1.48 = f64[] parameter(1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_prediction)/pjit[in_shardings=(UnspecifiedValue, UnspecifiedValue, UnspecifiedValue) out_shardings=(UnspecifiedValue, UnspecifiedValue) in_layouts=(None, None, None) out_layouts=(None, None) resource_env=None donated_invars=(False, False, False) name=predict_precision keep_unused=False inline=False]"}
  divide.57 = f64[] divide(constant.50, Arg_1.48), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_prediction)/jit(predict_precision)/div" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  Arg_0.47 = f64[] parameter(0), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_prediction)/pjit[in_shardings=(UnspecifiedValue, UnspecifiedValue, UnspecifiedValue) out_shardings=(UnspecifiedValue, UnspecifiedValue) in_layouts=(None, None, None) out_layouts=(None, None) resource_env=None donated_invars=(False, False, False) name=predict_precision keep_unused=False inline=False]"}
  Arg_2.49 = f64[] parameter(2), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_prediction)/pjit[in_shardings=(UnspecifiedValue, UnspecifiedValue, UnspecifiedValue) out_shardings=(UnspecifiedValue, UnspecifiedValue) in_layouts=(None, None, None) out_layouts=(None, None) resource_env=None donated_invars=(False, False, False) name=predict_precision keep_unused=False inline=False]"}
  exponential.53 = f64[] exponential(Arg_2.49), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_prediction)/jit(predict_precision)/exp" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  multiply.54 = f64[] multiply(Arg_0.47, exponential.53), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_prediction)/jit(predict_precision)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  constant.52 = f64[] constant(1e-128)
  compare.55 = pred[] compare(multiply.54, constant.52), direction=GT, metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_prediction)/jit(predict_precision)/gt" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  constant.51 = f64[] constant(nan)
  call.56 = f64[] call(compare.55, multiply.54, constant.51), to_apply=_where.41
  add.58 = f64[] add(divide.57, call.56), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_prediction)/jit(predict_precision)/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  divide.59 = f64[] divide(constant.50, add.58), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_prediction)/jit(predict_precision)/div" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  multiply.60 = f64[] multiply(call.56, divide.59), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_prediction)/jit(predict_precision)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  ROOT tuple.61 = (f64[], f64[]) tuple(divide.59, multiply.60)
} // predict_precision.46

continuous_node_prediction.62 {
  Arg_0.63 = f64[] parameter(0), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/pjit[in_shardings=(UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue) out_shardings=(UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue) in_layouts=(None, None, None, None, None, None) out_layouts=(None, None, None, None) resource_env=None donated_invars=(False, False, False, False, False, False) name=continuous_node_prediction keep_unused=False inline=False]"}
  Arg_1.64 = f64[] parameter(1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/pjit[in_shardings=(UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue) out_shardings=(UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue) in_layouts=(None, None, None, None, None, None) out_layouts=(None, None, None, None) resource_env=None donated_invars=(False, False, False, False, False, False) name=continuous_node_prediction keep_unused=False inline=False]"}
  Arg_2.65 = f64[] parameter(2), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/pjit[in_shardings=(UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue) out_shardings=(UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue) in_layouts=(None, None, None, None, None, None) out_layouts=(None, None, None, None) resource_env=None donated_invars=(False, False, False, False, False, False) name=continuous_node_prediction keep_unused=False inline=False]"}
  Arg_4.67 = f64[] parameter(4), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/pjit[in_shardings=(UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue) out_shardings=(UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue) in_layouts=(None, None, None, None, None, None) out_layouts=(None, None, None, None) resource_env=None donated_invars=(False, False, False, False, False, False) name=continuous_node_prediction keep_unused=False inline=False]"}
  call.71 = f64[] call(Arg_0.63, Arg_1.64, Arg_2.65, Arg_4.67), to_apply=predict_mean.33
  Arg_3.66 = f64[] parameter(3), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/pjit[in_shardings=(UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue) out_shardings=(UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue) in_layouts=(None, None, None, None, None, None) out_layouts=(None, None, None, None) resource_env=None donated_invars=(False, False, False, False, False, False) name=continuous_node_prediction keep_unused=False inline=False]"}
  Arg_5.68 = f64[] parameter(5), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/pjit[in_shardings=(UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue) out_shardings=(UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue) in_layouts=(None, None, None, None, None, None) out_layouts=(None, None, None, None) resource_env=None donated_invars=(False, False, False, False, False, False) name=continuous_node_prediction keep_unused=False inline=False]"}
  call.72 = (f64[], f64[]) call(Arg_0.63, Arg_3.66, Arg_5.68), to_apply=predict_precision.46
  get-tuple-element.73 = f64[] get-tuple-element(call.72), index=0
  constant.69 = f64[] constant(1)
  divide.70 = f64[] divide(constant.69, Arg_3.66), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_prediction)/div" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  get-tuple-element.74 = f64[] get-tuple-element(call.72), index=1
  ROOT tuple.75 = (f64[], f64[], f64[], f64[]) tuple(call.71, get-tuple-element.73, divide.70, get-tuple-element.74)
} // continuous_node_prediction.62

binary_state_node_prediction.76 {
  constant.78 = f64[] constant(1)
  Arg_0.77 = f64[] parameter(0), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/pjit[in_shardings=(UnspecifiedValue,) out_shardings=(UnspecifiedValue, UnspecifiedValue) in_layouts=(None,) out_layouts=(None, None) resource_env=None donated_invars=(False,) name=binary_state_node_prediction keep_unused=False inline=False]"}
  negate.79 = f64[] negate(Arg_0.77), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(binary_state_node_prediction)/neg" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  exponential.80 = f64[] exponential(negate.79), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(binary_state_node_prediction)/exp" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  add.81 = f64[] add(exponential.80, constant.78), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(binary_state_node_prediction)/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  divide.82 = f64[] divide(constant.78, add.81), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(binary_state_node_prediction)/div" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  subtract.83 = f64[] subtract(constant.78, divide.82), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(binary_state_node_prediction)/sub" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  multiply.84 = f64[] multiply(divide.82, subtract.83), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(binary_state_node_prediction)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  ROOT tuple.85 = (f64[], f64[]) tuple(divide.82, multiply.84)
} // binary_state_node_prediction.76

binary_state_node_prediction_error.86 {
  Arg_2.89 = f64[] parameter(2), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/pjit[in_shardings=(UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue) out_shardings=(UnspecifiedValue,) in_layouts=(None, None, None, None) out_layouts=(None,) resource_env=None donated_invars=(False, False, False, False) name=binary_state_node_prediction_error keep_unused=False inline=False]"}
  Arg_0.87 = f64[] parameter(0), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/pjit[in_shardings=(UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue) out_shardings=(UnspecifiedValue,) in_layouts=(None, None, None, None) out_layouts=(None,) resource_env=None donated_invars=(False, False, False, False) name=binary_state_node_prediction_error keep_unused=False inline=False]"}
  subtract.91 = f64[] subtract(Arg_2.89, Arg_0.87), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(binary_state_node_prediction_error)/sub" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  Arg_3.90 = s64[] parameter(3), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/pjit[in_shardings=(UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue) out_shardings=(UnspecifiedValue,) in_layouts=(None, None, None, None) out_layouts=(None,) resource_env=None donated_invars=(False, False, False, False) name=binary_state_node_prediction_error keep_unused=False inline=False]"}
  convert.92 = f64[] convert(Arg_3.90), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(binary_state_node_prediction_error)/convert_element_type[new_dtype=float64 weak_type=False sharding=None]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  multiply.93 = f64[] multiply(subtract.91, convert.92), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(binary_state_node_prediction_error)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  Arg_1.88 = f64[] parameter(1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/pjit[in_shardings=(UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue) out_shardings=(UnspecifiedValue,) in_layouts=(None, None, None, None) out_layouts=(None,) resource_env=None donated_invars=(False, False, False, False) name=binary_state_node_prediction_error keep_unused=False inline=False]"}
  ROOT divide.94 = f64[] divide(multiply.93, Arg_1.88), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(binary_state_node_prediction_error)/div" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
} // binary_state_node_prediction_error.86

region_1.95 {
  Arg_0.96 = pred[] parameter(0), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/reduce_or[axes=(0,)]"}
  Arg_1.97 = pred[] parameter(1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/reduce_or[axes=(0,)]"}
  ROOT or.98 = pred[] or(Arg_0.96, Arg_1.97), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/reduce_or[axes=(0,)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
}

precision_update_missing_values.99 {
  constant.103 = f64[] constant(1)
  Arg_1.101 = f64[] parameter(1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/pjit[in_shardings=(UnspecifiedValue, UnspecifiedValue, UnspecifiedValue) out_shardings=(UnspecifiedValue,) in_layouts=(None, None, None) out_layouts=(None,) resource_env=None donated_invars=(False, False, False) name=precision_update_missing_values keep_unused=False inline=False]"}
  divide.106 = f64[] divide(constant.103, Arg_1.101), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/div" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  Arg_0.100 = f64[] parameter(0), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/pjit[in_shardings=(UnspecifiedValue, UnspecifiedValue, UnspecifiedValue) out_shardings=(UnspecifiedValue,) in_layouts=(None, None, None) out_layouts=(None,) resource_env=None donated_invars=(False, False, False) name=precision_update_missing_values keep_unused=False inline=False]"}
  Arg_2.102 = f64[] parameter(2), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/pjit[in_shardings=(UnspecifiedValue, UnspecifiedValue, UnspecifiedValue) out_shardings=(UnspecifiedValue,) in_layouts=(None, None, None) out_layouts=(None,) resource_env=None donated_invars=(False, False, False) name=precision_update_missing_values keep_unused=False inline=False]"}
  exponential.104 = f64[] exponential(Arg_2.102), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/exp" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  multiply.105 = f64[] multiply(Arg_0.100, exponential.104), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  add.107 = f64[] add(divide.106, multiply.105), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  ROOT divide.108 = f64[] divide(constant.103, add.107), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/div" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
} // precision_update_missing_values.99

region_2.109 {
  arg_tuple.110 = (f64[], f64[], f64[]) parameter(0)
  get-tuple-element.111 = f64[] get-tuple-element(arg_tuple.110), index=0
  get-tuple-element.112 = f64[] get-tuple-element(arg_tuple.110), index=1
  get-tuple-element.113 = f64[] get-tuple-element(arg_tuple.110), index=2
  ROOT call.114 = f64[] call(get-tuple-element.111, get-tuple-element.112, get-tuple-element.113), to_apply=precision_update_missing_values.99
}

_where.115 {
  Arg_0.116 = pred[] parameter(0), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_prediction)/jit(predict_precision)/pjit[in_shardings=(UnspecifiedValue, UnspecifiedValue, UnspecifiedValue) out_shardings=(UnspecifiedValue,) in_layouts=(None, None, None) out_layouts=(None,) resource_env=None donated_invars=(False, False, False) name=_where keep_unused=False inline=False]"}
  Arg_1.117 = f64[] parameter(1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_prediction)/jit(predict_precision)/pjit[in_shardings=(UnspecifiedValue, UnspecifiedValue, UnspecifiedValue) out_shardings=(UnspecifiedValue,) in_layouts=(None, None, None) out_layouts=(None,) resource_env=None donated_invars=(False, False, False) name=_where keep_unused=False inline=False]"}
  Arg_2.118 = f64[] parameter(2), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_prediction)/jit(predict_precision)/pjit[in_shardings=(UnspecifiedValue, UnspecifiedValue, UnspecifiedValue) out_shardings=(UnspecifiedValue,) in_layouts=(None, None, None) out_layouts=(None,) resource_env=None donated_invars=(False, False, False) name=_where keep_unused=False inline=False]"}
  ROOT select.119 = f64[] select(Arg_0.116, Arg_1.117, Arg_2.118), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_prediction)/jit(predict_precision)/jit(_where)/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
}

precision_update.120 {
  Arg_2.123 = f64[] parameter(2), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_1_fun/pjit[in_shardings=(UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue) out_shardings=(UnspecifiedValue,) in_layouts=(None, None, None, None) out_layouts=(None,) resource_env=None donated_invars=(False, False, False, False) name=precision_update keep_unused=False inline=False]"}
  Arg_3.124 = f64[1]{0} parameter(3), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_1_fun/pjit[in_shardings=(UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue) out_shardings=(UnspecifiedValue,) in_layouts=(None, None, None, None) out_layouts=(None,) resource_env=None donated_invars=(False, False, False, False) name=precision_update keep_unused=False inline=False]"}
  reshape.128 = f64[] reshape(Arg_3.124), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_1_fun/jit(precision_update)/squeeze[dimensions=(0,)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  multiply.129 = f64[] multiply(reshape.128, reshape.128), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_1_fun/jit(precision_update)/integer_pow[y=2]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  Arg_0.121 = f64[] parameter(0), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_1_fun/pjit[in_shardings=(UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue) out_shardings=(UnspecifiedValue,) in_layouts=(None, None, None, None) out_layouts=(None,) resource_env=None donated_invars=(False, False, False, False) name=precision_update keep_unused=False inline=False]"}
  multiply.130 = f64[] multiply(multiply.129, Arg_0.121), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_1_fun/jit(precision_update)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  constant.127 = f64[] constant(0)
  subtract.131 = f64[] subtract(multiply.130, constant.127), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_1_fun/jit(precision_update)/sub" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  Arg_1.122 = s64[] parameter(1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_1_fun/pjit[in_shardings=(UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue) out_shardings=(UnspecifiedValue,) in_layouts=(None, None, None, None) out_layouts=(None,) resource_env=None donated_invars=(False, False, False, False) name=precision_update keep_unused=False inline=False]"}
  convert.132 = f64[] convert(Arg_1.122), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_1_fun/jit(precision_update)/convert_element_type[new_dtype=float64 weak_type=False sharding=None]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  multiply.133 = f64[] multiply(subtract.131, convert.132), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_1_fun/jit(precision_update)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  add.134 = f64[] add(Arg_2.123, multiply.133), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_1_fun/jit(precision_update)/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  constant.126 = f64[] constant(1e-128)
  compare.135 = pred[] compare(add.134, constant.126), direction=GT, metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_1_fun/jit(precision_update)/gt" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  constant.125 = f64[] constant(nan)
  ROOT call.136 = f64[] call(compare.135, add.134, constant.125), to_apply=_where.115
} // precision_update.120

region_3.137 {
  arg_tuple.138 = (f64[], s64[], f64[], f64[1]{0}) parameter(0)
  get-tuple-element.139 = f64[] get-tuple-element(arg_tuple.138), index=0
  get-tuple-element.140 = s64[] get-tuple-element(arg_tuple.138), index=1
  get-tuple-element.141 = f64[] get-tuple-element(arg_tuple.138), index=2
  get-tuple-element.142 = f64[1]{0} get-tuple-element(arg_tuple.138), index=3
  ROOT call.143 = f64[] call(get-tuple-element.139, get-tuple-element.140, get-tuple-element.141, get-tuple-element.142), to_apply=precision_update.120
} // region_3.137

posterior_update_precision_continuous_node.144 {
  Arg_2.147 = s64[] parameter(2), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/pjit[in_shardings=(UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue) out_shardings=(UnspecifiedValue,) in_layouts=(None, None, None, None, None, None, None) out_layouts=(None,) resource_env=None donated_invars=(False, False, False, False, False, False, False) name=posterior_update_precision_continuous_node keep_unused=False inline=False]"}
  reshape.154 = s64[1]{0} reshape(Arg_2.147), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/broadcast_in_dim[shape=(1,) broadcast_dimensions=()]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  constant.152 = s64[1]{0} constant({0})
  compare.155 = pred[1]{0} compare(reshape.154, constant.152), direction=NE, metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/convert_element_type[new_dtype=bool weak_type=False sharding=None]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  constant.153 = pred[] constant(false)
  reduce.156 = pred[] reduce(compare.155, constant.153), dimensions={0}, to_apply=region_1.95, metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/reduce_or[axes=(0,)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  convert.157 = s32[] convert(reduce.156), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/convert_element_type[new_dtype=int32 weak_type=False sharding=None]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  Arg_0.145 = f64[] parameter(0), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/pjit[in_shardings=(UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue) out_shardings=(UnspecifiedValue,) in_layouts=(None, None, None, None, None, None, None) out_layouts=(None,) resource_env=None donated_invars=(False, False, False, False, False, False, False) name=posterior_update_precision_continuous_node keep_unused=False inline=False]"}
  Arg_4.149 = f64[] parameter(4), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/pjit[in_shardings=(UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue) out_shardings=(UnspecifiedValue,) in_layouts=(None, None, None, None, None, None, None) out_layouts=(None,) resource_env=None donated_invars=(False, False, False, False, False, False, False) name=posterior_update_precision_continuous_node keep_unused=False inline=False]"}
  Arg_5.150 = f64[] parameter(5), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/pjit[in_shardings=(UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue) out_shardings=(UnspecifiedValue,) in_layouts=(None, None, None, None, None, None, None) out_layouts=(None,) resource_env=None donated_invars=(False, False, False, False, False, False, False) name=posterior_update_precision_continuous_node keep_unused=False inline=False]"}
  tuple.158 = (f64[], f64[], f64[]) tuple(Arg_0.145, Arg_4.149, Arg_5.150), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  Arg_1.146 = f64[] parameter(1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/pjit[in_shardings=(UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue) out_shardings=(UnspecifiedValue,) in_layouts=(None, None, None, None, None, None, None) out_layouts=(None,) resource_env=None donated_invars=(False, False, False, False, False, False, False) name=posterior_update_precision_continuous_node keep_unused=False inline=False]"}
  Arg_3.148 = f64[] parameter(3), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/pjit[in_shardings=(UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue) out_shardings=(UnspecifiedValue,) in_layouts=(None, None, None, None, None, None, None) out_layouts=(None,) resource_env=None donated_invars=(False, False, False, False, False, False, False) name=posterior_update_precision_continuous_node keep_unused=False inline=False]"}
  Arg_6.151 = f64[1]{0} parameter(6), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/pjit[in_shardings=(UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue) out_shardings=(UnspecifiedValue,) in_layouts=(None, None, None, None, None, None, None) out_layouts=(None,) resource_env=None donated_invars=(False, False, False, False, False, False, False) name=posterior_update_precision_continuous_node keep_unused=False inline=False]"}
  tuple.159 = (f64[], s64[], f64[], f64[1]{0}) tuple(Arg_1.146, Arg_2.147, Arg_3.148, Arg_6.151), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  ROOT conditional.160 = f64[] conditional(convert.157, tuple.158, tuple.159), branch_computations={region_2.109, region_3.137}, metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
} // posterior_update_precision_continuous_node.144

posterior_update_mean_continuous_node.161 {
  Arg_3.165 = f64[] parameter(3), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/pjit[in_shardings=(UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue) out_shardings=(UnspecifiedValue,) in_layouts=(None, None, None, None, None, None) out_layouts=(None,) resource_env=None donated_invars=(False, False, False, False, False, False) name=posterior_update_mean_continuous_node keep_unused=False inline=False]"}
  Arg_4.166 = f64[1]{0} parameter(4), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/pjit[in_shardings=(UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue) out_shardings=(UnspecifiedValue,) in_layouts=(None, None, None, None, None, None) out_layouts=(None,) resource_env=None donated_invars=(False, False, False, False, False, False) name=posterior_update_mean_continuous_node keep_unused=False inline=False]"}
  reshape.168 = f64[] reshape(Arg_4.166), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_mean_continuous_node)/squeeze[dimensions=(0,)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  Arg_0.162 = f64[] parameter(0), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/pjit[in_shardings=(UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue) out_shardings=(UnspecifiedValue,) in_layouts=(None, None, None, None, None, None) out_layouts=(None,) resource_env=None donated_invars=(False, False, False, False, False, False) name=posterior_update_mean_continuous_node keep_unused=False inline=False]"}
  multiply.171 = f64[] multiply(reshape.168, Arg_0.162), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_mean_continuous_node)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  Arg_5.167 = f64[] parameter(5), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/pjit[in_shardings=(UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue) out_shardings=(UnspecifiedValue,) in_layouts=(None, None, None, None, None, None) out_layouts=(None,) resource_env=None donated_invars=(False, False, False, False, False, False) name=posterior_update_mean_continuous_node keep_unused=False inline=False]"}
  divide.172 = f64[] divide(multiply.171, Arg_5.167), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_mean_continuous_node)/div" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  Arg_2.164 = f64[] parameter(2), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/pjit[in_shardings=(UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue) out_shardings=(UnspecifiedValue,) in_layouts=(None, None, None, None, None, None) out_layouts=(None,) resource_env=None donated_invars=(False, False, False, False, False, False) name=posterior_update_mean_continuous_node keep_unused=False inline=False]"}
  Arg_1.163 = s64[] parameter(1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/pjit[in_shardings=(UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue) out_shardings=(UnspecifiedValue,) in_layouts=(None, None, None, None, None, None) out_layouts=(None,) resource_env=None donated_invars=(False, False, False, False, False, False) name=posterior_update_mean_continuous_node keep_unused=False inline=False]"}
  convert.169 = f64[] convert(Arg_1.163), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_mean_continuous_node)/convert_element_type[new_dtype=float64 weak_type=False sharding=None]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  multiply.170 = f64[] multiply(Arg_2.164, convert.169), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_mean_continuous_node)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  multiply.173 = f64[] multiply(divide.172, multiply.170), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_mean_continuous_node)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  ROOT add.174 = f64[] add(Arg_3.165, multiply.173), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_mean_continuous_node)/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
} // posterior_update_mean_continuous_node.161

continuous_node_posterior_update.175 {
  Arg_1.177 = f64[] parameter(1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/pjit[in_shardings=(UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue) out_shardings=(UnspecifiedValue, UnspecifiedValue) in_layouts=(None, None, None, None, None, None, None, None, None) out_layouts=(None, None) resource_env=None donated_invars=(False, False, False, False, False, False, False, False, False) name=continuous_node_posterior_update keep_unused=False inline=False]"}
  Arg_2.178 = s64[] parameter(2), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/pjit[in_shardings=(UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue) out_shardings=(UnspecifiedValue, UnspecifiedValue) in_layouts=(None, None, None, None, None, None, None, None, None) out_layouts=(None, None) resource_env=None donated_invars=(False, False, False, False, False, False, False, False, False) name=continuous_node_posterior_update keep_unused=False inline=False]"}
  Arg_3.179 = f64[] parameter(3), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/pjit[in_shardings=(UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue) out_shardings=(UnspecifiedValue, UnspecifiedValue) in_layouts=(None, None, None, None, None, None, None, None, None) out_layouts=(None, None) resource_env=None donated_invars=(False, False, False, False, False, False, False, False, False) name=continuous_node_posterior_update keep_unused=False inline=False]"}
  Arg_4.180 = f64[] parameter(4), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/pjit[in_shardings=(UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue) out_shardings=(UnspecifiedValue, UnspecifiedValue) in_layouts=(None, None, None, None, None, None, None, None, None) out_layouts=(None, None) resource_env=None donated_invars=(False, False, False, False, False, False, False, False, False) name=continuous_node_posterior_update keep_unused=False inline=False]"}
  Arg_8.184 = f64[1]{0} parameter(8), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/pjit[in_shardings=(UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue) out_shardings=(UnspecifiedValue, UnspecifiedValue) in_layouts=(None, None, None, None, None, None, None, None, None) out_layouts=(None, None) resource_env=None donated_invars=(False, False, False, False, False, False, False, False, False) name=continuous_node_posterior_update keep_unused=False inline=False]"}
  Arg_0.176 = f64[] parameter(0), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/pjit[in_shardings=(UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue) out_shardings=(UnspecifiedValue, UnspecifiedValue) in_layouts=(None, None, None, None, None, None, None, None, None) out_layouts=(None, None) resource_env=None donated_invars=(False, False, False, False, False, False, False, False, False) name=continuous_node_posterior_update keep_unused=False inline=False]"}
  Arg_5.181 = f64[] parameter(5), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/pjit[in_shardings=(UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue) out_shardings=(UnspecifiedValue, UnspecifiedValue) in_layouts=(None, None, None, None, None, None, None, None, None) out_layouts=(None, None) resource_env=None donated_invars=(False, False, False, False, False, False, False, False, False) name=continuous_node_posterior_update keep_unused=False inline=False]"}
  Arg_6.182 = f64[] parameter(6), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/pjit[in_shardings=(UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue) out_shardings=(UnspecifiedValue, UnspecifiedValue) in_layouts=(None, None, None, None, None, None, None, None, None) out_layouts=(None, None) resource_env=None donated_invars=(False, False, False, False, False, False, False, False, False) name=continuous_node_posterior_update keep_unused=False inline=False]"}
  Arg_7.183 = f64[] parameter(7), metadata={op_name="jit(scan)/jit(main)/while/body/jit(beliefs_propagation)/pjit[in_shardings=(UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue, UnspecifiedValue) out_shardings=(UnspecifiedValue, UnspecifiedValue) in_layouts=(None, None, None, None, None, None, None, None, None) out_layouts=(None, None) resource_env=None donated_invars=(False, False, False, False, False, False, False, False, False) name=continuous_node_posterior_update keep_unused=False inline=False]"}
  call.185 = f64[] call(Arg_0.176, Arg_1.177, Arg_2.178, Arg_5.181, Arg_6.182, /*index=5*/Arg_7.183, Arg_8.184), to_apply=posterior_update_precision_continuous_node.144
  call.186 = f64[] call(Arg_1.177, Arg_2.178, Arg_3.179, Arg_4.180, Arg_8.184, /*index=5*/call.185), to_apply=posterior_update_mean_continuous_node.161
  ROOT tuple.187 = (f64[], f64[]) tuple(call.186, call.185)
} // continuous_node_posterior_update.175

beliefs_propagation.188 {
