HloModule jit_scan, is_scheduled=true, entry_computation_layout={(f64[2,48]{1,0}, f64[2,48]{1,0}, f64[2,48]{1,0}, f64[2,48]{1,0}, f64[2,48]{1,0}, /*index=5*/f64[2,48]{1,0}, f64[2]{0}, f64[2,48]{1,0}, f64[2,48]{1,0}, f64[2,48]{1,0}, /*index=10*/f64[2,48]{1,0}, f64[2,48]{1,0}, f64[2,48]{1,0}, u32[10,2]{1,0})->(f64[2,48]{1,0}, f64[2,48]{1,0}, f64[2,48]{1,0}, f64[2,48]{1,0}, f64[2,48]{1,0}, /*index=5*/f64[2,48]{1,0}, f64[2]{0}, f64[2,48]{1,0}, f64[2,48]{1,0}, f64[2,48]{1,0}, /*index=10*/f64[2,48]{1,0}, f64[2,48]{1,0}, f64[2,48]{1,0}, f64[10,2,48]{2,1,0}, f64[10,2,48]{2,1,0}, /*index=15*/f64[10,2,48]{2,1,0}, f64[10,2,48]{2,1,0}, f64[10,2,48]{2,1,0}, f64[10,2,48]{2,1,0}, f64[10,2]{1,0}, /*index=20*/f64[10,2,48]{2,1,0}, f64[10,2,48]{2,1,0}, f64[10,2,48]{2,1,0}, f64[10,2,48]{2,1,0}, f64[10,2,48]{2,1,0}, /*index=25*/f64[10,2,48]{2,1,0}, f64[10,2,48]{2,1,0}, f64[10,2,48]{2,1,0}, f64[10,2,48]{2,1,0}, f64[10,2,48]{2,1,0}, /*index=30*/f64[10,2,48]{2,1,0}, f64[10,2,48]{2,1,0}, pred[10,2]{1,0}, pred[10,2]{1,0}, f64[10,2]{1,0}, /*index=35*/f64[10,2,48]{2,1,0}, f64[10,2,48]{2,1,0}, f64[10,2,48]{2,1,0}, f64[10,2,48]{2,1,0}, f64[10,2,48]{2,1,0}, /*index=40*/f64[10,2,48]{2,1,0}, f64[10,2,48]{2,1,0}, f64[10,2,48]{2,1,0}, f64[10,2,48]{2,1,0}, f64[10,2,48]{2,1,0}, /*index=45*/f64[10,2,48]{2,1,0}, f64[10,2,48]{2,1,0}, f64[10,2]{1,0}, f64[10,2,48]{2,1,0}, f64[10,2,48]{2,1,0}, /*index=50*/f64[10,2,48]{2,1,0}, f64[10,2,48]{2,1,0}, f64[10,2,48]{2,1,0}, f64[10,2,48]{2,1,0}, f64[10,2,48]{2,1,0}, /*index=55*/f64[10,2,48]{2,1,0}, f64[10,2,48]{2,1,0}, f64[10,2,48]{2,1,0}, f64[10,2,48]{2,1,0}, f64[10,2,48]{2,1,0}, /*index=60*/f64[10,2,48]{2,1,0}, f64[10,2,48]{2,1,0}, f64[10,2,48]{2,1,0}, f64[10,2,48]{2,1,0}, f64[10,2,48]{2,1,0}, /*index=65*/f64[10,2,48]{2,1,0}, f64[10,2]{1,0}, f64[10,2,48]{2,1,0}, f64[10,2,48]{2,1,0}, f64[10,2,48]{2,1,0}, /*index=70*/f64[10,2,48]{2,1,0}, f64[10,2,48]{2,1,0}, f64[10,2,48]{2,1,0}, s64[10,2]{1,0}, s64[10,2]{1,0}, /*index=75*/f64[10,2]{1,0})}, allow_spmd_sharding_propagation_to_parameters={true,true,true,true,true,true,true,true,true,true,true,true,true,true}, allow_spmd_sharding_propagation_to_output={true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true}, frontend_attributes={fingerprint_before_lhs="42cddb9af6e1a4780666ce1d8f226a44"}

fused_select {
  param_3.49 = s32[2]{0} parameter(3)
  param_4.45 = s32[2]{0} parameter(4)
  compare.1126.2 = pred[2]{0} compare(param_3.49, param_4.45), direction=GE, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body_pred/ge" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  param_0.36 = pred[2]{0} parameter(0)
  not.20.2 = pred[2]{0} not(param_0.36), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body_pred/not" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  and.64.1 = pred[2]{0} and(compare.1126.2, not.20.2), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body_pred/and" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  param_2.57 = f64[2]{0} parameter(2)
  constant_6912_1 = f64[] constant(0)
  broadcast.4015.clone.9 = f64[2]{0} broadcast(constant_6912_1), dimensions={}
  compare.1128.3 = pred[2]{0} compare(param_2.57, broadcast.4015.clone.9), direction=LE, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body/le" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  param_1.53 = f64[2]{0} parameter(1)
  compare.1129.5 = pred[2]{0} compare(param_1.53, broadcast.4015.clone.9), direction=LE, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body/le" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  or.801.3 = pred[2]{0} or(compare.1128.3, compare.1129.5), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body/or" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  select.2971.1 = pred[2]{0} select(and.64.1, or.801.3, param_0.36), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while[cond_nconsts=1 body_nconsts=5]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  constant_1334_1_clone_1 = s32[] constant(-1)
  broadcast.4010.3.clone.1 = s32[2]{0} broadcast(constant_1334_1_clone_1), dimensions={}
  add.3970.3.clone.1 = s32[2]{0} add(param_3.49, broadcast.4010.3.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body/sub" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  select.2969.1.clone.1 = s32[2]{0} select(and.64.1, add.3970.3.clone.1, param_3.49), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while[cond_nconsts=1 body_nconsts=5]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  ROOT tuple.479 = (pred[2]{0}, s32[2]{0}) tuple(select.2971.1, select.2969.1.clone.1)
} // fused_select

scalar_add_computation {
  scalar_rhs = f64[] parameter(1)
  scalar_lhs = f64[] parameter(0)
  ROOT add.3969 = f64[] add(scalar_lhs, scalar_rhs)
}

fused_reduce {
  param_0.50 = f64[2,288]{1,0} parameter(0)
  param_3.54 = f64[2,288]{1,0} parameter(3)
  param_4.52 = f64[2,10,288]{2,1,0} parameter(4)
  iota.42.18 = s32[2,1]{1,0} iota(), iota_dimension=0, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body/iota[dtype=int32 shape=(2, 1) dimension=0]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  param_2.60 = s32[2]{0} parameter(2)
  constant_6918_2 = s32[] constant(0)
  broadcast.4011.18 = s32[2]{0} broadcast(constant_6918_2), dimensions={}
  compare.1127.18 = pred[2]{0} compare(param_2.60, broadcast.4011.18), direction=LT, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body/lt" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  constant_6920_2 = s32[] constant(10)
  broadcast.4012.18 = s32[2]{0} broadcast(constant_6920_2), dimensions={}
  add.3971.18 = s32[2]{0} add(param_2.60, broadcast.4012.18), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  select.2970.18 = s32[2]{0} select(compare.1127.18, add.3971.18, param_2.60), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  bitcast.10507.27 = s32[2,1]{1,0} bitcast(select.2970.18)
  broadcast.4013.18 = s32[2,1]{1,0} broadcast(constant_6918_2), dimensions={}
  concatenate.36.27 = s32[2,3]{1,0} concatenate(iota.42.18, bitcast.10507.27, broadcast.4013.18), dimensions={1}, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body/concatenate[dimension=1]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  gather.4.9 = f64[2,1,1,288]{3,0,2,1} gather(param_4.52, concatenate.36.27), offset_dims={1,2,3}, collapsed_slice_dims={}, start_index_map={0,1,2}, index_vector_dim=1, slice_sizes={1,1,288}, indices_are_sorted=true, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body/gather[dimension_numbers=GatherDimensionNumbers(offset_dims=(np.int64(1), np.int64(2)), collapsed_slice_dims=(0,), start_index_map=(0, np.int64(1), np.int64(2))) slice_sizes=(1, 1, 288) unique_indices=True indices_are_sorted=True mode=GatherScatterMode.PROMISE_IN_BOUNDS fill_value=None]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  bitcast.10525.7 = f64[2,288]{1,0} bitcast(gather.4.9)
  subtract.218.7 = f64[2,288]{1,0} subtract(param_3.54, bitcast.10525.7), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body/sub" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  param_1.71 = f64[2,10,288]{2,1,0} parameter(1)
  gather.3.15 = f64[2,1,1,288]{3,0,2,1} gather(param_1.71, concatenate.36.27), offset_dims={1,2,3}, collapsed_slice_dims={}, start_index_map={0,1,2}, index_vector_dim=1, slice_sizes={1,1,288}, indices_are_sorted=true, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body/gather[dimension_numbers=GatherDimensionNumbers(offset_dims=(np.int64(1), np.int64(2)), collapsed_slice_dims=(0,), start_index_map=(0, np.int64(1), np.int64(2))) slice_sizes=(1, 1, 288) unique_indices=True indices_are_sorted=True mode=GatherScatterMode.PROMISE_IN_BOUNDS fill_value=None]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  bitcast.10535.19 = f64[2,288]{1,0} bitcast(gather.3.15)
  add.3972.9 = f64[2,288]{1,0} add(subtract.218.7, bitcast.10535.19), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  add.3973.9 = f64[2,288]{1,0} add(param_0.50, bitcast.10535.19), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  constant_1117_1 = f64[] constant(0.5)
  broadcast.4014.7 = f64[2,288]{1,0} broadcast(constant_1117_1), dimensions={}
  multiply.2886.7 = f64[2,288]{1,0} multiply(add.3973.9, broadcast.4014.7), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body/div" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  subtract.219.7 = f64[2,288]{1,0} subtract(add.3972.9, multiply.2886.7), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body/sub" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  multiply.2888.3 = f64[2,288]{1,0} multiply(param_0.50, subtract.219.7)
  constant_6912_3 = f64[] constant(0)
  reduce.14.1 = f64[2]{0} reduce(multiply.2888.3, constant_6912_3), dimensions={1}, to_apply=scalar_add_computation, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body/dot_general[dimension_numbers=(((1,), (1,)), ((0,), (0,))) precision=None preferred_element_type=float64]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  multiply.2887.3.clone.1 = f64[2,288]{1,0} multiply(bitcast.10535.19, subtract.219.7)
  reduce.13.1.clone.1 = f64[2]{0} reduce(multiply.2887.3.clone.1, constant_6912_3), dimensions={1}, to_apply=scalar_add_computation, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body/dot_general[dimension_numbers=(((1,), (1,)), ((0,), (0,))) precision=None preferred_element_type=float64]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  ROOT tuple.478 = (f64[2]{0}, f64[2]{0}) tuple(reduce.14.1, reduce.13.1.clone.1)
} // fused_reduce

region_35.6903 {
  arg_tuple.6904.0 = (s32[2]{0}, pred[2]{0}, s32[2]{0}, f64[2,10,288]{2,1,0}, f64[2,288]{1,0}, /*index=5*/f64[2,10,288]{2,1,0}, f64[2,288]{1,0}) parameter(0)
  get-tuple-element.16418 = s32[2]{0} get-tuple-element(arg_tuple.6904.0), index=0
  get-tuple-element.16427 = s32[2]{0} get-tuple-element(arg_tuple.6904.0), index=2
  get-tuple-element.16428 = f64[2,10,288]{2,1,0} get-tuple-element(arg_tuple.6904.0), index=3
  get-tuple-element.16429 = f64[2,288]{1,0} get-tuple-element(arg_tuple.6904.0), index=4
  get-tuple-element.16430 = f64[2,10,288]{2,1,0} get-tuple-element(arg_tuple.6904.0), index=5
  get-tuple-element.16431 = f64[2,288]{1,0} get-tuple-element(arg_tuple.6904.0), index=6
  get-tuple-element.16419 = pred[2]{0} get-tuple-element(arg_tuple.6904.0), index=1
  input_reduce_fusion = (f64[2]{0}, f64[2]{0}) fusion(get-tuple-element.16431, get-tuple-element.16430, get-tuple-element.16418, get-tuple-element.16429, get-tuple-element.16428), kind=kInput, calls=fused_reduce, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body/dot_general[dimension_numbers=(((1,), (1,)), ((0,), (0,))) precision=None preferred_element_type=float64]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  get-tuple-element.15649 = f64[2]{0} get-tuple-element(input_reduce_fusion), index=1, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body/dot_general[dimension_numbers=(((1,), (1,)), ((0,), (0,))) precision=None preferred_element_type=float64]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  get-tuple-element.15648 = f64[2]{0} get-tuple-element(input_reduce_fusion), index=0, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/body/dot_general[dimension_numbers=(((1,), (1,)), ((0,), (0,))) precision=None preferred_element_type=float64]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  loop_select_fusion = (pred[2]{0}, s32[2]{0}) fusion(get-tuple-element.16419, get-tuple-element.15648, get-tuple-element.15649, get-tuple-element.16418, get-tuple-element.16427), kind=kLoop, calls=fused_select, control-predecessors={input_reduce_fusion}, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while[cond_nconsts=1 body_nconsts=5]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  get-tuple-element.16425 = s32[2]{0} get-tuple-element(loop_select_fusion), index=1, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while[cond_nconsts=1 body_nconsts=5]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  get-tuple-element.16426 = pred[2]{0} get-tuple-element(loop_select_fusion), index=0, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while[cond_nconsts=1 body_nconsts=5]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  ROOT tuple.756 = (s32[2]{0}, pred[2]{0}, s32[2]{0}, f64[2,10,288]{2,1,0}, f64[2,288]{1,0}, /*index=5*/f64[2,10,288]{2,1,0}, f64[2,288]{1,0}) tuple(get-tuple-element.16425, get-tuple-element.16426, get-tuple-element.16427, get-tuple-element.16428, get-tuple-element.16429, /*index=5*/get-tuple-element.16430, get-tuple-element.16431)
} // region_35.6903

region_37.6968 {
  Arg_1.6970 = pred[] parameter(1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while[cond_nconsts=1 body_nconsts=5]"}
  Arg_0.6969 = pred[] parameter(0), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while[cond_nconsts=1 body_nconsts=5]"}
  ROOT or.802 = pred[] or(Arg_0.6969, Arg_1.6970), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while[cond_nconsts=1 body_nconsts=5]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
}

fused_reduce.1 {
  param_1.77 = s32[2]{0} parameter(1)
  param_2.66 = s32[2]{0} parameter(2)
  compare.1130.1 = pred[2]{0} compare(param_1.77, param_2.66), direction=GE, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/cond/ge" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  param_0.54 = pred[2]{0} parameter(0)
  not.21.1 = pred[2]{0} not(param_0.54), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/cond/not" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  and.65.1 = pred[2]{0} and(compare.1130.1, not.21.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while/cond/and" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
  constant_6981_1 = pred[] constant(false)
  ROOT reduce.6985.1 = pred[] reduce(and.65.1, constant_6981_1), dimensions={0}, to_apply=region_37.6968, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while[cond_nconsts=1 body_nconsts=5]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
} // fused_reduce.1

region_36.6972 {
  arg_tuple.6973.0 = (s32[2]{0}, pred[2]{0}, s32[2]{0}, f64[2,10,288]{2,1,0}, f64[2,288]{1,0}, /*index=5*/f64[2,10,288]{2,1,0}, f64[2,288]{1,0}) parameter(0)
  get-tuple-element.6974.0 = s32[2]{0} get-tuple-element(arg_tuple.6973.0), index=0
  get-tuple-element.6976.0 = s32[2]{0} get-tuple-element(arg_tuple.6973.0), index=2
  get-tuple-element.6975.0 = pred[2]{0} get-tuple-element(arg_tuple.6973.0), index=1
  ROOT input_reduce_fusion.1 = pred[] fusion(get-tuple-element.6975.0, get-tuple-element.6974.0, get-tuple-element.6976.0), kind=kInput, calls=fused_reduce.1, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/while[cond_nconsts=1 body_nconsts=5]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical.py" source_line=1147}
}

fused_broadcast.2 {
  constant_1429_3 = f64[] constant(0)
  ROOT broadcast.4019.1 = f64[48,1]{1,0} broadcast(constant_1429_3), dimensions={}
}

fused_broadcast.1 {
  constant_1429_2 = f64[] constant(0)
  ROOT broadcast.4016.1 = f64[48]{0} broadcast(constant_1429_2), dimensions={}
}

fused_broadcast {
  constant_1429_1 = f64[] constant(0)
  ROOT broadcast.4017.1 = f64[2,48]{1,0} broadcast(constant_1429_1), dimensions={}
}

wrapped_copy_computation.176 {
  param_0.5672 = f64[2,48]{1,0} parameter(0)
  ROOT copy.1365 = f64[2,48]{1,0} copy(param_0.5672)
}

fused_multiply_negate {
  param_0.5407 = f64[2,48]{1,0} parameter(0)
  param_4.3730 = f64[] parameter(4)
  broadcast.4018.3.clone.1 = f64[2,48]{1,0} broadcast(param_4.3730), dimensions={}, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  param_2.5844 = f64[2,48]{1,0} parameter(2)
  param_3.4909 = f64[2,48]{1,0} parameter(3)
  multiply.2889.2.clone.1 = f64[2,48]{1,0} multiply(param_2.5844, param_3.4909), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  negate.466.4.clone.1 = f64[2,48]{1,0} negate(multiply.2889.2.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/neg" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  multiply.2891.3.clone.1 = f64[2,48]{1,0} multiply(broadcast.4018.3.clone.1, negate.466.4.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  param_1.7687 = f64[2,48]{1,0} parameter(1)
  multiply.2892.1.clone.1 = f64[2,48]{1,0} multiply(multiply.2891.3.clone.1, param_1.7687), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  multiply.2893.1 = f64[2,48]{1,0} multiply(param_0.5407, multiply.2892.1.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  param_5.2954 = f64[2,48]{1,0} parameter(5)
  multiply.2890.1.clone.1 = f64[2,48]{1,0} multiply(negate.466.4.clone.1, param_5.2954), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  negate.467.1.clone.1 = f64[2,48]{1,0} negate(multiply.2890.1.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/neg" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  ROOT tuple.481 = (f64[2,48]{1,0}, f64[2,48]{1,0}, f64[2,48]{1,0}) tuple(multiply.2893.1, multiply.2892.1.clone.1, negate.467.1.clone.1)
} // fused_multiply_negate

command_buffer.24 {
  p.1032 = f64[2,48]{1,0} parameter(0)
  p.1033 = f64[2,48]{1,0} parameter(1)
  p.1034 = f64[2,48]{1,0} parameter(2)
  p.1035 = f64[2,48]{1,0} parameter(3)
  p.1036 = f64[] parameter(4)
  p.1037 = f64[2,48]{1,0} parameter(5)
  loop_broadcast_fusion.2 = f64[48,1]{1,0} fusion(), kind=kLoop, calls=fused_broadcast.2
  loop_broadcast_fusion.1 = f64[48]{0} fusion(), kind=kLoop, calls=fused_broadcast.1
  loop_broadcast_fusion = f64[2,48]{1,0} fusion(), kind=kLoop, calls=fused_broadcast
  wrapped_copy.176 = f64[2,48]{1,0} fusion(loop_broadcast_fusion), kind=kLoop, calls=wrapped_copy_computation.176
  loop_multiply_negate_fusion = (f64[2,48]{1,0}, f64[2,48]{1,0}, f64[2,48]{1,0}) fusion(p.1032, p.1033, p.1034, p.1035, p.1036, /*index=5*/p.1037), kind=kLoop, calls=fused_multiply_negate, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  ROOT tuple.795 = (f64[48,1]{1,0}, f64[48]{0}, f64[2,48]{1,0}, f64[2,48]{1,0}, (f64[2,48]{1,0}, f64[2,48]{1,0}, f64[2,48]{1,0})) tuple(loop_broadcast_fusion.2, loop_broadcast_fusion.1, loop_broadcast_fusion, wrapped_copy.176, loop_multiply_negate_fusion)
} // command_buffer.24

region_29.5206.clone {
  arg_tuple.6.0 = (f64[2,48]{1,0}, f64[], f64[2,48]{1,0}, f64[2,48]{1,0}, f64[2,48]{1,0}, /*index=5*/f64[2,48]{1,0}) parameter(0)
  get-tuple-element.2425.0 = f64[] get-tuple-element(arg_tuple.6.0), index=1
  get-tuple-element.2429.0 = f64[2,48]{1,0} get-tuple-element(arg_tuple.6.0), index=5
  get-tuple-element.2428.0 = f64[2,48]{1,0} get-tuple-element(arg_tuple.6.0), index=4
  get-tuple-element.2427.0 = f64[2,48]{1,0} get-tuple-element(arg_tuple.6.0), index=3
  get-tuple-element.2426.0 = f64[2,48]{1,0} get-tuple-element(arg_tuple.6.0), index=2
  get-tuple-element.2424.0 = f64[2,48]{1,0} get-tuple-element(arg_tuple.6.0), index=0
  call.13 = (f64[48,1]{1,0}, f64[48]{0}, f64[2,48]{1,0}, f64[2,48]{1,0}, (f64[2,48]{1,0}, f64[2,48]{1,0}, f64[2,48]{1,0})) call(get-tuple-element.2426.0, get-tuple-element.2427.0, get-tuple-element.2429.0, get-tuple-element.2428.0, get-tuple-element.2425.0, /*index=5*/get-tuple-element.2424.0), to_apply=command_buffer.24
  get-tuple-element.18181 = f64[48,1]{1,0} get-tuple-element(call.13), index=0
  get-tuple-element.18182 = f64[48]{0} get-tuple-element(call.13), index=1
  get-tuple-element.18183 = f64[2,48]{1,0} get-tuple-element(call.13), index=2
  get-tuple-element.18184 = f64[2,48]{1,0} get-tuple-element(call.13), index=3
  get-tuple-element.18185 = (f64[2,48]{1,0}, f64[2,48]{1,0}, f64[2,48]{1,0}) get-tuple-element(call.13), index=4
  get-tuple-element.15971 = f64[2,48]{1,0} get-tuple-element(get-tuple-element.18185), index=2, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  get-tuple-element.15972 = f64[2,48]{1,0} get-tuple-element(get-tuple-element.18185), index=1, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  get-tuple-element.15973 = f64[2,48]{1,0} get-tuple-element(get-tuple-element.18185), index=0, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_0_fun/jit(precision_update_missing_values)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  ROOT tuple.746 = (f64[48]{0}, f64[2,48]{1,0}, f64[2,48]{1,0}, f64[2,48]{1,0}, f64[2,48]{1,0}, /*index=5*/f64[2,48]{1,0}, f64[48,1]{1,0}) tuple(get-tuple-element.18182, get-tuple-element.18183, get-tuple-element.18184, get-tuple-element.15971, get-tuple-element.15972, /*index=5*/get-tuple-element.15973, get-tuple-element.18181)
} // region_29.5206.clone

fused_broadcast.4 {
  constant_1436_3 = f64[] constant(0)
  ROOT broadcast.4023.1 = f64[48,1]{1,0} broadcast(constant_1436_3), dimensions={}
}

fused_broadcast.3 {
  constant_1436_2 = f64[] constant(0)
  ROOT broadcast.4020.1 = f64[48]{0} broadcast(constant_1436_2), dimensions={}
}

fused_broadcast_multiply_select {
  param_0.68 = f64[2,48]{1,0} parameter(0)
  param_2.5845 = pred[2,48]{1,0} parameter(2)
  param_3.4910 = f64[2,48]{1,0} parameter(3)
  constant_1436_1_clone_1 = f64[] constant(0)
  broadcast.4021.clone.2.1.clone.1 = f64[2,48]{1,0} broadcast(constant_1436_1_clone_1), dimensions={}, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_1_fun/jit(precision_update)/jit(_where)/broadcast_in_dim[shape=(2, 48) broadcast_dimensions=(np.int64(1),)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  select.2972.1 = f64[2,48]{1,0} select(param_2.5845, param_3.4910, broadcast.4021.clone.2.1.clone.1), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_1_fun/jit(precision_update)/jit(_where)/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  param_1.7688 = f64[] parameter(1)
  broadcast.4022.3 = f64[2,48]{1,0} broadcast(param_1.7688), dimensions={}, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_1_fun/jit(precision_update)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  multiply.2894.3 = f64[2,48]{1,0} multiply(select.2972.1, broadcast.4022.3), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_1_fun/jit(precision_update)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  multiply.2895.1 = f64[2,48]{1,0} multiply(param_0.68, multiply.2894.3), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_1_fun/jit(precision_update)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  ROOT tuple.483 = (f64[2,48]{1,0}, f64[2,48]{1,0}, f64[2,48]{1,0}) tuple(multiply.2895.1, select.2972.1, broadcast.4021.clone.2.1.clone.1)
} // fused_broadcast_multiply_select

wrapped_copy_computation.177 {
  param_0.5673 = f64[2,48]{1,0} parameter(0)
  ROOT copy.1366 = f64[2,48]{1,0} copy(param_0.5673)
}

wrapped_copy_computation.178 {
  param_0.5674 = f64[2,48]{1,0} parameter(0)
  ROOT copy.1367 = f64[2,48]{1,0} copy(param_0.5674)
}

command_buffer.22 {
  p.1024 = f64[2,48]{1,0} parameter(0)
  p.1025 = f64[] parameter(1)
  p.1026 = pred[2,48]{1,0} parameter(2)
  p.1027 = f64[2,48]{1,0} parameter(3)
  loop_broadcast_fusion.4 = f64[48,1]{1,0} fusion(), kind=kLoop, calls=fused_broadcast.4
  loop_broadcast_fusion.3 = f64[48]{0} fusion(), kind=kLoop, calls=fused_broadcast.3
  loop_broadcast_multiply_select_fusion = (f64[2,48]{1,0}, f64[2,48]{1,0}, f64[2,48]{1,0}) fusion(p.1024, p.1025, p.1026, p.1027), kind=kLoop, calls=fused_broadcast_multiply_select, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_1_fun/jit(precision_update)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  get-tuple-element.15980 = f64[2,48]{1,0} get-tuple-element(loop_broadcast_multiply_select_fusion), index=2, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_1_fun/jit(precision_update)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  get-tuple-element.15977 = f64[2,48]{1,0} get-tuple-element(loop_broadcast_multiply_select_fusion), index=1, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_1_fun/jit(precision_update)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  get-tuple-element.15976 = f64[2,48]{1,0} get-tuple-element(loop_broadcast_multiply_select_fusion), index=0, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update)/jit(posterior_update_precision_continuous_node)/cond/branch_1_fun/jit(precision_update)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  wrapped_copy.177 = f64[2,48]{1,0} fusion(get-tuple-element.15980), kind=kLoop, calls=wrapped_copy_computation.177
  wrapped_copy.178 = f64[2,48]{1,0} fusion(get-tuple-element.15980), kind=kLoop, calls=wrapped_copy_computation.178
  ROOT tuple.793 = (f64[48,1]{1,0}, f64[48]{0}, f64[2,48]{1,0}, f64[2,48]{1,0}, f64[2,48]{1,0}, /*index=5*/f64[2,48]{1,0}, f64[2,48]{1,0}) tuple(loop_broadcast_fusion.4, loop_broadcast_fusion.3, get-tuple-element.15980, get-tuple-element.15977, get-tuple-element.15976, /*index=5*/wrapped_copy.177, wrapped_copy.178)
} // command_buffer.22

region_30.5243.clone.clone {
  arg_tuple.8.0 = (f64[2,48]{1,0}, f64[], pred[2,48]{1,0}, f64[2,48]{1,0}) parameter(0)
  get-tuple-element.2449.0 = f64[] get-tuple-element(arg_tuple.8.0), index=1
  get-tuple-element.2451.0 = f64[2,48]{1,0} get-tuple-element(arg_tuple.8.0), index=3
  get-tuple-element.2450.0 = pred[2,48]{1,0} get-tuple-element(arg_tuple.8.0), index=2
  get-tuple-element.2448.0 = f64[2,48]{1,0} get-tuple-element(arg_tuple.8.0), index=0
  call.12 = (f64[48,1]{1,0}, f64[48]{0}, f64[2,48]{1,0}, f64[2,48]{1,0}, f64[2,48]{1,0}, /*index=5*/f64[2,48]{1,0}, f64[2,48]{1,0}) call(get-tuple-element.2448.0, get-tuple-element.2449.0, get-tuple-element.2450.0, get-tuple-element.2451.0), to_apply=command_buffer.22
  get-tuple-element.18174 = f64[48,1]{1,0} get-tuple-element(call.12), index=0
  get-tuple-element.18175 = f64[48]{0} get-tuple-element(call.12), index=1
  get-tuple-element.18176 = f64[2,48]{1,0} get-tuple-element(call.12), index=2
  get-tuple-element.18177 = f64[2,48]{1,0} get-tuple-element(call.12), index=3
  get-tuple-element.18178 = f64[2,48]{1,0} get-tuple-element(call.12), index=4
  get-tuple-element.18179 = f64[2,48]{1,0} get-tuple-element(call.12), index=5
  get-tuple-element.18180 = f64[2,48]{1,0} get-tuple-element(call.12), index=6
  ROOT tuple.747 = (f64[48]{0}, f64[2,48]{1,0}, f64[2,48]{1,0}, f64[2,48]{1,0}, f64[2,48]{1,0}, /*index=5*/f64[2,48]{1,0}, f64[48,1]{1,0}) tuple(get-tuple-element.18175, get-tuple-element.18178, get-tuple-element.18177, get-tuple-element.18176, get-tuple-element.18179, /*index=5*/get-tuple-element.18180, get-tuple-element.18174)
} // region_30.5243.clone.clone

fused_add_select {
  param_5.403 = pred[192,2,48]{2,1,0} parameter(5)
  constant_1987_14 = s64[] constant(191)
  param_8.262 = s64[] parameter(8)
  subtract.220.27 = s64[] subtract(constant_1987_14, param_8.262), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/sub" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  constant_1980_26 = s64[] constant(0)
  compare.1131.27 = pred[] compare(subtract.220.27, constant_1980_26), direction=LT, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/lt" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  constant_1988_14 = s64[] constant(383)
  subtract.221.27 = s64[] subtract(constant_1988_14, param_8.262), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/add" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  select.2973.27 = s64[] select(compare.1131.27, subtract.221.27, subtract.220.27), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  dynamic-slice.1237.17 = pred[1,2,48]{2,1,0} dynamic-slice(param_5.403, select.2973.27, constant_1980_26, constant_1980_26), dynamic_slice_sizes={1,2,48}, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/dynamic_slice[slice_sizes=(1, 2, 48)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  bitcast.10661.52 = pred[2,48]{1,0} bitcast(dynamic-slice.1237.17)
  constant_1982_16 = f64[] constant(0)
  broadcast.4024.clone.87 = f64[2,48]{1,0} broadcast(constant_1982_16), dimensions={}
  param_0.466 = f64[2,48]{1,0} parameter(0)
  select.3011.3 = f64[2,48]{1,0} select(bitcast.10661.52, broadcast.4024.clone.87, param_0.466), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(_where)/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  param_3.678 = pred[192,2,48]{2,1,0} parameter(3)
  dynamic-slice.1276.4 = pred[1,2,48]{2,1,0} dynamic-slice(param_3.678, select.2973.27, constant_1980_26, constant_1980_26), dynamic_slice_sizes={1,2,48}, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/dynamic_slice[slice_sizes=(1, 2, 48)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  bitcast.11553.8 = pred[2,48]{1,0} bitcast(dynamic-slice.1276.4)
  param_7.288 = s32[192,2,48]{2,1,0} parameter(7)
  dynamic-slice.1246.12 = s32[1,2,48]{2,1,0} dynamic-slice(param_7.288, select.2973.27, constant_1980_26, constant_1980_26), dynamic_slice_sizes={1,2,48}, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/dynamic_slice[slice_sizes=(1, 2, 48)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  constant_1985_1 = s32[] constant(0)
  broadcast.4029.7 = s32[1,2,48]{2,1,0} broadcast(constant_1985_1), dimensions={}, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update_ehgf)/jit(posterior_update_precision_continuous_node)/eq" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  compare.1133.7 = pred[1,2,48]{2,1,0} compare(dynamic-slice.1246.12, broadcast.4029.7), direction=EQ, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update_ehgf)/jit(posterior_update_precision_continuous_node)/eq" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  bitcast.11560.9 = pred[2,48]{1,0} bitcast(compare.1133.7)
  select.2983.19 = f64[2,48]{1,0} select(bitcast.10661.52, param_0.466, broadcast.4024.clone.87), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(_where)/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  select.3012.9 = f64[2,48]{1,0} select(bitcast.11560.9, select.2983.19, broadcast.4024.clone.87), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update_ehgf)/jit(posterior_update_precision_continuous_node)/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  param_6.352 = f64[192,2,48]{2,1,0} parameter(6)
  dynamic-slice.1277.5 = f64[1,2,48]{2,1,0} dynamic-slice(param_6.352, select.2973.27, constant_1980_26, constant_1980_26), dynamic_slice_sizes={1,2,48}, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/dynamic_slice[slice_sizes=(1, 2, 48)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  bitcast.11574.7 = f64[2,48]{1,0} bitcast(dynamic-slice.1277.5)
  multiply.2939.7 = f64[2,48]{1,0} multiply(select.3012.9, bitcast.11574.7), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update_ehgf)/jit(posterior_update_precision_continuous_node)/jit(precision_update_missing_values)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  negate.478.5 = f64[2,48]{1,0} negate(multiply.2939.7), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update_ehgf)/jit(posterior_update_precision_continuous_node)/jit(precision_update_missing_values)/neg" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  param_2.802 = f64[192,2,48]{2,1,0} parameter(2)
  dynamic-slice.1278.7 = f64[1,2,48]{2,1,0} dynamic-slice(param_2.802, select.2973.27, constant_1980_26, constant_1980_26), dynamic_slice_sizes={1,2,48}, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/dynamic_slice[slice_sizes=(1, 2, 48)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  bitcast.11585.15 = f64[2,48]{1,0} bitcast(dynamic-slice.1278.7)
  multiply.2940.9 = f64[2,48]{1,0} multiply(negate.478.5, bitcast.11585.15), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update_ehgf)/jit(posterior_update_precision_continuous_node)/jit(precision_update_missing_values)/mul" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  negate.479.7 = f64[2,48]{1,0} negate(multiply.2940.9), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update_ehgf)/jit(posterior_update_precision_continuous_node)/jit(precision_update_missing_values)/neg" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  select.3013.5 = f64[2,48]{1,0} select(bitcast.11553.8, negate.479.7, broadcast.4024.clone.87), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update_ehgf)/jit(posterior_update_precision_continuous_node)/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  param_1.1015 = f64[48]{0} parameter(1)
  broadcast.4026.39 = f64[2,48]{1,0} broadcast(param_1.1015), dimensions={1}, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/broadcast_in_dim[shape=(2, 48) broadcast_dimensions=(np.int64(1),)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  add.4024.3 = f64[2,48]{1,0} add(select.3013.5, broadcast.4026.39), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/add_any" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  param_18.156 = f64[2,48]{1,0} parameter(18)
  select.3014.9 = f64[2,48]{1,0} select(bitcast.10661.52, param_18.156, broadcast.4024.clone.87), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(_where)/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/env/pat_rl_simulator.py" source_line=92}
  param_17.194 = pred[192,2,48]{2,1,0} parameter(17)
  dynamic-slice.1243.11 = pred[1,2,48]{2,1,0} dynamic-slice(param_17.194, select.2973.27, constant_1980_26, constant_1980_26), dynamic_slice_sizes={1,2,48}, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/dynamic_slice[slice_sizes=(1, 2, 48)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  bitcast.10789.23 = pred[2,48]{1,0} bitcast(dynamic-slice.1243.11)
  param_16.186 = pred[192,2,48]{2,1,0} parameter(16)
  dynamic-slice.1245.14 = pred[1,2,48]{2,1,0} dynamic-slice(param_16.186, select.2973.27, constant_1980_26, constant_1980_26), dynamic_slice_sizes={1,2,48}, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/dynamic_slice[slice_sizes=(1, 2, 48)]" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=378}
  bitcast.10807.17 = pred[2,48]{1,0} bitcast(dynamic-slice.1245.14)
  constant_1983_1 = s32[] constant(1)
  broadcast.4025.15 = s32[1,2,48]{2,1,0} broadcast(constant_1983_1), dimensions={}
  compare.1132.15 = pred[1,2,48]{2,1,0} compare(dynamic-slice.1246.12, broadcast.4025.15), direction=EQ, metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update_ehgf)/jit(posterior_update_precision_continuous_node)/eq" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
  bitcast.10819.19 = pred[2,48]{1,0} bitcast(compare.1132.15)
  select.2984.19 = f64[2,48]{1,0} select(bitcast.10819.19, select.2983.19, broadcast.4024.clone.87), metadata={op_name="jit(scan)/jit(main)/while/body/jit(_one_step)/vmap(while)/body/while/body/transpose(jvp(vmap(while)))/body/jit(beliefs_propagation)/jit(continuous_node_posterior_update_ehgf)/jit(posterior_update_precision_continuous_node)/select_n" source_file="/fs04/fc37/adam/projects/psilocybin-prl-analyses/src/prl_hgf/fitting/hierarchical_patrl.py" source_line=362}
